#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Для каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		ПараметрыУчетнойПолитики = Справочники.УчетныеПолитикиОрганизаций.ПараметрыУчетнойПолитики(СтрокаНабора.УчетнаяПолитика);
		Если ПараметрыУчетнойПолитики <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаНабора, ПараметрыУчетнойПолитики);
		КонецЕсли;
		УчетнаяПолитикаПереопределяемый.ПреобразоватьЗаписьУчетнойПолитикиПередЗаписью(СтрокаНабора, Истина);

	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	
	РегистрыСведений.СтатусыПлательщиковЕдиногоНалога.АктуализироватьДанные(ЭтотОбъект);
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли