
#Область ПрограммныйИнтерфейс

#Область ПереопределяемыеФункцииУправленияДоступом

// Заполняет массив структур, которые будут использованы для начального заполнения и
// восстановления начального заполнения профилей.
//
// Параметры:
//  ОписанияПрофилей	- Массив
//
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

	ДоступныРолиФизическихЛицБЗКР = ДоступныРолиФизическихЛицБЗКР();
	
#Область Описание_профиля_СупервайзерТорговыхПредставителей
	// Профиль "Супервайзер торговых представителей".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "СупервайзерТорговыхПредставителей";
	ОписаниеПрофиля.Идентификатор = "ef2371ca-1f4a-4480-be8c-fcb685871343";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Супервайзер торговых представителей';uk='Супервайзер торгових представників'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение. 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений"); 
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	
	//Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыУПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	
	//Добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеОтгрузкиПоРеализации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПриемкиПоВозвратуОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("СозданиеАктовВыполненныхРаботБезЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданийТорговымПредставителям");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменаДаннымиСКПК");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИндивидуальныхСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("СозданиеРеализацииТоваровУслугБезЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("РеализацияСверхЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	
	//Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	//Согласование продажи.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиУчастниковСогласованияУсловийПродаж");
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации","Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "ВначалеВсеРазрешены");
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиУправлениеТорговымиПредставителями");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиВедениеЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиПродажиИВозвраты");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоДенежныеСредства");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	// Отчеты, обработки.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиСупервайзераТорговыхПредставлителей");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиТорговогоПредставителя");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	// Обмен данными с мобильным приложением "Заказы"
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложения1СЗаказы");
	
	// Х.О. для кассовых ордеров, безналичных дс. и договоров контрагентов
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОплатаПоставщику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.РеализацияКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику");
	//Значения доступа по типам оснований актов о расхождениях
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.РеализацияТоваровУслуг");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПустаяСсылка");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтКлиента");
	//Значения доступа по видам соглашений с клиентами
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Перечисление.ВидыСоглашенийСКлиентамиДляОграниченияИзменения.Индивидуальные");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем осуществляется обмен данными с КПК, формируются
                                          |задания торговым представителям, регистрируются условия
                                          |обслуживания клиентов, анализируется работа торговых представителей,
                                          |а также осуществляется синхронизация данных с мобильным приложением ""Заказы"".'
                                          |;uk='Під профілем здійснюється обмін даними з КПК, формуються
                                          |завдання торговим представникам, реєструються умови
                                          |обслуговування клієнтів, аналізується робота торгових представників,
                                          |а також здійснюється синхронізація даних з мобільним додатком ""Замовлення"".'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ТорговыйПредставитель
	// Профиль "Торговый представитель".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ТорговыйПредставитель";
	ОписаниеПрофиля.Идентификатор = "3afd420c-f9e9-4a88-975e-2e31547ee74c";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Торговый представитель';uk='Торговий представник'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаДаннымиСКПК");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	
	// Добавление
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданийТорговымПредставителям");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовКлиентов");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен","ВначалеВсеРазрешены");
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиУправлениеТорговымиПредставителями");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиВедениеЗаказовКлиентов");
	// Отчеты, обработки.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиТорговогоПредставителя");
	// Обмен данными с мобильным приложением "Заказы"
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложения1СЗаказы");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем осуществляется доступ в ИБ торгового представителя,
                                          |осуществляется обмен данными с мобильными устройствами,
                                          |а также осуществляется синхронизация данных с мобильным приложением ""Заказы"".'
                                          |;uk='Під профілем здійснюється доступ в ІБ торгового представника,
                                          |здійснюється обмін даними з мобільними пристроями,
                                          |а також здійснюється синхронізація даних з мобільним додатком ""Замовлення"".'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_Маркетолог
	// Профиль "Маркетолог".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Маркетолог";
	ОписаниеПрофиля.Идентификатор = "806daef6-c289-49e0-9652-38dcf3fa7677";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Маркетолог';uk='Маркетолог'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоРассылкамИОповещениямКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
	
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПроектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСегментовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСегментовПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТиповыхСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилЦенообразования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркетинговыхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАссортиментаИЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекПродажДляПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовПодарочныхСертификатов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБонусныхПрограммЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовОповещенийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГруппРассылокИОповещений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодписокНаРассылкиИОповещенияКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокКлиентам");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизацийКОформлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПринятойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	// Регистры расширенной аналитики управленческого учета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	
	
	//Анкетирование
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОпросов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтветовНаВопросыАнкет");

	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеABCXYZКлассификацияКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеABCXYZКлассификацияНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛогистическихПараметров");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("УстановкаЦенНоменклатурыБезСогласования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокКлиентам");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыУПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	
	//Отчеты и обработки
	ОписаниеПрофиля.Роли.Добавить("ОтчетыМаркетолога");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	
	//Согласование цен.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованияЦенНоменклатуры");
	
	// Планы продаж
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПланаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПродаж");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента"); // Необходим для отчета "Исполнение плана продаж"
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСбалансированностьПланов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПланаПродажПоКатегориям");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПродажПоКатегориям");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНормативовРаспределения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативовРаспределения");
	
	// Сезонные коэффициенты
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСезонныхКоэффициентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСезонныхКоэффициентов");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Предустановленный");
	
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетинг");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингСегментация");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингКонкурентнаяРазведка");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингПравилаПродаж");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингЦенообразование");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингМаркетинговыеМероприятия");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингАссортимент");
	ОписаниеПрофиля.Роли.Добавить("РазделМаркетингПланирование");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингАнкетирование");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделСклад");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("РазделБюджетированиеИПланирование");
	
	//Значения доступа по видам соглашений с клиентами
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Перечисление.ВидыСоглашенийСКлиентамиДляОграниченияИзменения.Типовые");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под этим профилем осуществляется регистрация цен конкурентов,
                                          |проводится анализ и классификация клиентов и номенклатуры,
                                          |настраиваются правила продаж и происходит управление
                                          |маркетинговыми мероприятиями.'
                                          |;uk='Під цим профілем здійснюється реєстрація цін конкурентів,
                                          |проводиться аналіз і класифікація клієнтів та номенклатури,
                                          |настроюються правила продажів і відбувається управління
                                          |маркетинговими заходами.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_РуководительОтделаПродаж
	// ДЕЛАЕТ ВСЕ СОГЛАШЕНИЯ.
	// Профиль "Руководитель отдела продаж".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "РуководительОтделаПродаж";
	ОписаниеПрофиля.Идентификатор = "ae883b07-11cf-4bea-9bce-46473350db16";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Руководитель отдела продаж';uk='Керівник відділу продажів'");
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБонусныхПрограммЛояльности");
	
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	
	//Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокНазначенияТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоПлатежнойКарте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийТорговымПредставителям");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийУслугПрочихАктивов"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюИзлишковНедостач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");

	//Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилВеденияСделок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПроектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТиповыхСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИндивидуальныхСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилОтработкиПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекПродажДляПользователей");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");

	//Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеОтгрузкиПоРеализации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПриемкиПоВозвратуОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("СозданиеРеализацииТоваровУслугБезЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокНазначенияТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокНазначенияТоваровРасширенный");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСверокВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("СозданиеАктовВыполненныхРаботБезЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПланаПродаж");
	ОписаниеПрофиля.Роли.Добавить("РеализацияСверхЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовКорректировкиЗадолженностиЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	
	//Согласование продажи.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиУчастниковСогласованияУсловийПродаж");
	ОписаниеПрофиля.Роли.Добавить("ОтклонениеОтУсловийПродаж");
	
	//Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствУПодотчетныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	
	
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингПроведениеСделок");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиУправлениеТорговымиПредставителями");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиВедениеЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиПродажиИВозвраты");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиКонтрольРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиКомиссионнаяТорговля");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиРозничныеПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиАналитическаяОтчетность");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетинг");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингПравилаПродаж");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингЦенообразование");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингМаркетинговыеМероприятия");
	ОписаниеПрофиля.Роли.Добавить("РазделМаркетингПланирование");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделСклад");
	// Отчеты
	
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРуководителяОтделаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	
	// Планы продаж
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПланаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПродаж");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСбалансированностьПланов");
	// Дополнительные права
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	// Виды доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Предустановленный");
	// Х.О. для кассовых ордеров, заявок, безналичных дс. и договоров контрагентов
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.РеализацияКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию");
	//Значения доступа по типам оснований актов о расхождениях
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.РеализацияТоваровУслуг");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПустаяСсылка");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтКлиента");
	//Значения доступа по видам соглашений с клиентами
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Перечисление.ВидыСоглашенийСКлиентамиДляОграниченияИзменения.Типовые");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Перечисление.ВидыСоглашенийСКлиентамиДляОграниченияИзменения.Индивидуальные");
	//Значения доступа по видам операций взаимозачета задолженности
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.Клиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.Поставщика");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем настраиваются правила ведения сделок на
                                          |предприятии, анализируется эффективность сделок.'
                                          |;uk='Під профілем настроюються правила ведення угод на
                                          |підприємстві, що аналізується ефективність угод.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_МенеджерПоПродажам
	// Профиль "Менеджер по продажам".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоПродажам";
	ОписаниеПрофиля.Идентификатор = "44d4fd93-99ca-40e7-be0a-3b0321a39d3b";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Менеджер по продажам';uk='Менеджер з продажів'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоПлатежнойКарте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийТорговымПредставителям");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийУслугПрочихАктивов"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихДокументовНДС");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПроектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеОтгрузкиПоРеализации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПриемкиПоВозвратуОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("СозданиеРеализацииТоваровУслугБезЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИндивидуальныхСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСверокВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("СозданиеАктовВыполненныхРаботБезЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("РеализацияСверхЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовКорректировкиЗадолженностиЗачетОплаты");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПланаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПродаж");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыданныхДоверенностей");
	
	//Согласование продажи.
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиУчастниковСогласованияУсловийПродаж");
	// Отчеты
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРазделаСклад");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыМенеджераПоПродажам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПомощникаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ОтклонениеОтУсловийПродаж");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастройкиПечатиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеНастроекПечатиОбъектовПоУмолчанию");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	// Виды доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Предустановленный");
	// Х.О. для кассовых ордеров и договоров с контрагентами
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.РеализацияКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОплатаПоставщику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика");
	// Значения доступа по типам оснований актов о расхождениях
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.РеализацияТоваровУслуг");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПустаяСсылка");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтКлиента");
	//Значения доступа по видам соглашений с клиентами
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("СоглашенияСКлиентамиИзменение", "Перечисление.ВидыСоглашенийСКлиентамиДляОграниченияИзменения.Индивидуальные");
	//Значения доступа по видам операций взаимозачета задолженности
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.Клиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.Поставщика");
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетинг");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетингПроведениеСделок");
	ОписаниеПрофиля.Роли.Добавить("РазделМаркетингПланирование");
	// Обмен данными с мобильным приложением "Заказы"
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложения1СЗаказы");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем осуществляется управление сделками, реализация
                                          |товаров и услуг, возвраты товара, контролируются комиссионеры,
                                          |а также осуществляется синхронизация данных с мобильным приложением ""Заказы"".'
                                          |;uk='Під профілем здійснюється управління угодами, реалізація
                                          |товарів і послуг, повернення товару, контролюються комісіонери,
                                          |а також здійснюється синхронізація даних з мобільним додатком ""Замовлення"".'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ПродавецКассирККМ
	// Профиль "Продавец-кассир ККМ".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ПродавецКассирККМ";
	ОписаниеПрофиля.Идентификатор = "b93bb8a1-04fa-4c1a-ac3c-75fb05366782";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Продавец-кассир ККМ';uk='Продавець-касир ККМ'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБонусныхПрограммЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиРозничныеПродажи");
	// Документы, создание.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовойСмены");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийВозвратовПодарочныхСертификатов");
	//Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	
	// Отчеты и обработки
	
	ОписаниеПрофиля.Роли.Добавить("ОтчетыКассираККМ");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ЭквайринговыеТерминалы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "Предустановленный");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВКассуККМ");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
    
    // Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем происходит работа с ККМ в течение дня и закрытие
                                          |кассовой смены.'
                                          |;uk='Під профілем відбувається робота з ККМ протягом дня і закриття
                                          |касової зміни.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_МенеджерПоРозничнойТорговле
	// Профиль "Менеджер по розничной торговле".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоРозничнойТорговле";
	ОписаниеПрофиля.Идентификатор = "4c72e308-ff96-40b3-b066-f2dfda73d323";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Менеджер по розничной торговле';uk='Менеджер з роздрібної торгівлі'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;

	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБонусныхПрограммЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаВозвратТоваровОтКлиента");
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиРозничныеПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиПродажиИВозвраты");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	// Документы, создание.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАннулированияПодарочныхСертификатов");
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРазделаСклад");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиМенеджераПоРозничнойТорговле");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыКассираККМ");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	
	
	// Виды доступа.
    ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КассыККМ", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ЭквайринговыеТерминалы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "Предустановленный");
	// Значения доступа.
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВКассуККМ");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.РеализацияКлиенту");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем осуществляется регистрация продаж через ККМ,
                                          |печатаются ценники и этикетки, формируется отчетность розничной торговли.'
                                          |;uk='Під профілем здійснюється реєстрація продажів через ККМ,
                                          |друкуються цінники й етикетки, формується звітність роздрібної торгівлі.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_Кассир
	// Профиль "Кассир".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Кассир";
	ОписаниеПрофиля.Идентификатор = "1167e360-4f81-4114-968e-c4264a06baa0";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Кассир';uk='Касир'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассРасширенная");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКредитовИДепозитов");
	
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОжидаемыхПоступленийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаПеремещениеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыУПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокПоступлений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетыПоДоговорамКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыданныхДоверенностей");
	
	// Документы, создание.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОперацийПоПлатежнымКартам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПоКассе");
	
	// Регистры чтение
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	
	// Регистры расширенной аналитики денежных средств
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствУПодотчетныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныхСредств");
	
	
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоЭквайринг");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоДенежныеСредства");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоПланированиеИКонтрольДенежныхСредств");
	// Отчеты
	ОписаниеПрофиля.Роли.Добавить("ОтчетыКассира");
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Кассы", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ЭквайринговыеТерминалы", "ВначалеВсеРазрешены");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем происходит оформление кассовых операций.';uk='Під профілем відбувається оформлення касових операцій.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_Бухгалтер
	// Профиль "Бухгалтер".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Бухгалтер";
	ОписаниеПрофиля.Идентификатор = "84acd69c-4114-4d0a-82b2-226033948e12";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Бухгалтер';uk='Бухгалтер'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ДобавитьРолиБухгалтераРеглУчета(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКатегорийЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийИзЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРегламентныхОпераций");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРегистрацийНаработокТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем происходит формирование отчетности розничной
                                          |торговли, отражается инвентаризация товаров, рассчитывается
                                          |себестоимость, распределяется прибыль по направлениям
                                          |деятельности, оформляются внутрифирменные продажи.'
                                          |;uk='Під профілем відбувається формування звітності роздрібної
                                          |торгівлі, відбивається інвентаризація товарів, розраховується
                                          |собівартість, розподіляється прибуток за напрямами
                                          |діяльності, оформляються внутрішньофірмові продажі.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_Казначей
	// Профиль "Казначей".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Казначей";
	ОписаниеПрофиля.Идентификатор = "9f46c8c7-1a0c-4ecb-aea8-0be64724b259";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Казначей';uk='Казначей'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Нормативно-справочная информация
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадрыРасширенная");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	// Отчеты и обработки
	
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиКазначея");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеАнализСтатейКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРеестрКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПланФактныйАнализКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПоДвижениюДенежныхСредств");
	// Документы чтение
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеОтгрузки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоПлатежнойКарте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовБанкаПоОперациямЭквайринга");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОжидаемыхПоступленийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаПеремещениеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПересчетовТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаОтражениеИзлишковНедостачПорчи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыУПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокПоступлений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовойКниги");
	
	// Добавление справочники.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДДС");
	// Добавление документы.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПоБанку");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОжидаемыхПоступленийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспоряженийНаПеремещениеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("СогласованиеЗаявокНаРасходованиеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("СогласованиеРаспоряженийНаПеремещениеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеЗаявокНаРасходованиеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеРаспоряженийНаПеремещениеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНачисленияКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛимитовРасходаДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ЗаписьВыданнойДоверенностиВОкончательномСтатусе");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовРасхожденийПриИнкассацииДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийНаличныхДенежныхСредств");

	// Регистры
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетыПоДоговорамКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛимитовРасходаДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	
	// Регистры расширенной аналитики денежных средств
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковБезналичныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствУПодотчетныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныхСредств");
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "ВначалеВсеРазрешены");
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоЭквайринг");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоДенежныеСредства");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоНастройкаАналитики");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоПланированиеИКонтрольДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоКорректировкаЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоКредитыИДепозиты");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем происходит управление платежным календарем,
                                          |ведутся операций по банку, осуществляются расчеты с подотчетными лицами.'
                                          |;uk='Під профілем відбувається управління платіжним календарем,
                                          |ведуться операцій по банку, здійснюються розрахунки з підзвітними особами.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_МенеджерПоОбеспечениюПотребностей
	// Профиль "Менеджер по обеспечению потребностей".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоОбеспечениюПотребностей";
	ОписаниеПрофиля.Идентификатор = "e5d97caa-7019-44d2-b36e-7b71f6133219";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Менеджер по обеспечению потребностей';uk='Менеджер з забезпечення потреб'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Нормативно-справочная информация
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
	
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеНастроекОбеспеченияПоСкладу");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТМЦВЭксплуатации");
	// Соглашения
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	// Цены
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	// Расчеты с клиентами и поставщиками
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	// Заказы поставщикам
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПоставщикам");
	// Заказы клиентов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаВозвратТоваровОтКлиента");
	// Внутренние заказы
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокНазначенияТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокНазначенияТоваров");
	// Склад и доставка
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннегоТовародвижения");
	
	
	
	// Планирование
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсточниковДанныхПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсточниковДанныхПланирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСбалансированностьПланов");
	// Планы продаж
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПланаПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПродаж");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаПродаж");
	// Планы закупок
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	// Планы сборки (разборки)
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановСборкиРазборки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановСборкиРазборки");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаСборкиРазборки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	
	// Корректировки обособленного учета товаров
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	// Отчеты и обработки
	
	ОписаниеПрофиля.Роли.Добавить("ОтчетыМенеджераПоОбеспечениюПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбеспечениеПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПараметрыОбеспеченияПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	
	// Регистры
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПринятойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделСклад");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетинг");
	ОписаниеПрофиля.Роли.Добавить("РазделМаркетингПланирование");
	ОписаниеПрофиля.Роли.Добавить("РазделБюджетированиеИПланирование");
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем происходит определение правил управления и
                                          |пополнения запасов, обрабатываются внутренние заказы.'
                                          |;uk='Під профілем відбувається визначення правил управління і
                                          |поповнення запасів, обробляються внутрішні замовлення.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ФинансовыйАналитик
	// Профиль "Финансовый аналитик".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ФинансовыйАналитик";
	ОписаниеПрофиля.Идентификатор = "485d23db-673c-446b-adab-8fd27de6e0e5";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Финансовый аналитик';uk='Фінансовий аналітик'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Прикладные роли
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеАнализСтатейКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРеестрКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПланФактныйАнализКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадрыРасширенная");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКредитовИДепозитов");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФинансовыхРезультатов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковБезналичныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетыПоДоговорамКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствУПодотчетныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПринятойВозвратнойТары");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	// Регистры расширенной аналитики управленческого учета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	
	// Регистры расширенной аналитики денежных средств
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковБезналичныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствУПодотчетныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныхСредств");
	
	// Документы, чтение
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихДокументовНДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихДокументовНДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламентныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоПлатежнойКарте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовБанкаПоОперациямЭквайринга");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОжидаемыхПоступленийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаПеремещениеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийУслугПрочихАктивов"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыУПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокПоступлений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	// Отчеты 
	ОписаниеПрофиля.Роли.Добавить("ОтчетыФинансовогоАналитика");
	
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделФинансовыйРезультатИКонтроллинг");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоПланированиеИКонтрольДенежныхСредств");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем формируется финансовая отчетность и выполняется финансовый анализ.';uk='Під профілем формується фінансова звітність і виконується фінансовий аналіз.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_Кладовщик
	// Профиль "Кладовщик".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Кладовщик";
	ОписаниеПрофиля.Идентификатор = "28f1fe22-299d-4135-ac9f-fe338ce51571";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Кладовщик';uk='Комірник'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
	
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	// Документы, чтение
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокПоступлений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБлокировокСкладскихЯчеек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");            
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюИзлишковНедостач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТМЦВЭксплуатации");
	
	
	// Настройка.
	ОписаниеПрофиля.Роли.Добавить("НастройкаТопологииСкладов");                 
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");                 
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторыСкладскогоУчетаНоменклатуры");                 
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");                 
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУстановкиБлокировокЯчеек");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтборовРазмещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОрдеровНаПеремещениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПересчетовТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОрдеровНаОтражениеИзлишковНедостачПорчи");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтраженийРезультатовПроверкиОрдераНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");

	// Документы, проведение.
	ОписаниеПрофиля.Роли.Добавить("ПроведениеПриходногоОрдераВОкончательномСтатусе");
	ОписаниеПрофиля.Роли.Добавить("ВзятиеРасходногоОрдераВРаботу");
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	// Отчеты и обработки.
	
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиКладовщика");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроверкиКоличестваТоваровВДокументе");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
		
	//КИ
	ОписаниеПрофиля.Роли.Добавить("РазделСклад");
	ОписаниеПрофиля.Роли.Добавить("РазделОрганайзер");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем происходит настройка топологии склада, выполнение
                                                                              |распоряжений о приеме, выдаче и сборке товаров. Осуществляется
                                                                              |регистрация информации о выполнении распоряжений, отражаются
                                                                              |излишки и недостачи товара. Так же профиль позволяет редактировать
                                                                              |складскую информацию по номенклатуре.'
                                                                              |;uk='Під профілем відбувається настройка топології складу, виконання
                                                                              |розпоряджень про приймання, видачу та збирання товарів. Здійснюється
                                                                              |реєстрація інформації про виконання розпоряджень, відображаються
                                                                              |надлишки і нестачі товару. Так само профіль дозволяє редагувати
                                                                              |складську інформацію по номенклатурі.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_МенеджерПоЗакупкам
	// Профиль "Менеджер по закупкам".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоЗакупкам";
	ОписаниеПрофиля.Идентификатор = "12bb4321-60bb-4bbd-a1fc-4c84fb3c1133";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Менеджер по закупкам';uk='Менеджер з купівель'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНомеровГТД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАссортиментаИЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	
	//Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийУслугПрочихАктивов"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламентныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихДокументовНДС");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСверокВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокПоступлений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТаможенныхДекларацийИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповВозвратнойТарыУПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОрдеровНаТовары");	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеОтгрузкиПоВозврату");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПриемкиПоПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовКорректировкиЗадолженностиЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизацийКОформлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПринятойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	// Регистры расширенной аналитики управленческого учета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	
	
	//Согласование закупки
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиУчастниковСогласованияУсловийЗакупки");
	
	// Планирование закупок
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсточниковДанныхПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСбалансированностьПланов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	
	// Регистры расширенной аналитики управленческого учета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРазделаСклад");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиМенеджераПоЗакупкам");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбеспечениеПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПараметрыОбеспеченияПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ОтклонениеОтУсловийЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("РазделКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("РазделCRMИМаркетинг");
	ОписаниеПрофиля.Роли.Добавить("РазделМаркетингПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации","Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Предустановленный");
	// Х.О. для кассовых ордеров, безналичных дс.
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ОплатаПоставщику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПеречислениеТаможне");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПриемНаКомиссию");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпорту");
	
	//Значения доступа по типам оснований актов о расхождениях
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратПоставщику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПоступлениеТоваровУслуг");
	
	//Значения доступа по видам операций взаимозачета задолженности
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.Клиента");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", "Перечисление.ВидыОперацийВзаимозачетаЗадолженности.Поставщика");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем происходит заключение соглашений с поставщиками,
                                          |управление заказами, регистрируются закупки и возвраты,
                                          |контролируются расчеты с поставщиками.'
                                          |;uk='Під профілем відбувається реєстрація оферт постачальників,
                                          |управління замовленнями, реєструються купівлі і повернення,
                                          |контролюються розрахунки з постачальниками.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_УчастникСогласованияУсловийЗакупок
	// Описание для заполнения профиля "Согласования условий закупок".
	// Профиль предназначен для обеспечения доступа к объектам согласания и отчетам.
	// Профиль "Участник согласования условий закупок (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникСогласованияУсловийЗакупок";
	ОписаниеПрофиля.Идентификатор = "19037231-7da0-406f-a223-28687ce22545";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Участник согласования условий закупок (дополнительный)';uk='Учасник погодження умов купівель (додатковий)'");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиУчастниковСогласованияУсловийЗакупки");
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены"); // Для заказов.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены"); // Для заказов.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены"); // Для заказов.
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем происходит согласование заказов поставщикам.';uk='Під профілем відбувається погодження замовлень постачальникам.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_Клиент
	// Описание для заполнения профиля "Клиент"
	// Профиль предназначен для обеспечения доступа клиента-внешнего пользователя к объектам подсистемы "Самообслуживание клиентов"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Клиент";
	ОписаниеПрофиля.Идентификатор = "8ed11273-0914-4acb-8359-f95ff3e43bc6";
	ОписаниеПрофиля.Назначение = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Метаданные.ОпределяемыеТипы.ВнешнийПользователь.Тип);
	ОписаниеПрофиля.Наименование  = НСтр("ru='Клиент, имеющий доступ к подсистеме самообслуживания';uk='Клієнт, що має доступ до підсистеми самообслуговування'");
	
	// Использование платформы.
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ПечатьДокументовОтгрузки");
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВнешнегоПользователя"); 
	
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВнешнегоПользователяУТ");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательБазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательЧтениеНСИ");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательОформлениеПлановПродаж");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательРедактированиеПодписокНаРассылкиИОповещения");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательИзменениеКонтактнойИнформацииКлиента");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательОформлениеПретензий");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательПросмотрДокументовУсловийПродажи");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательОформлениеАктовПриемки");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательОформлениеЗаказов");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательОформлениеЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательОформлениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательПросмотрОтчетаСостояниеРасчетов");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательИзменениеБанковскихСчетов");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательЧтениеДанныхПоРасчетам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	//Просмотр реальных остатков
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательПросмотрСостоянияОбеспеченияЗаказа");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательПросмотрОтчетаСостояниеДоступностиТоваров");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВнешниеПользователи", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады",              "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен",             "ВначалеВсеРазрешены");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль для доступа клиентов-покупателей к системе через веб-
                                          |интерфейс. Под профилем происходит самостоятельное оформление 
                                          |заказов клиентами, которые зарегистрированы в качестве внешних пользователей.'
                                          |;uk='Профіль для доступу клієнтів-покупців до системи через веб-
                                          |інтерфейс. Під профілем відбувається самостійне оформлення 
                                          |замовлень клієнтами, які зареєстровані в якості зовнішніх користувачів.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_Респондент

	// Описание для заполнения профиля "Респондент"
	// Профиль предназначен для обеспечения доступа респондента внешнего пользователя к заполнению предназначенных для него анкет.
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Респондент";
	ОписаниеПрофиля.Идентификатор = "c86c8305-df47-4bb0-a51d-af325c38670f";
	ОписаниеПрофиля.Назначение = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Метаданные.ОпределяемыеТипы.ВнешнийПользователь.Тип);
	ОписаниеПрофиля.Наименование  = НСтр("ru='Респондент, участвующий в опросах';uk='Респондент, який бере участь в опитуваннях'");
	
	// Использование платформы.
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВнешнегоПользователя");
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВнешнегоПользователяУТ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтветовНаВопросыАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтветовНаВопросыАнкет");
	ОписаниеПрофиля.Роли.Добавить("СамообслуживаниеВнешнийПользовательПереходКСпискуАнкет");
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВнешниеПользователи", "Предустановленный");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль для доступа респондентов опросов к системе через веб-
                                          |интерфейс. Под данным профилем респонденту доступен список, предназначенных 
                                          |ему опросов и возможность заполнить анкеты.'
                                          |;uk='Профіль для доступу респондентів опитувань до системи через веб-
                                          |інтерфейс. Під даним профілем респонденту доступний список призначених 
                                          |йому опитувань і можливість заповнити анкети.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_СогласованияУсловийПродаж
	// Профиль предназначен для обеспечения доступа к объектам согласания и отчетам.
	// Профиль "Участник согласования условий продаж (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникСогласованияУсловийПродаж";
	ОписаниеПрофиля.Идентификатор = "6c5ff2cf-6901-4412-a930-fa04bad5cf0b";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Участник согласования условий продаж (дополнительный)';uk='Учасник погодження умов продажів (додатковий)'");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованиеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиУчастниковСогласованияУсловийПродаж");
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКоммерческихПредложений");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены"); // Для заказов.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены"); // Для заказов.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены"); // Для заказов.
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем происходит заключение соглашений с клиентами,
                                          |формирование коммерческих предложений, регистрация и отработка
                                          |заказов клиентов и заявок на возврат.'
                                          |;uk='Під профілем відбувається складання оферт клієнтам,
                                          |формування комерційних пропозицій, реєстрація та відпрацювання
                                          |замовлень клієнтів і заявок на повернення.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_УчастникСогласованияЦенНоменклатуры
	
	// Профиль "Участник согласования цен номенклатуры (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникСогласованияЦенНоменклатуры";
	ОписаниеПрофиля.Идентификатор = "9838ae68-ebd3-4e82-b62c-d39c379a928b";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Участник согласования цен номенклатуры (дополнительный)';uk='Учасник погодження цін номенклатури (додатковий)'");
	
	// Чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласованияЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен","ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем происходит согласование цен номенклатуры
                                          |в момент их установки.'
                                          |;uk='Під профілем відбувається погодження цін номенклатури
                                          |в момент їх встановлення.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ОтветственныйЗаВедениеПартнеров
	// Профиль "Ответственный за ведение партнеров (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеПартнеров";
	ОписаниеПрофиля.Идентификатор = "932c3320-f64e-4f35-a8a0-47e9727c0b2c";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Ответственный за ведение партнеров (дополнительный)';uk='Відповідальний за ведення партнерів (додатковий)'");
	
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоРассылкамИОповещениямКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыОтветственногоЗаВедениеПартнеров");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Дополнительный профиль, назначается пользователям, ведущим
                                          |список партнеров, контрагентов, контактных лиц.'
                                          |;uk='Додатковий профіль, призначається користувачам, які ведуть
                                          |список партнерів, контрагентів, контактних осіб.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ОтветственныйЗаВедениеФизлиц
	// Профиль "Ответственный за ведение физлиц (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеФизлиц";
	ОписаниеПрофиля.Идентификатор = "6100e47d-25bf-4fe2-a7e5-9e357fd3bee9";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Ответственный за ведение физлиц (дополнительный)';uk='Відповідальний за ведення фізосіб (додатковий)'");
	
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	// Прикладные права.
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадрыРасширенная");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	КонецЕсли;
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекФизическихЛиц");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Дополнительный профиль, назначается пользователям, ведущим список физлиц.';uk='Додатковий профіль, призначається користувачам, які ведуть список фізосіб.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ОтветственныйЗаВедениеНоменклатуры
	
	// Профиль "Ответственный за ведение номенклатуры (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеНоменклатуры";
	ОписаниеПрофиля.Идентификатор = "101d8475-84ef-4d02-b6d1-b026baba0ccc";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Ответственный за ведение номенклатуры (дополнительный)';uk='Відповідальний за ведення номенклатури (додатковий)'");
	
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСертификатовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторыСкладскогоУчетаНоменклатуры");                 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГруппАналитическогоУчетаНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Дополнительный профиль, назначается пользователям, ведущим
                                          |справочник ""Номенклатура"".'
                                          |;uk='Додатковий профіль, призначається користувачам, які ведуть
                                          |довідник ""Номенклатура"".'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ОтветственныйЗаВедениеВзаимодействий
	// Профиль "Ответственный за ведение взаимодействий (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеВзаимодействий";
	ОписаниеПрофиля.Идентификатор = "6797cdb5-c0f0-4814-8b18-3a6ef417dd52";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Ответственный за ведение взаимодействий (дополнительный)';uk='Відповідальний за ведення взаємодій (додатковий)'");
	
	ОписаниеПрофиля.Роли.Добавить("РазделОрганайзер");
	
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновСообщений");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты","ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем осуществляется загрузка входящих и формирование
                                          |исходящих писем электронной почты, регистрация входящих и
                                          |исходящих звонков, планирование и обработка взаимодействий, 
                                          |планирование и регистрация встреч.'
                                          |;uk='Під профілем здійснюється завантаження вхідних і формування
                                          |вихідних листів електронної пошти, реєстрація вхідних і
                                          |вихідних дзвінків, планування і обробка взаємодій, 
                                          |планування та реєстрація зустрічей.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_УчастникРасчетовМеждуОрганизациями
	// Профиль "Участник расчетов между организациями (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникРасчетовМеждуОрганизациями";
	ОписаниеПрофиля.Идентификатор = "4e46851a-0ff9-47dd-bfad-0ee5abf864f2";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Участник расчетов между организациями (дополнительный)';uk='Учасник розрахунків між організаціями (додатковий)'");
	
	// Прикладные права.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Позволяет отдельно настраивать доступ к организациям
                                          |и банковским счетам организаций по виду доступа ""Организации"".'
                                          |;uk='Дозволяє окремо налаштовувати доступ до організацій
                                          |та банківських рахунків організацій за видом доступу ""Організації"".'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_УчастникКонтроляИАнализаПоказателей
	// Профиль "Участник управления по целям (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникУправленияПоЦелям";
	ОписаниеПрофиля.Идентификатор = "81868489-66a6-40bd-bf4d-243b38003e13";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Участник управления по целям (дополнительный)';uk='Учасник управління по цілям (додатковий)'");
	
	// Чтение.
	ОписаниеПрофиля.Роли.Добавить("РазделОтчетыИМониторингЦелевыеПоказатели");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем происходит контроль целевых показателей
                                          |с точки зрения выявления отклонений от целевых значений или диапазонов,
                                          |а также анализ причин выявленных отклонений.'
                                          |;uk='Під профілем відбувається контроль цільових показників
                                          |з точки зору виявлення відхилень від цільових значень або діапазонів,
                                          |а також аналіз причин виявлених відхилень.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_РаботникСклада
	// Профиль "Работник склада".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "РаботникСклада";
	ОписаниеПрофиля.Идентификатор = "d709cde6-925c-4497-997f-f3dd0870ffee";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Работник склада';uk='Працівник складу'");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБлокировокСкладскихЯчеек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюИзлишковНедостач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений"); 
	
	//Добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтборовРазмещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПересчетовТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУстановкиБлокировокЯчеек");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтраженийРезультатовПроверкиОрдераНаТовары");
	
	// Использование.
	ОписаниеПрофиля.Роли.Добавить("ПроведениеПриходногоОрдераВОкончательномСтатусе");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочегоМестаРаботникаСклада");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроверкиКоличестваТоваровВДокументе");
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУТ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрВалют");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	Если НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи","ВначалеВсеРазрешены");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
    
	// Отчеты.
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	
	// Документооборот
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнтеграцииС1СДокументооборотом");
			
	// Документооборот
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнтеграцииС1СДокументооборотом");
	
	// Печать
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	//Файлы и папки файлов
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем осуществляется работа мобильного рабочего 
                                          |места работника склада'
                                          |;uk='Під профілем здійснюється робота мобільного робочого 
                                          |місця працівника складу'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_МенеджерПоДоставке
	// Профиль "Менеджер по доставке".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоДоставке";
	ОписаниеПрофиля.Идентификатор = "d3e34937-0a73-4468-8105-8f9ab0e311ac";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Менеджер по доставке';uk='Менеджер з доставки'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("РазделСклад");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	
	//Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	
    
	// Отчеты.
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	
	//Добавление.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочегоМестаДоставки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗонДоставки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем осуществляется создание и редактирование зон доставки,
                                        |создание и редактирование транспортных средств, типов транспортных средств,
                                        |создание и обработка Заданий на перевозку,
                                        |работа в обработке Рабочее место менеджера по доставке'
                                        |;uk='Під профілем здійснюється створення і редагування зон доставки,
                                        |створення і редагування транспортних засобів, типів транспортних засобів,
                                        |створення та обробка Завдань на перевезення,
                                        |робота в обробці Робоче місце менеджера з доставки'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ОтветственныйЗаОбменЭД
	// Профиль "Ответственный за обмен электронными документами (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаОбменЭД";
	ОписаниеПрофиля.Идентификатор = "1c7bc32a-60eb-4395-ab8d-87fd6103a095";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Ответственный за обмен электронными документами (дополнительный)';uk='Відповідальний за обмін електронними документами (додатковий)'");

	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("НастройкаПараметровЭД");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Дополнительный профиль, назначается пользователям, осуществляющим настройку
                                          |соглашений по обмену электронными документами'
                                          |;uk='Додатковий профіль, призначається користувачам, що здійснюють настройку
                                          |оферт по обміну електронними документами'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

#Область Описание_профиля_ПользовательМобильногоПриложения1CмониторErp
	// Профиль "Пользователь мобильного приложения "Монитор ERP" (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ПользовательМобильногоПриложения1СМониторERP";
	ОписаниеПрофиля.Идентификатор = "bd90021b-f46c-11e2-ad7c-c86000df10d3";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Пользователь мобильного приложения ""Монитор ERP"" (дополнительный)';uk='Користувач мобільної прикладної програми ""Монітор ERP"" (додатковий)'");
	
	// Чтение.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложенияМониторERP");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Данный профиль дает возможность 
                                          |пользователю мобильного приложения ""Монитор ERP""
                                          |получать данные из информационной базы.'
                                          |;uk='Даний профіль дає можливість 
                                          |користувачеві мобільної прикладної програми ""Монітор ERP""
                                          |отримувати дані з інформаційної бази.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_ИнициаторЗаявокНаРасходованиеДенежныхСредств

	// Профиль "Инициатор заявок на расходование денежных средств".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ИнициаторЗаявокНаРасходованиеДенежныхСредств";
	ОписаниеПрофиля.Идентификатор = "66db1fed-b624-44eb-b74e-4884f543838d";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Инициатор заявок на расходование денежных средств';uk='Ініціатор заявок на витрачання грошових коштів'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("РазделКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначействоПланированиеИКонтрольДенежныхСредств");	
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	
	Если ДоступныРолиФизическихЛицБЗКР Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадрыРасширенная");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;
	
	//Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	
	//Добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаРасходДС");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛимитовРасходаДенежныхСредств");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем вводятся и отслеживаются заявки на расходование денежных средств';uk='Під профілем вводяться і відстежуються заявки на витрачання грошових коштів'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти

КонецПроцедуры

#КонецОбласти

#Область ДоступКРеквизитамОбъектовМетаданных

// Проверяет допустимость изменения реквизитов существующего элемента справочника перед записью.
//
// Параметры:
//		Объект - СправочникОбъект - объект любого справочника
//		НепроверяемыеРеквизиты - Строка - перечень реквизитов, изменение которых не надо контролировать
//		Отказ - Булево - признак отказа от записи
//
Функция ПроверитьДопустимостьИзмененияРеквизитовСправочника(Объект, НепроверяемыеРеквизиты = "", Отказ) Экспорт
	
	Если Объект.ЭтоНовый() Тогда
		Возврат Истина; // для новых элементов нет необходимости проверять
	КонецЕсли;
	
	ЭтоГруппа = (Объект.Метаданные().Иерархический И Объект.ЭтоГруппа);
	НедоступныеРеквизиты = ЗначениеНастроекПовтИсп.НедоступныеДляРедактированияРеквизитыСправочника(Объект.Метаданные().Имя, ЭтоГруппа, НепроверяемыеРеквизиты);
	
	Если ПустаяСтрока(НедоступныеРеквизиты) Тогда
		Возврат Истина; // нет недоступных для редактирования реквизитов
	КонецЕсли;
	
	ОшибочноИзмененныеРеквизиты = "";
	
	РеквизитыОбъекта = Новый Структура(НедоступныеРеквизиты);
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, Объект);
	
	РеквизитыСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, НедоступныеРеквизиты);
	
	Для Каждого КлючИЗначение Из РеквизитыОбъекта Цикл
		Если КлючИЗначение.Значение <> РеквизитыСсылки[КлючИЗначение.Ключ] Тогда
			ОшибочноИзмененныеРеквизиты =
				ОшибочноИзмененныеРеквизиты + ?(ПустаяСтрока(ОшибочноИзмененныеРеквизиты), "", ", ") + """" + КлючИЗначение.Ключ + """";
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ОшибочноИзмененныеРеквизиты) Тогда
		Возврат Истина; // на все измененные реквизиты есть права
	КонецЕсли;
	
	СообщениеОбОшибке = НСтр("ru='Недостаточно прав на изменение реквизит%1 %2';uk='Недостатньо прав для зміни реквізит%1 %2'");
	СообщениеОбОшибке =
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			СообщениеОбОшибке,
			?(Найти(ОшибочноИзмененныеРеквизиты, ",") > 0, "ов:", "а"),
			ОшибочноИзмененныеРеквизиты);
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,,, Отказ);
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Служебная фунция. Сделана экспортной для удобства внедрения.
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт

	// Запуск платформы
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	Если НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	// Базовые права
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУТ");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБП");
	
	// Задачи и задания
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи","ВначалеВсеРазрешены");
	
	// Заметки и напоминания
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеНапоминаний");
	
	// Документооборот
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнтеграцииС1СДокументооборотом");
	
	// Электронная подпись
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭлектроннойПодписиИШифрования");
	
	//Файлы и папки файлов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСПапкамиФайлов");
	
	//Подсистема органайзер
	ОписаниеПрофиля.Роли.Добавить("РазделОрганайзер");
	
	// Дополнительные сведения
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	
	// Редактирование реквизитов объектов
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	
	// Использование дополнительных отчетов и обработок
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеДополнительныхОтчетовИОбработокУТ");
	
	// Варианты отчетов
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВариантовОтчетов");
	
	// Подключаемое оборудование
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
	
	// Текущие дела
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеТекущихДел");
	
	// Базовая НСИ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
    ОписаниеПрофиля.Роли.Добавить("ПросмотрВалют");
	
	// Новости
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	
	ОписаниеПрофиля.Роли.Добавить("НСИСБазовыеПрава");
	
КонецПроцедуры

// Служебная фунция. Сделана экспортной для исключения дублирования.
//
Процедура ДобавитьРолиБухгалтераРеглУчета(ОписаниеПрофиля) Экспорт
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПретензийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартЛояльности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	
	// Чтение физических лиц
	Если ДоступныРолиФизическихЛицБЗКР() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадрыРасширенная");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКадровогоСостоянияРасширенная");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	КонецЕсли;
	
	// Чтение регистров.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровНДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФинансовыхРезультатов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюИзлишковНедостач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетыПоДоговорамКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПринятойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровИОтчетовПоЕдиномуНалогу");

	// Регистры расширенной аналитики себестоимости товаров
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	
	// Регистры расширенной аналитики денежных средств
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковБезналичныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствУПодотчетныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныеСредстваКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийДенежныхСредств");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннегоТовародвижения");
	
	// Документы
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеОтгрузки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийСПодарочнымиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоПлатежнойКарте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовБанкаПоОперациямЭквайринга");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОжидаемыхПоступленийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаПеремещениеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПересчетовТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаОтражениеИзлишковНедостачПорчи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыУПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихДокументовНДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихДокументовНДС");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовРасхожденийПриИнкассацииДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовИнвентаризацииНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСверокВзаиморасчетов");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиБухгалтера");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеАнализСтатейКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРеестрКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПланФактныйАнализКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПоДвижениюДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроблемыПроверкиКонтрагентов");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛистовКассовойКниги");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРегламентныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокПоступлений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокРеализаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНачисленияКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАннулированияПодарочныхСертификатов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовРасхожденийПриИнкассацииДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСборокТоваров");
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГруппФинансовогоУчета");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГруппАналитическогоУчетаНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеФинансовойГруппыНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНомеровГТД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекУчетаНДС");
	
	// Регистры сведений, добавление.
	
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	
	// Обмен данными
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУзловПлановОбмена");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУзловПлановОбмена");
	
	// Подсистемы глобального командного интерфейса
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделСклад");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделКазначейство");
	ОписаниеПрофиля.Роли.Добавить("РазделФинансовыйРезультатИКонтроллинг");
	ОписаниеПрофиля.Роли.Добавить("РазделРегламентированныйУчет");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	
	
КонецПроцедуры

Функция ДоступныРолиФизическихЛицБЗКР()
	
	Возврат Метаданные.Роли.Найти("ЧтениеДанныхФизическихЛицЗарплатаКадры") <> Неопределено;
	
КонецФункции

#КонецОбласти
