
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Документ = Параметры.Документ;
	КомиссионноеВознаграждение = Параметры.КомиссионноеВознаграждение;
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		ТекстИсключения = НСтр("ru='Не предусмотрено непосредственное открытие формы обработки.';uk='Не передбачене безпосереднє відкриття форми обробки.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ИспользоватьПартнеровКакКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов");
	ИспользоватьНесколькоОрганизаций = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	
	ПолучитьРеквизитыРасчетовСПартнером();
	ЗаполнитьТаблицуПоРасчетамСПартнерами();
	УправлениеЭлементамиФормы();
	
	Если Не ПраваПользователяПовтИсп.ЗачетОплаты() Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	УстановитьОтборПоДоговорам();
	
	СформироватьИнформационнуюНадписьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ПринудительноЗакрытьФорму Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("ДанныеИзменены", Истина);
	МассивТаблиц = Новый Массив;
	МассивТаблиц.Добавить("Авансы");
	МассивТаблиц.Добавить("Оплаты");
	МассивТаблиц.Добавить("Зачтено");
	
	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		
		МассивСтрок = ЭтаФорма[ИмяТаблицы].НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество() > 0 Тогда
		
			Отказ = Истина;
			ПоказатьВопрос(
				Новый ОписаниеОповещения("ПередЗакрытиемВопросЗавершение", ЭтотОбъект),
				НСтр("ru='Данные зачета оплаты были изменены. Сохранить изменения?';uk='Дані заліку оплати були змінені. Зберегти зміни?'"),
				РежимДиалогаВопрос.ДаНетОтмена);
				
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемВопросЗавершение(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		СохранитьРезультатЗачетаОплатыИЗакрыть();
	ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
		РазблокироватьДокументыДляРедактирования();
		ПринудительноЗакрытьФорму = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоВсемДоговорамПриИзменении(Элемент)
	
	УстановитьОтборПоДоговорам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ОплатыДокумент" Тогда
		
		СтрокаТаблицы = Элементы.Оплаты.ТекущиеДанные;
		Если СтрокаТаблицы <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицы.Документ) Тогда
			ПоказатьЗначение(Неопределено, СтрокаТаблицы.Документ);
		КонецЕсли;
		
	Иначе
		СтрокаТаблицы = Элементы.Оплаты.ТекущаяСтрока;
		МассивСтрок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаТаблицы);
		ЗачестьПлатежДляВыбранныхСтрок(МассивСтрок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвансыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "АвансыЗаказ" Тогда
		
		СтрокаТаблицы = Элементы.Авансы.ТекущиеДанные;
		Если СтрокаТаблицы <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицы.Заказ) Тогда
			ПоказатьЗначение(Неопределено, СтрокаТаблицы.Заказ);
		КонецЕсли;
		
	Иначе
		СтрокаТаблицы = Элементы.Авансы.ТекущаяСтрока;
		МассивСтрок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаТаблицы);
		ЗачестьАвансДляВыбранныхСтрок(МассивСтрок);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗачтено

&НаКлиенте
Процедура ЗачтеноВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.Зачтено.ТекущиеДанные;
	
	Если СтрокаТаблицы <> Неопределено Тогда
	
		Если Поле.Имя = "ЗачтеноДокумент" И ЗначениеЗаполнено(СтрокаТаблицы.Документ) Тогда
			ПоказатьЗначение(Неопределено, СтрокаТаблицы.Документ);
		КонецЕсли;
		
		Если Поле.Имя = "ЗачтеноЗаказ" И ЗначениеЗаполнено(СтрокаТаблицы.Заказ) Тогда
			ПоказатьЗначение(Неопределено, СтрокаТаблицы.Заказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачтеноПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Зачтено.ТекущиеДанные;
	СуммаПередРедактированием = ТекущиеДанные.СуммаЗачтено;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачтеноПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущиеДанные = Элементы.Зачтено.ТекущиеДанные;
	Если ТекущиеДанные.СуммаЗачтено <> СуммаПередРедактированием Тогда
		
		ОчиститьСообщения();
		
		Отказ = Ложь;
		
		ИзменениеСуммы = СуммаПередРедактированием - ТекущиеДанные.СуммаЗачтено;
		
		Если ИзменениеСуммы < 0 Тогда
			ТекущиеДанные.СуммаЗачтено = СуммаПередРедактированием;
			ТекстПредупреждения = НСтр("ru='Зачтенная сумма может быть только уменьшена';uk='Зарахована сума може бути тільки зменшена'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
			Возврат;
		КонецЕсли;
		
		СтрокаТаблицы = Элементы.Зачтено.ТекущаяСтрока;
		СоответствиеСписания = Новый Соответствие;
		СоответствиеСписания.Вставить(СтрокаТаблицы, ИзменениеСуммы);
		ОтменитьЗачетНаСервере(СоответствиеСписания, , Отказ);
		
		Если Отказ Тогда
			ТекущиеДанные.СуммаЗачтено = СуммаПередРедактированием;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачестьПлатеж(Команда)
	
	МассивСтрок = Элементы.Оплаты.ВыделенныеСтроки;
	Если МассивСтрок.Количество() > 0 Тогда
		ЗачестьПлатежДляВыбранныхСтрок(МассивСтрок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачестьАванс(Команда)
	
	МассивСтрок = Элементы.Авансы.ВыделенныеСтроки;
	Если МассивСтрок.Количество() > 0 Тогда
		ЗачестьАвансДляВыбранныхСтрок(МассивСтрок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗачет(Команда)
	
	МассивСтрок = Элементы.Зачтено.ВыделенныеСтроки;
	Если МассивСтрок.Количество() > 0 Тогда
	
		ОчиститьСообщения();
		
		СоответствиеСписания = Новый Соответствие;
		Для Каждого Строка Из МассивСтрок Цикл
			СоответствиеСписания.Вставить(Строка, 0);
		КонецЦикла;
		
		ОтменитьЗачетНаСервере(СоответствиеСписания, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьПревышение(Команда)
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	ИсправитьПревышениеНаСервере(Отказ);
	
	Если Не Отказ И Превышение > 0 Тогда
		ТекстПредупреждения = НСтр("ru='Не удалось полностью исправить превышение. Возможно документы не доступны для редактирования.';uk='Не вдалося повністю виправити перевищення. Можливо документи не доступні для редагування.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачестьОплатуИЗакрыть(Команда)
	
	СохранитьРезультатЗачетаОплатыИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Показать(Команда)
	
	Элементы.ГруппаУправлениеПодвалом.ТекущаяСтраница = Элементы.СтраницаСкрытьПодвал;
	Элементы.ГруппаЗачтено.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Скрыть(Команда)
	
	Элементы.ГруппаУправлениеПодвалом.ТекущаяСтраница = Элементы.СтраницаПоказатьПодвал;
	Элементы.ГруппаЗачтено.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗачтеноСуммаЗачтено.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Зачтено.ДоступноРедактирование");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Оплаты.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Оплаты.ДоступноРедактирование");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Зачтено.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Зачтено.ДоступноРедактирование");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОплатыПартнер.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Оплаты.Партнер");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Партнер");

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтличающейсяСтрокиДокумента);

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.АвансыПартнер.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Авансы.Партнер");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Партнер");

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтличающейсяСтрокиДокумента);

	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.АвансыЗаказ.Имя);

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Авансы.Заказ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ОбъектРасчетов");
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Авансы.Заказ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Договор");

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтличающейсяСтрокиДокумента);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗачтеноДокумент.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Зачтено.Документ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<Будет создан документ ""Взаимозачет задолженности"">");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НовыеДокументы);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.АвансыДокумент.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Авансы.Документ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	
КонецПроцедуры

#Область УправлениеЭлементамиФормы

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	НесколькоОрганизаций  = ДоступныеОрганизации.Количество() > 1;
	
	Элементы.ОплатыОрганизация.Видимость  = НесколькоОрганизаций;
	Элементы.АвансыОрганизация.Видимость  = НесколькоОрганизаций;
	Элементы.ЗачтеноОрганизация.Видимость = НесколькоОрганизаций;
	
	Элементы.ОплатыПартнер.Видимость = (Партнер <> Справочники.Партнеры.НашеПредприятие);
	
	Элементы.АвансыДоговор.Видимость = ИспользоватьДоговоры;
	Элементы.ПоВсемДоговорам.Видимость = ИспользоватьДоговоры;
	
	Если ИспользоватьДоговоры Тогда
		Элементы.ПояснениеКТаблицеОплаты.Заголовок = НСтр("ru='Список нераспределенных платежей и документов оплаты, отнесенных на выбранный договор. Сумма будет распределена на зачитываемый объект расчетов.';uk='Список нерозподілених платежів та документів оплати, які віднесені на вибраний договір. Сума буде розподілена на об''єкт розрахунків, що зараховується.'");
	Иначе
		Элементы.ПояснениеКТаблицеОплаты.Заголовок = НСтр("ru='Список нераспределенных платежей и документов оплаты. Сумма будет распределена на зачитываемый объект расчетов.';uk='Список нерозподілених платежів та документів оплати. Сума буде розподілена на об''єкт розрахунків, що зараховується.'");
	КонецЕсли;
	
	Если ИспользоватьДоговоры Тогда
		Элементы.ПояснениеКТаблицеАвансы.Заголовок = НСтр("ru='Остатки авансов по договорам контрагента. Для зачета/переноса аванса будет создан документ ""Взаимозачет задолженности"".';uk='Залишки авансів по договорах контрагента. Для заліку/перенесення авансу буде створено документ ""Взаємозалік заборгованості"".'");
	Иначе
		Элементы.ПояснениеКТаблицеАвансы.Заголовок = НСтр("ru='Остатки авансов. Для зачета/переноса аванса будет создан документ ""Взаимозачет задолженности"".';uk='Залишки авансів. Для заліку/перенесення авансу буде створено документ ""Взаємозалік заборгованості"".'");
	КонецЕсли;
	
	Элементы.ОплатыДоступноКЗачету.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Доступно (%1)';uk='Доступно (%1)'"),
		Строка(ВалютаВзаиморасчетов));
	Элементы.АвансыДоступноКЗачету.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Доступно (%1)';uk='Доступно (%1)'"),
		Строка(ВалютаВзаиморасчетов));
	Элементы.ЗачтеноСуммаЗачтено.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Зачтено (%1)';uk='Зараховано (%1)'"),
		Строка(ВалютаВзаиморасчетов));
	
	Если РасчетыПоДоговорам Тогда
		Заголовок = НСтр("ru='Зачет оплат по договору:';uk='Залік оплат за договором:'") + " " + Строка(Договор);
	Иначе
		Заголовок = НСтр("ru='Зачет оплат по документу:';uk='Залік оплат за документом:'") + " " + Строка(Документ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеТаблицыРасчетовСПартнерами

&НаСервере
Функция ПолучитьСуммуКОплате()
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|
	|ПОМЕСТИТЬ АналитикаУчетаПоПартнерам
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|ГДЕ
	|	АналитикаПоПартнерам.Организация = &Организация
	|	И АналитикаПоПартнерам.Партнер = &Партнер
	|	И АналитикаПоПартнерам.Контрагент = &Контрагент
	|	И АналитикаПоПартнерам.Договор = &Договор
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(РасчетыСПоставщиками.КОплатеРасход, 0)) КАК КОплате
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Обороты(,,Регистратор,
	|		&ЕстьРасчетыСПоставщиками
	|		И АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			)
	|		И ЗаказПоставщику = &ОбъектРасчетов
	|	) КАК РасчетыСПоставщиками
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(РасчетыСПоставщиками.КОплатеРасход, 0)) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентами.КОплатеПриход, 0)) КАК КОплате
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(,,Регистратор,
	|		&ЕстьРасчетыСКлиентами
	|		И АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			)
	|		И ЗаказКлиента = &ОбъектРасчетов
	|	) КАК РасчетыСКлиентами
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентами.КОплатеПриход, 0)) > 0
	|");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ОбъектРасчетов", ОбъектРасчетов);
	Запрос.УстановитьПараметр("ЕстьРасчетыСКлиентами", ЕстьРасчетыСКлиентами);
	Запрос.УстановитьПараметр("ЕстьРасчетыСПоставщиками", ЕстьРасчетыСПоставщиками);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КОплате = Выборка.КОплате;
	Иначе
		КОплате = 0;
	КонецЕсли;
	
	Возврат КОплате;
	
КонецФункции // ПолучитьСуммуКОплате()

&НаСервере
Процедура ПолучитьРеквизитыРасчетовСПартнером()
	
	ИмяДокумента = Метаданные.НайтиПоТипу(ТипЗнч(Документ)).Имя;
	
	Попытка
		Если ОбщегоНазначения.ВидОбъектаПоСсылке(Документ) = "Документ" Тогда
			СтруктураРеквизитов = Документы[ИмяДокумента].РеквизитыДокумента(Документ);
		ИначеЕсли ОбщегоНазначения.ВидОбъектаПоСсылке(Документ) = "Справочник" Тогда
			СтруктураРеквизитов = Справочники[ИмяДокумента].РеквизитыОбъекта(Документ);
		КонецЕсли;
	Исключение
		СтруктураРеквизитов = Неопределено;
	КонецПопытки;
	
	Если СтруктураРеквизитов <> Неопределено Тогда
		
		ДатаДокумента = СтруктураРеквизитов.Дата;
		Организация = СтруктураРеквизитов.Организация;
		Партнер = СтруктураРеквизитов.Партнер;
		Контрагент = СтруктураРеквизитов.Контрагент;
		ВалютаВзаиморасчетов = СтруктураРеквизитов.ВалютаВзаиморасчетов;
		ХозяйственнаяОперация = СтруктураРеквизитов.ХозяйственнаяОперация;
		
		Если СтруктураРеквизитов.Свойство("ПоЗаказу") Тогда
			ПоЗаказу = СтруктураРеквизитов.ПоЗаказу;
		КонецЕсли;
		Если СтруктураРеквизитов.Свойство("Договор") Тогда
			Договор = СтруктураРеквизитов.Договор;
		КонецЕсли;
		Если СтруктураРеквизитов.Свойство("ПорядокРасчетов") Тогда
			РасчетыПоДоговорам = СтруктураРеквизитов.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
			РасчетыПоЗаказам   = СтруктураРеквизитов.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
		КонецЕсли;
		
		ОбъектРасчетов = ?(РасчетыПоДоговорам, Договор, Документ);
		
		МассивРасчетыСПоставщиками = Новый Массив;
		МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
		МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет);
		МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
		МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомитентуОСписании);
		МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию);
		МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика);
		МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхДокументовОтПоставщика);
		Если Не КомиссионноеВознаграждение Тогда
			МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомитенту);
			МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациями);
		Иначе
			МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомиссионера);
		КонецЕсли;
		МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ОформлениеГТДСамостоятельно);
		ЕстьРасчетыСПоставщиками = МассивРасчетыСПоставщиками.Найти(ХозяйственнаяОперация) <> Неопределено;
		
		МассивРасчетыСКлиентами = Новый Массив;
		МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
		МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет);
		МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности);
		МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента);
		МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании);
		МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья);
		Если Не КомиссионноеВознаграждение Тогда
			МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомиссионера);
		Иначе
			МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомитенту);
			МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациями);
		КонецЕсли;
		МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.РеализацияПрочихАктивов);
		ЕстьРасчетыСКлиентами = МассивРасчетыСКлиентами.Найти(ХозяйственнаяОперация) <> Неопределено;
		
		МассивРасчетыМеждуОрганизациями = Новый Массив;
		МассивРасчетыМеждуОрганизациями.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию);
		МассивРасчетыМеждуОрганизациями.Добавить(Перечисления.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациями);
		ЕстьРасчетыМеждуОрганизациями = МассивРасчетыМеждуОрганизациями.Найти(ХозяйственнаяОперация) <> Неопределено;
		
		Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионера
		 ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомитенту
		 ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациями Тогда
			Если КомиссионноеВознаграждение Тогда
				СуммаВзаиморасчетов = СтруктураРеквизитов.СуммаВознаграждения;
			Иначе
				СуммаВзаиморасчетов = СтруктураРеквизитов.СуммаВзаиморасчетов;
			КонецЕсли;
		Иначе
			СуммаВзаиморасчетов = ПолучитьСуммуКОплате();
		КонецЕсли;
			
		МассивОрганизаций = Новый Массив;
		ГоловнаяОрганизация = Организация;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьОбособленныеПодразделенияВыделенныеНаБаланс") 
			И (ЕстьРасчетыСКлиентами Или ЕстьРасчетыСПоставщиками) Тогда
			
			Запрос = Новый Запрос("
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Организации.ГоловнаяОрганизация КАК Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.Ссылка = &Организация
			|	И Организации.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию
			|	И Организации.ОбособленноеПодразделение");
			
			Запрос.УстановитьПараметр("Организация", Организация);
			
			МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			Если МассивОрганизаций.Количество() > 0 Тогда
				ГоловнаяОрганизация = МассивОрганизаций[0];
			КонецЕсли;
			
		КонецЕсли;
		
		МассивОрганизаций.Добавить(Организация);
		ДоступныеОрганизации.ЗагрузитьЗначения(МассивОрганизаций);
		
		МассивПартнеров = Новый Массив;
		Если Партнер <> Справочники.Партнеры.НеизвестныйПартнер Тогда
			
			Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	&Партнер КАК Партнер
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДанныеРегистра.Родитель КАК Партнер
			|ИЗ
			|	РегистрСведений.ИерархияПартнеров КАК ДанныеРегистра
			|ГДЕ
			|	ДанныеРегистра.Партнер = &Партнер");
			
			Запрос.УстановитьПараметр("Партнер", Партнер);
			МассивПартнеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Партнер");
			
		КонецЕсли;
		
		МассивПартнеров.Добавить(Справочники.Партнеры.НеизвестныйПартнер);
		ДоступныеПартнеры.ЗагрузитьЗначения(МассивПартнеров);
		
		Если Не ЕстьРасчетыМеждуОрганизациями
			И (ЕстьРасчетыСКлиентами И ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами")
			Или (ЕстьРасчетыСПоставщиками И ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"))) Тогда
			ИспользоватьДоговоры = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПоРасчетамСПартнерами()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если (Не ЕстьРасчетыСКлиентами И Не ЕстьРасчетыСПоставщиками)
	 ИЛИ (КомиссионноеВознаграждение И СуммаВзаиморасчетов = 0)
	 ИЛИ (ПоЗаказу И РасчетыПоЗаказам) Тогда
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Зачет оплаты не требуется использовать для документа %1';uk='Залік оплати не потрібно використовувати для документа %1'"),
			Документ);
		ВызватьИсключение Текст;
	КонецЕсли;
	
	Если ЕстьРасчетыСКлиентами Тогда
		ТекстЗапроса = ТекстЗапросаПоРасчетамСКлиентами();
	КонецЕсли;
	Если ЕстьРасчетыСПоставщиками Тогда
		ТекстЗапроса = ТекстЗапросаПоРасчетамСПоставщиками();
	КонецЕсли;
	
	ЭтоУправленческаяОрганизация = (Организация = Справочники.Организации.УправленческаяОрганизация);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",                  ДоступныеОрганизации);
	Запрос.УстановитьПараметр("ЭтоУправленческаяОрганизация", ЭтоУправленческаяОрганизация);
	Запрос.УстановитьПараметр("Партнер",                      ДоступныеПартнеры);
	Запрос.УстановитьПараметр("Контрагент",                   Контрагент);
	Запрос.УстановитьПараметр("Договор",                      Договор);
	Запрос.УстановитьПараметр("Документ",                     Документ);
	Запрос.УстановитьПараметр("ОбъектРасчетов",               ОбъектРасчетов);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",        ХозяйственнаяОперация);
	Запрос.УстановитьПараметр("ДатаДокумента",                НачалоДня(ДатаДокумента));
	Запрос.Текст = ТекстЗапроса;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Оплаты.Очистить();
	Авансы.Очистить();
	Зачтено.Очистить();
	
	Результат = Запрос.ВыполнитьПакет();
	КоличествоЗапросов = Результат.ВГраница();
	
	//Оплаты
	ВыборкаОплаты = Результат[КоличествоЗапросов - 2].Выбрать();
	Пока ВыборкаОплаты.Следующий() Цикл
		
		НоваяСтрока = Оплаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаОплаты);
		
		НоваяСтрока.ВерсияДанных = ВерсияДанныхДокумента(ВыборкаОплаты.Документ);
		
		Если ВалютаВзаиморасчетов <> ВыборкаОплаты.ВалютаВзаиморасчетов Тогда
			НоваяСтрока.ДоступноКЗачету = ПересчитатьСуммуВВалютуВзаиморасчетов(
				ВыборкаОплаты.СуммаВВалютеПлатежа, ВыборкаОплаты.Валюта, ВыборкаОплаты.Дата);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаОплат = Оплаты.Выгрузить();
	ТаблицаОплат.Свернуть("Организация, Документ, ВерсияДанных, СуммаДокумента, Валюта, Партнер, СтатьяДвиженияДенежныхСредств, ДанныеИзменены, Дата, ДоступноРедактирование", "ДоступноКЗачету, СуммаВВалютеПлатежа");
	Оплаты.Загрузить(ТаблицаОплат);
	
	// Авансы
	ВыборкаАвансы = Результат[КоличествоЗапросов - 1].Выбрать();
	Пока ВыборкаАвансы.Следующий() Цикл
		
		НоваяСтрока = Авансы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаАвансы);
		НоваяСтрока.СуммаВВалютеПлатежа = НоваяСтрока.ДоступноКЗачету;
		
		Если ВалютаВзаиморасчетов <> ВыборкаАвансы.ВалютаВзаиморасчетов Тогда
			НоваяСтрока.ДоступноКЗачету = ПересчитатьСуммуВВалютуВзаиморасчетов(
				ВыборкаАвансы.ДоступноКЗачету, ВыборкаАвансы.ВалютаВзаиморасчетов);
		КонецЕсли;
	КонецЦикла;
	
	// Зачтено
	ВыборкаЗачтено = Результат[КоличествоЗапросов].Выбрать();
	Пока ВыборкаЗачтено.Следующий() Цикл
		
		НоваяСтрока = Зачтено.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗачтено);
		
		НоваяСтрока.ВерсияДанных = ВерсияДанныхДокумента(ВыборкаЗачтено.Документ);
		
		Если ВалютаВзаиморасчетов <> ВыборкаЗачтено.ВалютаВзаиморасчетов Тогда
			НоваяСтрока.ДоступноКЗачету = ПересчитатьСуммуВВалютуВзаиморасчетов(
				ВыборкаЗачтено.СуммаВВалютеПлатежа, ВыборкаЗачтено.Валюта, ВыборкаЗачтено.Дата);
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьСуммуЗачета();
	РасчитатьКоличествоСтрок();
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаПоРасчетамСПоставщиками()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики,
	|	АналитикаПоПартнерам.Партнер КАК Партнер,
	|	АналитикаПоПартнерам.Контрагент КАК Контрагент,
	|	АналитикаПоПартнерам.Договор КАК Договор
	|
	|ПОМЕСТИТЬ АналитикаУчетаПоПартнерам
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|ГДЕ
	|	АналитикаПоПартнерам.Организация В (&Организация)
	|	И АналитикаПоПартнерам.Партнер В (&Партнер)
	|	И АналитикаПоПартнерам.Контрагент = &Контрагент
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|
	|ПОМЕСТИТЬ АналитикаУчетаПоПартнерамРегл
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|ГДЕ
	|	АналитикаПоПартнерам.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И АналитикаПоПартнерам.Партнер В (&Партнер)
	|	И АналитикаПоПартнерам.Контрагент = &Контрагент
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	РасчетыСПоставщиками.ЗаказПоставщику                   КАК ЗаказПоставщику,
	|	РасчетыСПоставщиками.Валюта                            КАК Валюта,
	|	РасчетыСПоставщиками.СуммаОстаток                      КАК СуммаАванса
	|
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Остатки(,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			)
	|			И ЗаказПоставщику <> &ОбъектРасчетов
	|	) КАК РасчетыСПоставщиками
	|ГДЕ
	|	РасчетыСПоставщиками.СуммаОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ЗаказПоставщику,
	|	Валюта
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	РасчетыСПоставщиками.ЗаказПоставщику                   КАК ЗаказПоставщику,
	|	РасчетыСПоставщиками.Валюта                            КАК Валюта,
	|	РасчетыСПоставщиками.СуммаПриход                       КАК СуммаЗачета
	|
	|ПОМЕСТИТЬ ТаблицаЗачтено
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Обороты(,, Период,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			)
	|		И ЗаказПоставщику = &ОбъектРасчетов
	|	) КАК РасчетыСПоставщиками
	|ГДЕ
	|	РасчетыСПоставщиками.СуммаПриход > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ЗаказПоставщику,
	|	Валюта
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаРасчеты.Партнер КАК Партнер,
	|	ТаблицаРасчеты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ТаблицаРасчеты.Валюта КАК Валюта
	|
	|ПОМЕСТИТЬ ТаблицаОтбораДокументов
	|ИЗ 
	|	(ВЫБРАТЬ
	|		ТаблицаОстатков.Партнер,
	|		ТаблицаОстатков.ЗаказПоставщику,
	|		ТаблицаОстатков.Валюта
	|	ИЗ
	|		ТаблицаОстатков КАК ТаблицаОстатков
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаЗачтено.Партнер,
	|		ТаблицаЗачтено.ЗаказПоставщику,
	|		ТаблицаЗачтено.Валюта
	|	
	|	) КАК ТаблицаРасчеты
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер,
	|	ЗаказПоставщику,
	|	Валюта
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПоставщиками.ЗаказПоставщику КАК ЗаказПоставщику,
	|	РасчетыСПоставщиками.СуммаОстаток КАК СуммаДолга
	|
	|ПОМЕСТИТЬ ТаблицаОстатковРеглУчет
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Остатки(,
	|		&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
	|		И &ЭтоУправленческаяОрганизация
	|		И ЗаказПоставщику ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|		И АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерамРегл КАК АналитикаПоПартнерам
	|			)
	|	) КАК РасчетыСПоставщиками
	|ГДЕ
	|	РасчетыСПоставщиками.СуммаОстаток < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка         КАК Ссылка,
	|	ДанныеДокумента.Дата           КАК Дата,
	|	ДанныеДокумента.Валюта         КАК Валюта,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.Партнер = ТаблицаОтбораДокументов.Партнер
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказПоставщику
	|ГДЕ
	|	ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику)
	|	И ДанныеДокумента.Организация В (&Организация)
	|	И ДанныеДокумента.Контрагент = &Контрагент
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказПоставщику ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка         КАК Ссылка,
	|	ДанныеДокумента.Дата           КАК Дата,
	|	ДанныеДокумента.Валюта         КАК Валюта,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ТаблицаОтбораДокументов.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказПоставщику
	|ГДЕ
	|	ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию)
	|	И ДанныеДокумента.Организация В (&Организация)
	|	И (ДанныеДокумента.ОрганизацияПолучатель = &Контрагент
	|		ИЛИ ДанныеДокумента.КассаПолучатель.Владелец = &Контрагент)
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказПоставщику ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка         КАК Ссылка,
	|	ДанныеДокумента.Дата           КАК Дата,
	|	ДанныеДокумента.Валюта         КАК Валюта,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.Партнер = ТаблицаОтбораДокументов.Партнер
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказПоставщику
	|ГДЕ
	|	ДанныеДокумента.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеТаможне)
	|	)
	|	И ДанныеДокумента.Организация В (&Организация)
	|	И ДанныеДокумента.Контрагент = &Контрагент
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказПоставщику ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка         КАК Ссылка,
	|	ДанныеДокумента.Дата           КАК Дата,
	|	ДанныеДокумента.Валюта         КАК Валюта,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ТаблицаОтбораДокументов.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказПоставщику
	|ГДЕ
	|	ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию)
	|	И ДанныеДокумента.Организация В (&Организация)
	|	И ДанныеДокумента.БанковскийСчетПолучатель.Владелец = &Контрагент
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказПоставщику ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                               КАК Ссылка,
	|	ДанныеДокумента.Дата                                 КАК Дата,
	|	ДанныеДокумента.Валюта                               КАК Валюта,
	|	СУММА(ТаблицаРасшифровкаПлатежа.Сумма)               КАК СуммаДокумента
	|ИЗ
	|	Документ.АвансовыйОтчет КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.АвансовыйОтчет.ОплатаПоставщикам КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|		И ТаблицаРасшифровкаПлатежа.Контрагент = &Контрагент
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.Поставщик = ТаблицаОтбораДокументов.Партнер
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказПоставщику
	|ГДЕ
	|	ДанныеДокумента.Организация В (&Организация)
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказПоставщику ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                               КАК Ссылка,
	|	ДанныеДокумента.Дата                                 КАК Дата,
	|	ДанныеДокумента.Валюта                               КАК Валюта,
	|	СУММА(ТаблицаРасшифровкаПлатежа.Сумма)               КАК СуммаДокумента
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВозвратТоваровПоставщику.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ДанныеДокумента.Партнер = ТаблицаОтбораДокументов.Партнер
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказПоставщику
	|ГДЕ
	|	ДанныеДокумента.Организация В (&Организация)
	|	И ДанныеДокумента.Контрагент = &Контрагент
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказПоставщику ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                               КАК Ссылка,
	|	ДанныеДокумента.Дата                                 КАК Дата,
	|	ДанныеДокумента.Валюта                               КАК Валюта,
	|	СУММА(ТаблицаРасшифровкаПлатежа.Сумма)               КАК СуммаДокумента
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеТоваровУслуг.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ДанныеДокумента.Партнер = ТаблицаОтбораДокументов.Партнер
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказПоставщику
	|ГДЕ
	|	&ЭтоУправленческаяОрганизация
	|	И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет)
	|	И ДанныеДокумента.Контрагент = &Контрагент
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказПоставщику ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                               КАК Ссылка,
	|	ДанныеДокумента.Дата                                 КАК Дата,
	|	ДанныеДокумента.Валюта                               КАК Валюта,
	|	СУММА(ТаблицаРасшифровкаПлатежа.Сумма)               КАК СуммаДокумента
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВозвратТоваровМеждуОрганизациями.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказПоставщику
	|		И (ДанныеДокумента.РасчетыЧерезОтдельногоКонтрагента И ДанныеДокумента.Партнер = ТаблицаОтбораДокументов.Партнер
	|			ИЛИ НЕ ДанныеДокумента.РасчетыЧерезОтдельногоКонтрагента И ТаблицаОтбораДокументов.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие))
	|ГДЕ
	|	ДанныеДокумента.Организация В(&Организация)
	|	И (ДанныеДокумента.РасчетыЧерезОтдельногоКонтрагента И ДанныеДокумента.Контрагент = &Контрагент
	|		ИЛИ НЕ ДанныеДокумента.РасчетыЧерезОтдельногоКонтрагента И ДанныеДокумента.ОрганизацияПолучатель = &Контрагент)
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказПоставщику ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                         КАК Ссылка,
	|	ДанныеДокумента.Дата                           КАК Дата,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов КАК Валюта,
	|	СУММА(ТаблицаРасшифровкаПлатежа.Сумма)         КАК СуммаДокумента
	|ИЗ
	|	Документ.ВводОстатков КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВводОстатков.РасчетыСПартнерами КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.Партнер = ТаблицаОтбораДокументов.Партнер
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.РасчетныйДокумент = ТаблицаОтбораДокументов.ЗаказПоставщику
	|ГДЕ
	|	ДанныеДокумента.Организация В(&Организация)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийВводаОстатков.ОстаткиЗадолженностиПередПоставщиками),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийВводаОстатков.ОстаткиПоАвансамПоставщикам)
	|		)
	|	И ТаблицаРасшифровкаПлатежа.Контрагент = &Контрагент
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказПоставщику ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.РасчетныйДокумент = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                         КАК Ссылка,
	|	ДанныеДокумента.Дата                           КАК Дата,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов КАК Валюта,
	|	СУММА(ТаблицаРасшифровкаПлатежа.Сумма)         КАК СуммаДокумента
	|ИЗ
	|	Документ.ВводОстатков КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВводОстатков.РасчетыМеждуОрганизациями КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО 
	|		ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.РасчетныйДокумент = ТаблицаОтбораДокументов.ЗаказПоставщику
	|		И ТаблицаОтбораДокументов.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|ГДЕ
	|	ДанныеДокумента.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийВводаОстатков.ОстаткиРасчетовМеждуОрганизациямиПоАвансам)
	|	И ДанныеДокумента.Организация  = &Контрагент
	|	И ДанныеДокумента.ОрганизацияПолучатель В(&Организация)
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказПоставщику ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.РасчетныйДокумент = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка         КАК Ссылка,
	|	ДанныеДокумента.Дата           КАК Дата,
	|	ДанныеДокумента.Валюта         КАК Валюта,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВзаимозачетЗадолженности.КредиторскаяЗадолженность КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.Партнер = ТаблицаОтбораДокументов.Партнер
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказПоставщику
	|		И ТаблицаРасшифровкаПлатежа.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|ГДЕ
	|	ДанныеДокумента.Организация В (&Организация)
	|	И ДанныеДокумента.КонтрагентДебитор = &Контрагент
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказПоставщику ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Оплаты (Нераспределенные платежи).
	// (1) Документы оплаты в рамках выбранного договора до даты документа
	|ВЫБРАТЬ
	|	ТаблицаОстатков.ЗаказПоставщику                                 КАК Заказ,
	|	ТаблицаОстатков.Валюта                                          КАК ВалютаВзаиморасчетов,
	
	|	РасчетыСПоставщиками.Регистратор                                КАК Документ,
	|	Аналитика.КлючАналитики                                         КАК КлючАналитики,
	|	Аналитика.Организация                                           КАК Организация,
	|	Аналитика.Партнер                                               КАК Партнер,
	|	Аналитика.Контрагент                                            КАК Контрагент,
	|	ЕСТЬNULL(ТаблицаДокументов.Дата, ДАТАВРЕМЯ(1,1,1))              КАК Дата,
	|	ЕСТЬNULL(ТаблицаДокументов.СуммаДокумента, 0)                   КАК СуммаДокумента,
	|	ЕСТЬNULL(ТаблицаДокументов.Валюта, РасчетыСПоставщиками.Валюта) КАК Валюта,
	|	ДвиженияРасчеты.СтатьяДвиженияДенежныхСредств                   КАК СтатьяДвиженияДенежныхСредств,
	|	ЕСТЬNULL(ДвиженияРасчеты.СуммаОплатыВВалютеВзаиморасчетов,
	|		РасчетыСПоставщиками.СуммаПриход)                           КАК ДоступноКЗачету,
	|	ЕСТЬNULL(ДвиженияРасчеты.СуммаОплатыВВалютеПлатежа,
	|		РасчетыСПоставщиками.СуммаПриход)                           КАК СуммаВВалютеПлатежа,
	|	ВЫБОР КОГДА НЕ ТаблицаДокументов.Ссылка ЕСТЬ NULL ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ                                                           КАК ДоступноРедактирование
	|
	|ПОМЕСТИТЬ ТаблицаКРаспределению
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Обороты(&ДатаДокумента,,
	|		Регистратор,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ГДЕ
	|				КлючАналитики.Договор = &Договор
	|			)
	|		И (ЗаказПоставщику, Валюта) В (
	|			ВЫБРАТЬ
	|				ТаблицаОстатков.ЗаказПоставщику,
	|				ТаблицаОстатков.Валюта
	|			ИЗ
	|				ТаблицаОстатков КАК ТаблицаОстатков
	|			ГДЕ
	|				ТаблицаОстатков.ЗаказПоставщику ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			)
	|	) КАК РасчетыСПоставщиками
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаОстатков КАК ТаблицаОстатков
	|	ПО
	|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
	|		И РасчетыСПоставщиками.ЗаказПоставщику = ТаблицаОстатков.ЗаказПоставщику
	|		И РасчетыСПоставщиками.Валюта = ТаблицаОстатков.Валюта
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО
	|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаДокументов КАК ТаблицаДокументов
	|	ПО
	|		РасчетыСПоставщиками.Регистратор = ТаблицаДокументов.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент КАК ДвиженияРасчеты
	|	ПО
	|		(ДвиженияРасчеты.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщикуПодотчетнымЛицом),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеТаможне),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию)))
	|		И (ДвиженияРасчеты.СуммаОплатыВВалютеВзаиморасчетов > 0)
	|		И РасчетыСПоставщиками.Регистратор = ДвиженияРасчеты.Регистратор
	|		И РасчетыСПоставщиками.ЗаказПоставщику = ДвиженияРасчеты.ОбъектРасчетов
	|		И РасчетыСПоставщиками.Валюта = ДвиженияРасчеты.ВалютаВзаиморасчетов
	|		И Аналитика.Организация = ДвиженияРасчеты.Организация
	|		И Аналитика.Партнер = ДвиженияРасчеты.Партнер
	|	
	|ГДЕ
	|	РасчетыСПоставщиками.СуммаПриход > 0
	|	И РасчетыСПоставщиками.Регистратор <> &Документ
	|	И НЕ РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|	И (
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг 
	|					И ТаблицаДокументов.Ссылка ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// (2) Документы оплаты с пустым объектом расчетов.
	|ВЫБРАТЬ
	|	РасчетыСПоставщиками.ЗаказПоставщику                            КАК Заказ,
	|	РасчетыСПоставщиками.Валюта                                     КАК ВалютаВзаиморасчетов,
	|	РасчетыСПоставщиками.Регистратор                                КАК Документ,
	|	Аналитика.КлючАналитики                                         КАК КлючАналитики,
	|	Аналитика.Организация                                           КАК Организация,
	|	Аналитика.Партнер                                               КАК Партнер,
	|	Аналитика.Контрагент                                            КАК Контрагент,
	|	ЕСТЬNULL(ТаблицаДокументов.Дата, ДАТАВРЕМЯ(1,1,1))              КАК Дата,
	|	ЕСТЬNULL(ТаблицаДокументов.СуммаДокумента, 0)                   КАК СуммаДокумента,
	|	ЕСТЬNULL(ТаблицаДокументов.Валюта, РасчетыСПоставщиками.Валюта) КАК Валюта,
	|	ДвиженияРасчеты.СтатьяДвиженияДенежныхСредств                   КАК СтатьяДвиженияДенежныхСредств,
	|	ЕСТЬNULL(ДвиженияРасчеты.СуммаОплатыВВалютеВзаиморасчетов,
	|		РасчетыСПоставщиками.СуммаПриход)                           КАК ДоступноКЗачету,
	|	ЕСТЬNULL(ДвиженияРасчеты.СуммаОплатыВВалютеПлатежа,
	|		РасчетыСПоставщиками.СуммаПриход)                           КАК СуммаВВалютеПлатежа,
	|	ВЫБОР КОГДА НЕ ТаблицаДокументов.Ссылка ЕСТЬ NULL ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ                                                           КАК ДоступноРедактирование
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Обороты(,,
	|		Регистратор,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			)
	|		И ЗаказПоставщику = НЕОПРЕДЕЛЕНО
	|	) КАК РасчетыСПоставщиками
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО
	|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаДокументов КАК ТаблицаДокументов
	|	ПО
	|		РасчетыСПоставщиками.Регистратор = ТаблицаДокументов.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент КАК ДвиженияРасчеты
	|	ПО
	|		(ДвиженияРасчеты.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщикуПодотчетнымЛицом),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеТаможне),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию)))
	|		И (ДвиженияРасчеты.СуммаОплатыВВалютеВзаиморасчетов > 0)
	|		И РасчетыСПоставщиками.Регистратор = ДвиженияРасчеты.Регистратор
	|		И РасчетыСПоставщиками.ЗаказПоставщику = ДвиженияРасчеты.ОбъектРасчетов
	|		И РасчетыСПоставщиками.Валюта = ДвиженияРасчеты.ВалютаВзаиморасчетов
	|		И Аналитика.Организация = ДвиженияРасчеты.Организация
	|		И Аналитика.Партнер = ДвиженияРасчеты.Партнер
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОстатковРеглУчет КАК ТаблицаОстатковРеглУчет
	|	ПО
	|		РасчетыСПоставщиками.Регистратор = ТаблицаОстатковРеглУчет.ЗаказПоставщику
	|	
	|ГДЕ
	|	РасчетыСПоставщиками.СуммаПриход > 0
	|	И РасчетыСПоставщиками.Регистратор <> &Документ
	|	И ТаблицаОстатковРеглУчет.СуммаДолга ЕСТЬ NULL
	|	И (
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг 
	|					И ТаблицаДокументов.Ссылка ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКРаспределению.Документ                      КАК Документ,
	|	ТаблицаКРаспределению.ВалютаВзаиморасчетов          КАК ВалютаВзаиморасчетов,
	|	ТаблицаКРаспределению.Организация                   КАК Организация,
	|	ТаблицаКРаспределению.Партнер                       КАК Партнер,
	|	ТаблицаКРаспределению.Контрагент                    КАК Контрагент,
	|	ТаблицаКРаспределению.Дата                          КАК Дата,
	|	ТаблицаКРаспределению.СуммаДокумента                КАК СуммаДокумента,
	|	ТаблицаКРаспределению.Валюта                        КАК Валюта,
	|	ТаблицаКРаспределению.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ТаблицаКРаспределению.ДоступноРедактирование        КАК ДоступноРедактирование,
	|	СУММА(ТаблицаКРаспределению.ДоступноКЗачету)        КАК ДоступноКЗачету,
	|	СУММА(ТаблицаКРаспределению.СуммаВВалютеПлатежа)    КАК СуммаВВалютеПлатежа
	|ИЗ
	|	ТаблицаКРаспределению КАК ТаблицаКРаспределению
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаКРаспределению.Документ,
	|	ТаблицаКРаспределению.ВалютаВзаиморасчетов,
	|	ТаблицаКРаспределению.Организация,
	|	ТаблицаКРаспределению.Партнер,
	|	ТаблицаКРаспределению.Контрагент,
	|	ТаблицаКРаспределению.Дата,
	|	ТаблицаКРаспределению.СуммаДокумента,
	|	ТаблицаКРаспределению.Валюта,
	|	ТаблицаКРаспределению.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаКРаспределению.ДоступноРедактирование
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Авансы
	|ВЫБРАТЬ
	|	ТаблицаОстатков.ЗаказПоставщику                               КАК Заказ,
	|	ТаблицаОстатков.Валюта                                        КАК ВалютаВзаиморасчетов,
	|	Аналитика.Организация                                         КАК Организация,
	|	Аналитика.Партнер                                             КАК Партнер,
	|	Аналитика.Контрагент                                          КАК Контрагент,
	|	Аналитика.Договор                                             КАК Договор,
	|	ТаблицаОстатков.СуммаАванса - СУММА(
	|		ЕСТЬNULL(ТаблицаКРаспределению.ДоступноКЗачету, 0))       КАК ДоступноКЗачету,
	|	ВЫБОР
	|		КОГДА Аналитика.Договор = &Договор ТОГДА
	|			1
	|		ИНАЧЕ
	|			2
	|	КОНЕЦ                                                         КАК Порядок
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО
	|		ТаблицаОстатков.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаКРаспределению КАК ТаблицаКРаспределению
	|	ПО
	|		ТаблицаОстатков.АналитикаУчетаПоПартнерам = ТаблицаКРаспределению.КлючАналитики
	|		И ТаблицаОстатков.ЗаказПоставщику = ТаблицаКРаспределению.Заказ
	|		И ТаблицаОстатков.Валюта = ТаблицаКРаспределению.ВалютаВзаиморасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОстатков.ЗаказПоставщику,
	|	ТаблицаОстатков.Валюта,
	|	ТаблицаОстатков.СуммаАванса,
	|	Аналитика.Организация,
	|	Аналитика.Партнер,
	|	Аналитика.Контрагент,
	|	Аналитика.Договор
	|
	|ИМЕЮЩИЕ
	|	ТаблицаОстатков.СуммаАванса - СУММА(ЕСТЬNULL(ТаблицаКРаспределению.ДоступноКЗачету, 0)) > 0
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Зачтено (зачтенные оплаты и авансы)
	|ВЫБРАТЬ
	|	ТаблицаЗачтено.Валюта                                            КАК ВалютаВзаиморасчетов,
	|	РасчетыСПоставщиками.Регистратор                                 КАК Документ,
	|	Аналитика.Организация                                            КАК Организация,
	|	Аналитика.Контрагент                                             КАК Контрагент,
	|	ЕСТЬNULL(ДвиженияКонтрагент.Партнер, Аналитика.Партнер)          КАК Партнер,
	|	ЕСТЬNULL(ТаблицаДокументов.Дата, ДАТАВРЕМЯ(1,1,1))               КАК Дата,
	|	ЕСТЬNULL(ТаблицаДокументов.СуммаДокумента, 0)                    КАК СуммаДокумента,
	|	ЕСТЬNULL(ТаблицаДокументов.Валюта, РасчетыСПоставщиками.Валюта)  КАК Валюта,
	|	ДвиженияРасчеты.СтатьяДвиженияДенежныхСредств                    КАК СтатьяДвиженияДенежныхСредств,
	|	ДвиженияКонтрагент.ОбъектРасчетов                                КАК Заказ,
	|	ДвиженияКонтрагент.Договор                                       КАК Договор,
	|
	|	ЕСТЬNULL(
	|		ВЫБОР КОГДА
	|			РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|		ТОГДА ДвиженияКонтрагент.СуммаВВалютеВзаиморасчетов
	|			ИНАЧЕ ДвиженияРасчеты.СуммаОплатыВВалютеВзаиморасчетов
	|		КОНЕЦ,
	|	РасчетыСПоставщиками.СуммаПриход)                                КАК СуммаЗачтено,
	|	ЕСТЬNULL(ДвиженияРасчеты.СуммаОплатыВВалютеПлатежа,
	|		РасчетыСПоставщиками.СуммаПриход)                            КАК СуммаВВалютеПлатежа,
	|	
	|	ВЫБОР КОГДА НЕ ТаблицаДокументов.Ссылка ЕСТЬ NULL ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ                                                            КАК ДоступноРедактирование,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагент.Договор = &Договор ТОГДА
	|			1
	|		ИНАЧЕ
	|			2
	|	КОНЕЦ                                                            КАК Порядок
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Обороты(,,
	|		Регистратор,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			)
	|		И (ЗаказПоставщику, Валюта) В (
	|			ВЫБРАТЬ
	|				ТаблицаЗачтено.ЗаказПоставщику,
	|				ТаблицаЗачтено.Валюта
	|			ИЗ
	|				ТаблицаЗачтено КАК ТаблицаЗачтено
	|			)
	|	) КАК РасчетыСПоставщиками
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаЗачтено КАК ТаблицаЗачтено
	|	ПО
	|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = ТаблицаЗачтено.АналитикаУчетаПоПартнерам
	|		И РасчетыСПоставщиками.ЗаказПоставщику = ТаблицаЗачтено.ЗаказПоставщику
	|		И РасчетыСПоставщиками.Валюта = ТаблицаЗачтено.Валюта
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО
	|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаДокументов КАК ТаблицаДокументов
	|	ПО
	|		РасчетыСПоставщиками.Регистратор = ТаблицаДокументов.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент КАК ДвиженияРасчеты
	|	ПО
	|		ДвиженияРасчеты.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщикуПодотчетнымЛицом),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеТаможне),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию))
	|		И ДвиженияРасчеты.СуммаОплатыВВалютеВзаиморасчетов > 0
	|		И РасчетыСПоставщиками.Регистратор = ДвиженияРасчеты.Регистратор
	|		И РасчетыСПоставщиками.ЗаказПоставщику = ДвиженияРасчеты.ОбъектРасчетов
	|		И РасчетыСПоставщиками.Валюта = ДвиженияРасчеты.ВалютаВзаиморасчетов
	|		И Аналитика.Организация = ДвиженияРасчеты.Организация
	|		И Аналитика.Партнер = ДвиженияРасчеты.Партнер
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДвиженияКонтрагентКонтрагент КАК ДвиженияКонтрагент
	|	ПО
	|		ДвиженияКонтрагент.ХозяйственнаяОперация = 
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|		И ДвиженияКонтрагент.СуммаВВалютеВзаиморасчетов > 0
	|		И РасчетыСПоставщиками.Регистратор = ДвиженияКонтрагент.Регистратор
	|		И РасчетыСПоставщиками.ЗаказПоставщику = ДвиженияКонтрагент.КорОбъектРасчетов
	|		И РасчетыСПоставщиками.Валюта = ДвиженияКонтрагент.ВалютаВзаиморасчетов
	|		И Аналитика.Организация = ДвиженияКонтрагент.Организация
	|		И Аналитика.Партнер = ДвиженияКонтрагент.КорПартнер
	|		И Аналитика.Контрагент = ДвиженияКонтрагент.КорКонтрагент
	|		
	|ГДЕ
	|	РасчетыСПоставщиками.СуммаПриход <> 0
	|	И РасчетыСПоставщиками.Регистратор <> &Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Дата";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаПоРасчетамСКлиентами()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики,
	|	АналитикаПоПартнерам.Договор       КАК Договор
	|
	|ПОМЕСТИТЬ АналитикаУчетаПоПартнерам
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|ГДЕ
	|	АналитикаПоПартнерам.Организация В(&Организация)
	|	И АналитикаПоПартнерам.Партнер В (&Партнер)
	|	И АналитикаПоПартнерам.Контрагент = &Контрагент
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|
	|ПОМЕСТИТЬ АналитикаУчетаПоПартнерамРегл
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|ГДЕ
	|	АналитикаПоПартнерам.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И АналитикаПоПартнерам.Партнер В (&Партнер)
	|	И АналитикаПоПартнерам.Контрагент = &Контрагент
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентами.ЗаказКлиента КАК ЗаказКлиента,
	|	РасчетыСКлиентами.СуммаОстаток КАК СуммаДолга
	|
	|ПОМЕСТИТЬ ТаблицаОстатковРеглУчет
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(,
	|		&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|		И &ЭтоУправленческаяОрганизация
	|		И ЗаказКлиента ССЫЛКА Документ.РеализацияТоваровУслуг
	|		И АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерамРегл КАК АналитикаПоПартнерам
	|			)
	|	) КАК РасчетыСКлиентами
	|ГДЕ
	|	РасчетыСКлиентами.СуммаОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	РасчетыСКлиентами.ЗаказКлиента                      КАК ЗаказКлиента,
	|	РасчетыСКлиентами.Валюта                            КАК Валюта,
	|	-РасчетыСКлиентами.СуммаОстаток                     КАК СуммаАванса
	|
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			)
	|		И ЗаказКлиента <> &ОбъектРасчетов
	|	) КАК РасчетыСКлиентами
	|	
	|ГДЕ
	|	РасчетыСКлиентами.СуммаОстаток < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ЗаказКлиента,
	|	Валюта
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	РасчетыСКлиентами.ЗаказКлиента                      КАК ЗаказКлиента,
	|	РасчетыСКлиентами.Валюта                            КАК Валюта,
	|	РасчетыСКлиентами.СуммаРасход                       КАК СуммаЗачета
	|
	|ПОМЕСТИТЬ ТаблицаЗачтено
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(,, Период,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			)
	|		И ЗаказКлиента = &ОбъектРасчетов
	|	) КАК РасчетыСКлиентами
	|ГДЕ
	|	РасчетыСКлиентами.СуммаРасход > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ЗаказКлиента,
	|	Валюта
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаРасчеты.Партнер КАК Партнер,
	|	ТаблицаРасчеты.ЗаказКлиента КАК ЗаказКлиента,
	|	ТаблицаРасчеты.Валюта КАК Валюта
	|
	|ПОМЕСТИТЬ ТаблицаОтбораДокументов
	|ИЗ 
	|	(ВЫБРАТЬ
	|		ТаблицаОстатков.Партнер,
	|		ТаблицаОстатков.ЗаказКлиента,
	|		ТаблицаОстатков.Валюта
	|	ИЗ
	|		ТаблицаОстатков КАК ТаблицаОстатков
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаЗачтено.Партнер,
	|		ТаблицаЗачтено.ЗаказКлиента,
	|		ТаблицаЗачтено.Валюта
	|	
	|	) КАК ТаблицаРасчеты
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер,
	|	ЗаказКлиента,
	|	Валюта
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка         КАК Ссылка,
	|	ДанныеДокумента.Дата           КАК Дата,
	|	ДанныеДокумента.Валюта         КАК Валюта,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.Партнер = ТаблицаОтбораДокументов.Партнер
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказКлиента
	|ГДЕ
	|	ДанныеДокумента.Организация В (&Организация)
	|	И ДанныеДокумента.Контрагент = &Контрагент
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказКлиента ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка         КАК Ссылка,
	|	ДанныеДокумента.Дата           КАК Дата,
	|	ДанныеДокумента.Валюта         КАК Валюта,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.Партнер = ТаблицаОтбораДокументов.Партнер
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказКлиента
	|ГДЕ
	|	ДанныеДокумента.Организация В (&Организация)
	|	И ДанныеДокумента.Контрагент = &Контрагент
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказКлиента ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка         КАК Ссылка,
	|	ДанныеДокумента.Дата           КАК Дата,
	|	ДанныеДокумента.Валюта         КАК Валюта,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ОперацияПоПлатежнойКарте КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.Партнер = ТаблицаОтбораДокументов.Партнер
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказКлиента
	|ГДЕ
	|	ДанныеДокумента.Организация В (&Организация)
	|	И ДанныеДокумента.Контрагент = &Контрагент
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказКлиента ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                               КАК Ссылка,
	|	ДанныеДокумента.Дата                                 КАК Дата,
	|	ДанныеДокумента.Валюта                               КАК Валюта,
	|	СУММА(ТаблицаРасшифровкаПлатежа.Сумма)               КАК СуммаДокумента
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВозвратТоваровОтКлиента.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ДанныеДокумента.Партнер = ТаблицаОтбораДокументов.Партнер
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказКлиента
	|ГДЕ
	|	ДанныеДокумента.Организация В (&Организация)
	|	И ДанныеДокумента.Контрагент = &Контрагент
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказКлиента ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                               КАК Ссылка,
	|	ДанныеДокумента.Дата                                 КАК Дата,
	|	ДанныеДокумента.Валюта                               КАК Валюта,
	|	СУММА(ТаблицаРасшифровкаПлатежа.Сумма)               КАК СуммаДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РеализацияТоваровУслуг.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ДанныеДокумента.Партнер = ТаблицаОтбораДокументов.Партнер
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказКлиента
	|ГДЕ
	|	&ЭтоУправленческаяОрганизация
	|	И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|	И ДанныеДокумента.Контрагент = &Контрагент
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказКлиента ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                         КАК Ссылка,
	|	ДанныеДокумента.Дата                           КАК Дата,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов КАК Валюта,
	|	СУММА(ТаблицаРасшифровкаПлатежа.Сумма)         КАК СуммаДокумента
	|ИЗ
	|	Документ.ВводОстатков КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВводОстатков.РасчетыСПартнерами КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.Партнер = ТаблицаОтбораДокументов.Партнер
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.РасчетныйДокумент = ТаблицаОтбораДокументов.ЗаказКлиента
	|ГДЕ
	|	ДанныеДокумента.Организация В (&Организация)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийВводаОстатков.ОстаткиПоАвансамКлиентов),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийВводаОстатков.ОстаткиЗадолженностиКлиентов)
	|		)
	|	И ТаблицаРасшифровкаПлатежа.Контрагент = &Контрагент
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказКлиента ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.РасчетныйДокумент = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка         КАК Ссылка,
	|	ДанныеДокумента.Дата           КАК Дата,
	|	ДанныеДокумента.Валюта         КАК Валюта,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВзаимозачетЗадолженности.ДебиторскаяЗадолженность КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаРасшифровкаПлатежа.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОтбораДокументов КАК ТаблицаОтбораДокументов
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.Партнер = ТаблицаОтбораДокументов.Партнер
	|		И ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов = ТаблицаОтбораДокументов.Валюта
	|		И ТаблицаРасшифровкаПлатежа.Заказ = ТаблицаОтбораДокументов.ЗаказКлиента
	|		И ТаблицаРасшифровкаПлатежа.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|ГДЕ
	|	ДанныеДокумента.Организация В (&Организация)
	|	И ДанныеДокумента.КонтрагентКредитор = &Контрагент
	|	И (НЕ ТаблицаОтбораДокументов.ЗаказКлиента ЕСТЬ NULL ИЛИ ТаблицаРасшифровкаПлатежа.Заказ = НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Оплаты (Нераспределенные платежи).
	// (1) Документы оплаты в рамках выбранного договора до даты документа
	|ВЫБРАТЬ
	|	ТаблицаОстатков.ЗаказКлиента                                  КАК Заказ,
	|	ТаблицаОстатков.Валюта                                        КАК ВалютаВзаиморасчетов,
	|	РасчетыСКлиентами.Регистратор                                 КАК Документ,
	|	Аналитика.КлючАналитики                                       КАК КлючАналитики,
	|	Аналитика.Организация                                         КАК Организация,
	|	Аналитика.Партнер                                             КАК Партнер,
	|	Аналитика.Контрагент                                          КАК Контрагент,
	|	ЕСТЬNULL(ТаблицаДокументов.Дата, ДАТАВРЕМЯ(1,1,1))            КАК Дата,
	|	ЕСТЬNULL(ТаблицаДокументов.СуммаДокумента, 0)                 КАК СуммаДокумента,
	|	ЕСТЬNULL(ТаблицаДокументов.Валюта, РасчетыСКлиентами.Валюта)  КАК Валюта,
	|	ДвиженияРасчеты.СтатьяДвиженияДенежныхСредств                 КАК СтатьяДвиженияДенежныхСредств,
	|	ЕСТЬNULL(ДвиженияРасчеты.СуммаОплатыВВалютеВзаиморасчетов,
	|		РасчетыСКлиентами.СуммаРасход)                            КАК ДоступноКЗачету,
	|	ЕСТЬNULL(ДвиженияРасчеты.СуммаОплатыВВалютеПлатежа,
	|		РасчетыСКлиентами.СуммаРасход)                            КАК СуммаВВалютеПлатежа,
	|	ВЫБОР КОГДА НЕ ТаблицаДокументов.Ссылка ЕСТЬ NULL ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ                                                         КАК ДоступноРедактирование
	|	
	|ПОМЕСТИТЬ ТаблицаКРаспределению
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(&ДатаДокумента,,
	|		Регистратор,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ГДЕ
	|				КлючАналитики.Договор = &Договор
	|			)
	|		И (ЗаказКлиента, Валюта) В (
	|			ВЫБРАТЬ
	|				ТаблицаОстатков.ЗаказКлиента,
	|				ТаблицаОстатков.Валюта
	|			ИЗ
	|				ТаблицаОстатков КАК ТаблицаОстатков
	|			ГДЕ
	|				ТаблицаОстатков.ЗаказКлиента ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			)
	|	) КАК РасчетыСКлиентами
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаОстатков КАК ТаблицаОстатков
	|	ПО
	|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
	|		И РасчетыСКлиентами.ЗаказКлиента = ТаблицаОстатков.ЗаказКлиента
	|		И РасчетыСКлиентами.Валюта = ТаблицаОстатков.Валюта
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО
	|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаДокументов КАК ТаблицаДокументов
	|	ПО
	|		РасчетыСКлиентами.Регистратор = ТаблицаДокументов.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент КАК ДвиженияРасчеты
	|	ПО
	|		ДвиженияРасчеты.ХозяйственнаяОперация В
	|			(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиентаПоПлатежнойКарте),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации))
	|		И ДвиженияРасчеты.СуммаОплатыВВалютеВзаиморасчетов > 0
	|		И РасчетыСКлиентами.Регистратор = ДвиженияРасчеты.Регистратор
	|		И РасчетыСКлиентами.ЗаказКлиента = ДвиженияРасчеты.ОбъектРасчетов
	|		И РасчетыСКлиентами.Валюта = ДвиженияРасчеты.ВалютаВзаиморасчетов
	|		И Аналитика.Организация = ДвиженияРасчеты.Организация
	|		И Аналитика.Партнер = ДвиженияРасчеты.Партнер
	|
	|ГДЕ
	|	РасчетыСКлиентами.СуммаРасход > 0
	|	И РасчетыСКлиентами.Регистратор <> &Документ
	|	И НЕ РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// (2) Документы оплаты с пустым объектом расчетов.
	|ВЫБРАТЬ
	|	РасчетыСКлиентами.ЗаказКлиента                                КАК Заказ,
	|	РасчетыСКлиентами.Валюта                                      КАК ВалютаВзаиморасчетов,
	|	РасчетыСКлиентами.Регистратор                                 КАК Документ,
	|	Аналитика.КлючАналитики                                       КАК КлючАналитики,
	|	Аналитика.Организация                                         КАК Организация,
	|	Аналитика.Партнер                                             КАК Партнер,
	|	Аналитика.Контрагент                                          КАК Контрагент,
	|	ЕСТЬNULL(ТаблицаДокументов.Дата, ДАТАВРЕМЯ(1,1,1))            КАК Дата,
	|	ЕСТЬNULL(ТаблицаДокументов.СуммаДокумента, 0)                 КАК СуммаДокумента,
	|	ЕСТЬNULL(ТаблицаДокументов.Валюта, РасчетыСКлиентами.Валюта)  КАК Валюта,
	|	ДвиженияРасчеты.СтатьяДвиженияДенежныхСредств                 КАК СтатьяДвиженияДенежныхСредств,
	|	ЕСТЬNULL(ДвиженияРасчеты.СуммаОплатыВВалютеВзаиморасчетов,
	|		РасчетыСКлиентами.СуммаРасход)                            КАК ДоступноКЗачету,
	|	ЕСТЬNULL(ДвиженияРасчеты.СуммаОплатыВВалютеПлатежа,
	|		РасчетыСКлиентами.СуммаРасход)                            КАК СуммаВВалютеПлатежа,
	|	ВЫБОР КОГДА НЕ ТаблицаДокументов.Ссылка ЕСТЬ NULL ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ                                                         КАК ДоступноРедактирование
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(,,
	|		Регистратор,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			)
	|		И ЗаказКлиента = НЕОПРЕДЕЛЕНО
	|	) КАК РасчетыСКлиентами
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО
	|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаДокументов КАК ТаблицаДокументов
	|	ПО
	|		РасчетыСКлиентами.Регистратор = ТаблицаДокументов.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент КАК ДвиженияРасчеты
	|	ПО
	|		ДвиженияРасчеты.ХозяйственнаяОперация В
	|			(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиентаПоПлатежнойКарте),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации))
	|		И ДвиженияРасчеты.СуммаОплатыВВалютеВзаиморасчетов > 0
	|		И РасчетыСКлиентами.Регистратор = ДвиженияРасчеты.Регистратор
	|		И РасчетыСКлиентами.ЗаказКлиента = ДвиженияРасчеты.ОбъектРасчетов
	|		И РасчетыСКлиентами.Валюта = ДвиженияРасчеты.ВалютаВзаиморасчетов
	|		И Аналитика.Организация = ДвиженияРасчеты.Организация
	|		И Аналитика.Партнер = ДвиженияРасчеты.Партнер
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаОстатковРеглУчет КАК ТаблицаОстатковРеглУчет
	|	ПО
	|		РасчетыСКлиентами.Регистратор = ТаблицаОстатковРеглУчет.ЗаказКлиента
	|
	|ГДЕ
	|	РасчетыСКлиентами.СуммаРасход > 0
	|	И РасчетыСКлиентами.Регистратор <> &Документ
	|	И ТаблицаОстатковРеглУчет.СуммаДолга ЕСТЬ NULL
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКРаспределению.Документ                      КАК Документ,
	|	ТаблицаКРаспределению.ВалютаВзаиморасчетов          КАК ВалютаВзаиморасчетов,
	|	ТаблицаКРаспределению.Организация                   КАК Организация,
	|	ТаблицаКРаспределению.Партнер                       КАК Партнер,
	|	ТаблицаКРаспределению.Контрагент                    КАК Контрагент,
	|	ТаблицаКРаспределению.Дата                          КАК Дата,
	|	ТаблицаКРаспределению.СуммаДокумента                КАК СуммаДокумента,
	|	ТаблицаКРаспределению.Валюта                        КАК Валюта,
	|	ТаблицаКРаспределению.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ТаблицаКРаспределению.ДоступноРедактирование        КАК ДоступноРедактирование,
	|	СУММА(ТаблицаКРаспределению.ДоступноКЗачету)        КАК ДоступноКЗачету,
	|	СУММА(ТаблицаКРаспределению.СуммаВВалютеПлатежа)    КАК СуммаВВалютеПлатежа
	|ИЗ
	|	ТаблицаКРаспределению КАК ТаблицаКРаспределению
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаКРаспределению.Документ,
	|	ТаблицаКРаспределению.ВалютаВзаиморасчетов,
	|	ТаблицаКРаспределению.Организация,
	|	ТаблицаКРаспределению.Партнер,
	|	ТаблицаКРаспределению.Контрагент,
	|	ТаблицаКРаспределению.Дата,
	|	ТаблицаКРаспределению.СуммаДокумента,
	|	ТаблицаКРаспределению.Валюта,
	|	ТаблицаКРаспределению.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаКРаспределению.ДоступноРедактирование
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Авансы
	|ВЫБРАТЬ
	|	ТаблицаОстатков.ЗаказКлиента                                  КАК Заказ,
	|	ТаблицаОстатков.Валюта                                        КАК ВалютаВзаиморасчетов,
	|	Аналитика.Организация                                         КАК Организация,
	|	Аналитика.Партнер                                             КАК Партнер,
	|	Аналитика.Контрагент                                          КАК Контрагент,
	|	Аналитика.Договор                                             КАК Договор,
	|	ТаблицаОстатков.СуммаАванса - СУММА(
	|		ЕСТЬNULL(ТаблицаКРаспределению.ДоступноКЗачету, 0))       КАК ДоступноКЗачету,
	|	ВЫБОР
	|		КОГДА Аналитика.Договор = &Договор ТОГДА
	|			1
	|		ИНАЧЕ
	|			2
	|	КОНЕЦ                                                         КАК Порядок
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО
	|		ТаблицаОстатков.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаКРаспределению КАК ТаблицаКРаспределению
	|	ПО
	|		ТаблицаОстатков.АналитикаУчетаПоПартнерам = ТаблицаКРаспределению.КлючАналитики
	|		И ТаблицаОстатков.ЗаказКлиента = ТаблицаКРаспределению.Заказ
	|		И ТаблицаОстатков.Валюта = ТаблицаКРаспределению.ВалютаВзаиморасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОстатков.ЗаказКлиента,
	|	ТаблицаОстатков.Валюта,
	|	ТаблицаОстатков.СуммаАванса,
	|	Аналитика.Организация,
	|	Аналитика.Партнер,
	|	Аналитика.Контрагент,
	|	Аналитика.Договор
	|
	|ИМЕЮЩИЕ
	|	ТаблицаОстатков.СуммаАванса - СУММА(ЕСТЬNULL(ТаблицаКРаспределению.ДоступноКЗачету, 0)) > 0
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Зачтено (зачтенные оплаты и авансы)
	|ВЫБРАТЬ
	|	ТаблицаЗачтено.Валюта                                            КАК ВалютаВзаиморасчетов,
	|	РасчетыСКлиентами.Регистратор                                    КАК Документ,
	|	Аналитика.Организация                                            КАК Организация,
	|	Аналитика.Контрагент                                             КАК Контрагент,
	|	ЕСТЬNULL(ДвиженияКонтрагент.КорПартнер, Аналитика.Партнер)       КАК Партнер,
	|	ЕСТЬNULL(ТаблицаДокументов.Дата, ДАТАВРЕМЯ(1,1,1))               КАК Дата,
	|	ЕСТЬNULL(ТаблицаДокументов.СуммаДокумента, 0)                    КАК СуммаДокумента,
	|	ЕСТЬNULL(ТаблицаДокументов.Валюта, РасчетыСКлиентами.Валюта)     КАК Валюта,
	|	ДвиженияРасчеты.СтатьяДвиженияДенежныхСредств                    КАК СтатьяДвиженияДенежныхСредств,
	|	ДвиженияКонтрагент.КорОбъектРасчетов                             КАК Заказ,
	|	ДвиженияКонтрагент.КорДоговор                                    КАК Договор,
	|
	|	ЕСТЬNULL(
	|		ВЫБОР КОГДА
	|			РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|		ТОГДА ДвиженияКонтрагент.СуммаВВалютеВзаиморасчетов
	|			ИНАЧЕ ДвиженияРасчеты.СуммаОплатыВВалютеВзаиморасчетов
	|		КОНЕЦ,
	|	РасчетыСКлиентами.СуммаРасход)                                   КАК СуммаЗачтено,
	|	ЕСТЬNULL(ДвиженияРасчеты.СуммаОплатыВВалютеПлатежа,
	|		РасчетыСКлиентами.СуммаРасход)                               КАК СуммаВВалютеПлатежа,
	|
	|	ВЫБОР КОГДА НЕ ТаблицаДокументов.Ссылка ЕСТЬ NULL ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ                                                            КАК ДоступноРедактирование,
	|	ВЫБОР
	|		КОГДА ДвиженияКонтрагент.КорДоговор = &Договор ТОГДА
	|			1
	|		ИНАЧЕ
	|			2
	|	КОНЕЦ                                                            КАК Порядок
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(,,
	|		Регистратор,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			)
	|		И (ЗаказКлиента, Валюта) В (
	|			ВЫБРАТЬ
	|				ТаблицаЗачтено.ЗаказКлиента,
	|				ТаблицаЗачтено.Валюта
	|			ИЗ
	|				ТаблицаЗачтено КАК ТаблицаЗачтено
	|			)
	|	) КАК РасчетыСКлиентами
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаЗачтено КАК ТаблицаЗачтено
	|	ПО
	|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам = ТаблицаЗачтено.АналитикаУчетаПоПартнерам
	|		И РасчетыСКлиентами.ЗаказКлиента = ТаблицаЗачтено.ЗаказКлиента
	|		И РасчетыСКлиентами.Валюта = ТаблицаЗачтено.Валюта
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО
	|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаДокументов КАК ТаблицаДокументов
	|	ПО
	|		РасчетыСКлиентами.Регистратор = ТаблицаДокументов.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент КАК ДвиженияРасчеты
	|	ПО
	|		ДвиженияРасчеты.ХозяйственнаяОперация В
	|			(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиентаПоПлатежнойКарте),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации))
	|		И ДвиженияРасчеты.СуммаОплатыВВалютеВзаиморасчетов > 0
	|		И РасчетыСКлиентами.Регистратор = ДвиженияРасчеты.Регистратор
	|		И РасчетыСКлиентами.ЗаказКлиента = ДвиженияРасчеты.ОбъектРасчетов
	|		И РасчетыСКлиентами.Валюта = ДвиженияРасчеты.ВалютаВзаиморасчетов
	|		И Аналитика.Организация = ДвиженияРасчеты.Организация
	|		И Аналитика.Партнер = ДвиженияРасчеты.Партнер
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДвиженияКонтрагентКонтрагент КАК ДвиженияКонтрагент
	|	ПО
	|		ДвиженияКонтрагент.ХозяйственнаяОперация = 
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|		И ДвиженияКонтрагент.СуммаВВалютеВзаиморасчетов > 0
	|		И РасчетыСКлиентами.Регистратор = ДвиженияКонтрагент.Регистратор
	|		И РасчетыСКлиентами.ЗаказКлиента = ДвиженияКонтрагент.ОбъектРасчетов
	|		И РасчетыСКлиентами.Валюта = ДвиженияКонтрагент.ВалютаВзаиморасчетов
	|		И Аналитика.Организация = ДвиженияКонтрагент.Организация
	|		И Аналитика.Партнер = ДвиженияКонтрагент.Партнер
	|		И Аналитика.Контрагент = ДвиженияКонтрагент.Контрагент
	|
	|		
	|ГДЕ
	|	РасчетыСКлиентами.СуммаРасход <> 0
	|	И РасчетыСКлиентами.Регистратор <> &Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Дата";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ВерсияДанныхДокумента(ДокументСсылка)
	
	ИмяДокумента = Метаданные.НайтиПоТипу(ТипЗнч(ДокументСсылка)).Имя;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.ВерсияДанных КАК ВерсияДанных
	|ИЗ
	|	Документ.%ИмяДокумента% КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ДокументСсылка
	|";
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "%ИмяДокумента%", ИмяДокумента);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВерсияДанных = Выборка.ВерсияДанных;
	Иначе
		ВерсияДанных = "            ";
	КонецЕсли;
	
	Возврат ВерсияДанных;
	
КонецФункции

#КонецОбласти

#Область ПроведениеЗачетов

&НаКлиенте
Процедура ЗачестьПлатежДляВыбранныхСтрок(МассивСтрок)
	
	ОчиститьСообщения();
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПолучитьПодтверждениеЗачетаПлатежа",
		ЭтаФорма,
		МассивСтрок);
	
	Если Недостает <= 0 Тогда
		
		Режим = Новый СписокЗначений;
		Текст = НСтр("ru='Продолжить';uk='Продовжити'");
		Режим.Добавить(КодВозвратаДиалога.Да, Текст);
		Режим.Добавить(КодВозвратаДиалога.Отмена);
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Сумма к оплате полностью зачтена.';uk='Сума до оплати повністю зарахована.'"), Режим);
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПодтверждениеЗачетаПлатежа(Результат, МассивСтрок) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗачестьНаСервере(МассивСтрок, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачестьАвансДляВыбранныхСтрок(МассивСтрок)
	
	ОчиститьСообщения();
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПолучитьПодтверждениеЗачетаАванса",
		ЭтаФорма,
		МассивСтрок);
	
	Если Недостает <= 0 Тогда
		
		Режим = Новый СписокЗначений;
		Текст = НСтр("ru='Продолжить';uk='Продовжити'");
		Режим.Добавить(КодВозвратаДиалога.Да, Текст);
		Режим.Добавить(КодВозвратаДиалога.Отмена);
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Сумма к оплате полностью зачтена.';uk='Сума до оплати повністю зарахована.'"), Режим);
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПодтверждениеЗачетаАванса(Результат, МассивСтрок) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗачестьНаСервере(МассивСтрок, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗачестьНаСервере(МассивСтрок, ЭтоОплата)
	
	Если ЭтоОплата И Не ЗаблокироватьДокументыДляРедактирования(МассивСтрок, "Оплаты") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФормы = ЭтаФорма[?(ЭтоОплата, "Оплаты", "Авансы")];
	
	РаспределитьОстаток = (Недостает > 0);
	
	СписокСтрок = Новый СписокЗначений;
	Для Каждого НомерСтроки Из МассивСтрок Цикл
		СтрокаТаблицы = ТаблицаФормы.НайтиПоИдентификатору(НомерСтроки);
		Если СтрокаТаблицы <> Неопределено Тогда
			СписокСтрок.Добавить(СтрокаТаблицы, ТаблицаФормы.Индекс(СтрокаТаблицы));
		КонецЕсли;
	КонецЦикла;
	
	СписокСтрок.СортироватьПоПредставлению();
	
	СтруктураПоиска = Новый Структура("Документ, Партнер");
	Если ЭтоОплата Тогда
		СтруктураПоиска.Вставить("СтатьяДвиженияДенежныхСредств");
	Иначе
		СтруктураПоиска.Вставить("Заказ");
	КонецЕсли;
	
	Для Каждого Строка Из СписокСтрок Цикл
		
		СтрокаТаблицы = Строка.Значение;
		Если ЭтоОплата И НЕ СтрокаТаблицы.ДоступноРедактирование Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаКЗачету         = СтрокаТаблицы.ДоступноКЗачету;
		СуммаВВалютеПлатежа  = СтрокаТаблицы.СуммаВВалютеПлатежа;
		
		Если РаспределитьОстаток Тогда
			
			СуммаБазиса  = СтрокаТаблицы.ДоступноКЗачету;
			СуммаКЗачету = ВзаиморасчетыСервер.СписатьСумму(СтрокаТаблицы.ДоступноКЗачету, Недостает);
			
			СуммаВВалютеПлатежа = ВзаиморасчетыСервер.СписатьСуммуПропорционально(
				СтрокаТаблицы.СуммаВВалютеПлатежа,
				СуммаКЗачету,
				СуммаБазиса);
			
		Иначе
			СтрокаТаблицы.ДоступноКЗачету = 0;
		КонецЕсли;
		
		Если СуммаКЗачету = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
		ЗачтенныеСтроки = Зачтено.НайтиСтроки(СтруктураПоиска);
		
		Если ЗачтенныеСтроки.Количество() = 0 Тогда
			СтрокаЗачета = Зачтено.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗачета, СтрокаТаблицы, , "СуммаВВалютеПлатежа");
			СтрокаЗачета.ДоступноРедактирование = Истина;
		Иначе
			СтрокаЗачета = ЗачтенныеСтроки[0];
		КонецЕсли;
		
		СтрокаЗачета.СуммаЗачтено        = СтрокаЗачета.СуммаЗачтено + СуммаКЗачету;
		СтрокаЗачета.СуммаВВалютеПлатежа = СтрокаЗачета.СуммаВВалютеПлатежа + СуммаВВалютеПлатежа;
		СтрокаЗачета.ДанныеИзменены = Истина;
		
		Если СтрокаТаблицы.ДоступноКЗачету = 0 Тогда
			ТаблицаФормы.Удалить(СтрокаТаблицы);
		Иначе
			СтрокаТаблицы.ДанныеИзменены = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Зачтено.Сортировать("Организация, Дата");
	
	РассчитатьСуммуЗачета();
	РасчитатьКоличествоСтрок();
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьЗачетНаСервере(СоответствиеСтрок, СуммаСтрокиИзменена = Истина, Отказ = Ложь)
	
	МассивСтрок = Новый Массив;
	Для Каждого ЭлементСтроки Из СоответствиеСтрок Цикл
		МассивСтрок.Добавить(ЭлементСтроки.Ключ);
	КонецЦикла;
	
	Если Не ЗаблокироватьДокументыДляРедактирования(МассивСтрок, "Зачтено") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементСтроки Из СоответствиеСтрок Цикл
		
		СтрокаТаблицы = Зачтено.НайтиПоИдентификатору(ЭлементСтроки.Ключ);
		Если СтрокаТаблицы = Неопределено Или Не СтрокаТаблицы.ДоступноРедактирование Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаКОтмене = ЭлементСтроки.Значение;
		СуммаБазиса  = СтрокаТаблицы.СуммаЗачтено + ?(СуммаСтрокиИзменена, СуммаКОтмене, 0);
		
		Если СуммаКОтмене = 0 Тогда
			СуммаКОтмене = СтрокаТаблицы.СуммаЗачтено;
			СтрокаТаблицы.СуммаЗачтено = 0;
		ИначеЕсли Не СуммаСтрокиИзменена Тогда
			СтрокаТаблицы.СуммаЗачтено = СтрокаТаблицы.СуммаЗачтено - СуммаКОтмене;
		КонецЕсли;
		
		ЭтоОтменаАванса = Не ЗначениеЗаполнено(СтрокаТаблицы.Документ)
			Или ТипЗнч(СтрокаТаблицы.Документ) = Тип("ДокументСсылка.ВзаимозачетЗадолженности");
		
		Если ЭтоОтменаАванса Тогда
			
			СтруктураПоиска = Новый Структура("Документ, Партнер, Заказ");
			ТаблицаПоиска = Авансы;
			
		Иначе
			
			СтруктураПоиска = Новый Структура("Документ, Партнер, СтатьяДвиженияДенежныхСредств");
			ТаблицаПоиска = Оплаты;
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
		
		НайденныеСтроки = ТаблицаПоиска.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаОплаты = ТаблицаПоиска.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОплаты, СтрокаТаблицы, , "СуммаВВалютеПлатежа");
		Иначе
			СтрокаОплаты = НайденныеСтроки[0];
		КонецЕсли;
		
		СтрокаОплаты.ДоступноКЗачету = СтрокаОплаты.ДоступноКЗачету + СуммаКОтмене;
		
		СуммаКОтменеВВалютеПлатежа = ВзаиморасчетыСервер.СписатьСуммуПропорционально(
			СтрокаТаблицы.СуммаВВалютеПлатежа,
			СуммаКОтмене,
			СуммаБазиса);
		
		Если Не ЭтоОтменаАванса Тогда
			СтрокаОплаты.СуммаВВалютеПлатежа = СуммаКОтменеВВалютеПлатежа;
		КонецЕсли;
		
		Если СтрокаТаблицы.СуммаЗачтено = 0 Тогда
			Зачтено.Удалить(СтрокаТаблицы);
			СтрокаОплаты.ДанныеИзменены = Истина;
		Иначе
			СтрокаТаблицы.ДанныеИзменены = Истина;
			СтрокаОплаты.ДанныеИзменены = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Оплаты.Сортировать("Организация, Дата");
	Авансы.Сортировать("Организация, Порядок");
	
	РассчитатьСуммуЗачета();
	РасчитатьКоличествоСтрок();
	
КонецПроцедуры

&НаСервере
Процедура ИсправитьПревышениеНаСервере(Отказ)
	
	СуммаКРаспределению = Превышение;
	
	СоответствиеСписания = Новый Соответствие;
	
	РазмерТаблицы = Зачтено.Количество();
	
	Для Сч = 1 По РазмерТаблицы Цикл
		
		СтрокаТаблицы = Зачтено[РазмерТаблицы - Сч];
		
		Если Не СтрокаТаблицы.ДоступноРедактирование Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.СуммаЗачтено < 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаКОтмене = Мин(СтрокаТаблицы.СуммаЗачтено, СуммаКРаспределению);
		СуммаКРаспределению = СуммаКРаспределению - СуммаКОтмене;
		
		СоответствиеСписания.Вставить(СтрокаТаблицы.ПолучитьИдентификатор(), СуммаКОтмене);
		
		Если СуммаКРаспределению = 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ОтменитьЗачетНаСервере(СоответствиеСписания, Ложь, Отказ);
	
КонецПроцедуры

&НаСервере
Функция ЗаблокироватьДокументыДляРедактирования(МассивСтрок, ИмяТаблицы)
	
	Отказ = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаФормы = ЭтаФорма[ИмяТаблицы];
	
	Для Каждого ИдентификаторСтроки Из МассивСтрок Цикл
		
		СтрокаТаблицы = ТаблицаФормы.НайтиПоИдентификатору(ИдентификаторСтроки);
		ИндексСтроки = ТаблицаФормы.Индекс(СтрокаТаблицы);
		
		Если СтрокаТаблицы = Неопределено
			Или СтрокаТаблицы.ДанныеИзменены Или Не ЗначениеЗаполнено(СтрокаТаблицы.Документ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.ВерсияДанных <> ВерсияДанныхДокумента(СтрокаТаблицы.Документ) Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось заблокировать %1. Данные были изменены или удалены другим пользователем.';uk='Не вдалося заблокувати %1. Дані були змінені або вилучені іншим користувачем.'"),
				СтрокаТаблицы.Документ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				, // КлючДанных
				ИмяТаблицы + "[" + (ИндексСтроки) + "].Документ");
			Отказ = Истина;
			Продолжить;
			
		КонецЕсли;
		
		ИзменениеЗапрещено = ДатыЗапретаИзменения.ИзменениеЗапрещено(
			ОбщегоНазначения.ИмяТаблицыПоСсылке(СтрокаТаблицы.Документ),
			СтрокаТаблицы.Документ, Ложь);
		
		Если ИзменениеЗапрещено Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось изменить %1. Документ находится в запрещенном для изменения периоде.';uk='Не вдалося змінити %1. Документ знаходиться у забороненому для зміни періоді.'"),
				СтрокаТаблицы.Документ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				, // КлючДанных
				ИмяТаблицы + "[" + (ИндексСтроки) + "].Документ");
			Отказ = Истина;
			Продолжить;
			
		КонецЕсли;
		
		Попытка
			ЗаблокироватьДанныеДляРедактирования(
				СтрокаТаблицы.Документ,
				,// ВерсияДанных
				УникальныйИдентификатор);
		Исключение
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось заблокировать %1. %2';uk='Не вдалося заблокувати %1. %2'"),
				СтрокаТаблицы.Документ,
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				, // КлючДанных
				ИмяТаблицы + "[" + (ИндексСтроки) + "].Документ");
			Отказ = Истина;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Не Отказ;
	
КонецФункции

#КонецОбласти

#Область ЗаписьИзменений

&НаКлиенте
Процедура СохранитьРезультатЗачетаОплатыИЗакрыть()
	
	Перем МассивОбработанныхДокументов;
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	
	ЗаписатьИзмененияНаСервере(МассивОбработанныхДокументов, Отказ);
	
	ОповеститьОРезультатеЗачетаОплаты(МассивОбработанныхДокументов);
	Оповестить("ЗачтенаОплата", Документ);
	
	Если Не Отказ Тогда
		ПринудительноЗакрытьФорму = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНаСервере(МассивОбработанныхДокументов, Отказ)
	
	МассивОбработанныхДокументов = Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивТаблиц = Новый Массив;
	МассивТаблиц.Добавить("Авансы");
	МассивТаблиц.Добавить("Оплаты");
	МассивТаблиц.Добавить("Зачтено");
	
	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		
		ТаблицаФормы = ЭтаФорма[ИмяТаблицы];
		
		Для Каждого СтрокаТаблицы Из ТаблицаФормы Цикл
		
			Если Не СтрокаТаблицы.ДанныеИзменены Тогда
				Продолжить;
			КонецЕсли;
			
			НачатьТранзакцию();
			
			ИндексСтроки = ТаблицаФормы.Индекс(СтрокаТаблицы);
			ПолеОшибки = ИмяТаблицы + "[" + (ИндексСтроки) + "].Документ";
			
			ДанныеДокумента = Новый Структура("Организация, Партнер, СтатьяДвиженияДенежныхСредств, Валюта");
			ДанныеКор       = Новый Структура("Партнер, Заказ, ВалютаВзаиморасчетов, Организация");
			Суммы           = Новый Структура("СуммаЗачтено, СуммаВВалютеПлатежа");
			ЗаполнитьЗначенияСвойств(ДанныеДокумента, СтрокаТаблицы);
			ЗаполнитьЗначенияСвойств(ДанныеКор, СтрокаТаблицы);
			ЗаполнитьЗначенияСвойств(Суммы, СтрокаТаблицы);
			
			Если ИмяТаблицы = "Оплаты" Тогда
				
				Суммы.СуммаЗачтено = 0;
				
				ОтразитьЗачетОплатыВДокументе(
					СтрокаТаблицы.Документ,
					ДанныеДокумента,
					Суммы,
					ПолеОшибки,
					Отказ);
				
			ИначеЕсли ИмяТаблицы = "Авансы" Тогда
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.Документ) Тогда
					
					Суммы.СуммаЗачтено = 0;
					
					ПолеОшибки = ИмяТаблицы + "[" + (ИндексСтроки) + "].Заказ";
					ОтразитьЗачетАвансаВДокументе(
						СтрокаТаблицы.Документ,
						ДанныеКор,
						Суммы,
						ПолеОшибки,
						Отказ);
					
				КонецЕсли;
				
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТаблицы.Документ) Тогда
				
				СоздатьВзаимозачетЗадолженности(ДанныеКор, Суммы, ПолеОшибки, Отказ);
				
			ИначеЕсли ТипЗнч(СтрокаТаблицы.Документ) = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
				
				ОтразитьЗачетАвансаВДокументе(
					СтрокаТаблицы.Документ,
					ДанныеКор,
					Суммы,
					ПолеОшибки,
					Отказ);
				
			Иначе
				
				ОтразитьЗачетОплатыВДокументе(
					СтрокаТаблицы.Документ,
					ДанныеДокумента,
					Суммы,
					ПолеОшибки,
					Отказ);
				
			КонецЕсли;
			
			Если Отказ Тогда
				ОтменитьТранзакцию();
			Иначе
				ЗафиксироватьТранзакцию();
				МассивОбработанныхДокументов.Добавить(СтрокаТаблицы.Документ);
				СтрокаТаблицы.ДанныеИзменены = Ложь;
			КонецЕсли;
			
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Восстановим последовательность расчетов с партнером.
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|ГДЕ
	|	АналитикаПоПартнерам.Организация В (&Организация)
	|	И АналитикаПоПартнерам.Партнер В (&Партнер)
	|	И АналитикаПоПартнерам.Контрагент = &Контрагент
	|");
	Запрос.УстановитьПараметр("Организация", ДоступныеОрганизации);
	Запрос.УстановитьПараметр("Партнер",     ДоступныеПартнеры);
	Запрос.УстановитьПараметр("Контрагент",  Контрагент);
	
	ТаблицаАналитик = Запрос.Выполнить().Выгрузить();
	МассивАналитикУчетаПоПартнерам = ТаблицаАналитик.ВыгрузитьКолонку("КлючАналитики");
	
	Если ЕстьРасчетыСКлиентами Тогда
		КонецРасчета = КонецМесяца(ТекущаяДатаСеанса())+1;
		РаспределениеВзаиморасчетов.РаспределитьВсеРасчетыСКлиентами(КонецРасчета, МассивАналитикУчетаПоПартнерам);
	КонецЕсли;
	Если ЕстьРасчетыСПоставщиками Тогда
		КонецРасчета = КонецМесяца(ТекущаяДатаСеанса())+1;
		РаспределениеВзаиморасчетов.РаспределитьВсеРасчетыСПоставщиками(КонецРасчета, МассивАналитикУчетаПоПартнерам);
	КонецЕсли;
	
	РазблокироватьДокументыДляРедактирования();
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОтразитьЗачетОплатыВДокументе(ДокументСсылка, ДанныеДокумента, СтруктураСумм, ПолеОшибки, Отказ)
	
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	
	ЭтоАвансовыйОтчет = (ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.АвансовыйОтчет"));
	ЭтоВводОстатков = (ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВводОстатков"));
	Если ЭтоАвансовыйОтчет Тогда
		ИмяТабличнойЧасти = "ОплатаПоставщикам";
	ИначеЕсли ЭтоВводОстатков Тогда
		Если ЕстьРасчетыМеждуОрганизациями Тогда
			ИмяТабличнойЧасти = "РасчетыМеждуОрганизациями";
		Иначе
			ИмяТабличнойЧасти = "РасчетыСПартнерами";
		КонецЕсли;
	Иначе
		ИмяТабличнойЧасти = "РасшифровкаПлатежа";
	КонецЕсли;
	
	ТаблицаРасшифровкаПлатежа = ДокументОбъект[ИмяТабличнойЧасти].Выгрузить();
	Колонки = ТаблицаРасшифровкаПлатежа.Колонки;
	
	Если Колонки.Найти("СуммаВзаиморасчетов") = Неопределено Тогда
		Колонки.Добавить("СуммаВзаиморасчетов", Новый ОписаниеТипов("Число"));
	КонецЕсли;
	Если Колонки.Найти("Заказ") = Неопределено Тогда
		Колонки.Добавить("Заказ");
	КонецЕсли;
	
	Если ЭтоВводОстатков Тогда
		
		МассивОбъектовРасчетов = ТаблицаРасшифровкаПлатежа.ВыгрузитьКолонку("РасчетныйДокумент");
		ТаблицаРасшифровкаПлатежа.ЗагрузитьКолонку(МассивОбъектовРасчетов, "Заказ");
		
		МассивСумм = ТаблицаРасшифровкаПлатежа.ВыгрузитьКолонку("Сумма");
		ТаблицаРасшифровкаПлатежа.ЗагрузитьКолонку(МассивСумм, "СуммаВзаиморасчетов");
		
	КонецЕсли;
	
	ЕстьКолонкаПартнер = Ложь;
	ЕстьКолонкаПоставщик = Ложь;
	
	СтруктураОтбор = Новый Структура;
	Если Колонки.Найти("Партнер") <> Неопределено И (Партнер <> Справочники.Партнеры.НашеПредприятие) Тогда
		СтруктураОтбор.Вставить("Партнер", ДанныеДокумента.Партнер);
		ЕстьКолонкаПартнер = Истина;
	КонецЕсли;
	Если Колонки.Найти("СтатьяДвиженияДенежныхСредств") <> Неопределено Тогда
		СтруктураОтбор.Вставить("СтатьяДвиженияДенежныхСредств", ДанныеДокумента.СтатьяДвиженияДенежныхСредств);
	КонецЕсли;
	Если Колонки.Найти("Поставщик") <> Неопределено Тогда
		СтруктураОтбор.Вставить("Поставщик", ДанныеДокумента.Партнер);
		ЕстьКолонкаПоставщик = Истина;
	КонецЕсли;
	Если Колонки.Найти("Контрагент") <> Неопределено Тогда
		СтруктураОтбор.Вставить("Контрагент", Контрагент);
	КонецЕсли;
	Если ЭтоВводОстатков Тогда
		СтруктураОтбор.Вставить("ВалютаВзаиморасчетов", ДанныеДокумента.Валюта);
	КонецЕсли;
	
	ЕстьОснованиеПлатежа = (Колонки.Найти("ОснованиеПлатежа") <> Неопределено);
	
	Если СтруктураОтбор.Количество() = 0 Тогда
		МассивСтрок = Новый Массив;
		Для каждого СтрокаРасшифровки Из ТаблицаРасшифровкаПлатежа Цикл
			МассивСтрок.Добавить(СтрокаРасшифровки);
		КонецЦикла;
	Иначе
		МассивСтрок = ТаблицаРасшифровкаПлатежа.НайтиСтроки(СтруктураОтбор);
	КонецЕсли;
	
	ДанныеИзменены = Ложь;
	
	Для Каждого СтрокаДокумента Из МассивСтрок Цикл
		
		Если СтруктураСумм.СуммаЗачтено = 0 Тогда
		
			Если СтрокаДокумента.Заказ = ОбъектРасчетов Тогда
				
				СтрокаДокумента.Заказ = Неопределено;
				Если ЕстьОснованиеПлатежа Тогда
					СтрокаДокумента.ОснованиеПлатежа = Неопределено;
				КонецЕсли;
				ДанныеИзменены = Истина;
				
			КонецЕсли;
			
		ИначеЕсли СтрокаДокумента.Заказ = ОбъектРасчетов
			Или СтрокаДокумента.Заказ = Договор
			Или Не ЗначениеЗаполнено(СтрокаДокумента.Заказ) Тогда
			
			СуммаСтрокиДокумента = СтрокаДокумента.Сумма;
			СуммаВВалютеПлатежа  = СтруктураСумм.СуммаВВалютеПлатежа;
			
			Списано = ВзаиморасчетыСервер.СписатьСумму(СтрокаДокумента.Сумма, СтруктураСумм.СуммаВВалютеПлатежа);
			
			Если ВалютаВзаиморасчетов = СтрокаДокумента.ВалютаВзаиморасчетов Тогда
				СписаноВВалютеВзаиморасчетов = ВзаиморасчетыСервер.СписатьСумму(
					СтрокаДокумента.СуммаВзаиморасчетов,
					СтруктураСумм.СуммаЗачтено);
			Иначе
				
				ВзаиморасчетыСервер.СписатьСуммуПропорционально(
					СтрокаДокумента.СуммаВзаиморасчетов,
					Списано,
					СуммаСтрокиДокумента);
					
				СписаноВВалютеВзаиморасчетов = ВзаиморасчетыСервер.СписатьСуммуПропорционально(
					СтруктураСумм.СуммаЗачтено,
					Списано,
					СуммаВВалютеПлатежа);
				
			КонецЕсли;
			
			СписаноРегл = 0;
			Если ЭтоВводОстатков Тогда
				СуммаСписаноРегл = ВзаиморасчетыСервер.СписатьСуммуПропорционально(
					СтрокаДокумента.СуммаРегл,
					Списано,
					СуммаСтрокиДокумента);
			КонецЕсли;
			
			Если СуммаСтрокиДокумента = Списано Тогда
				СтрокаОплаты = СтрокаДокумента;
			Иначе
				СтрокаОплаты = ТаблицаРасшифровкаПлатежа.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаОплаты, СтрокаДокумента);
				Если СтрокаДокумента.Заказ = ОбъектРасчетов Тогда
					СтрокаДокумента.Заказ = Неопределено;
					Если ЕстьОснованиеПлатежа Тогда
						СтрокаДокумента.ОснованиеПлатежа = Неопределено;
					КонецЕсли;
				КонецЕсли;
				ДанныеИзменены = Истина;
			КонецЕсли;
			
			СтрокаОплаты.Сумма = Списано;
			СтрокаОплаты.СуммаВзаиморасчетов = СписаноВВалютеВзаиморасчетов;
			Если ЭтоВводОстатков Тогда
				СтрокаОплаты.СуммаРегл = СуммаСписаноРегл;
			КонецЕсли;
			
			Если СтрокаОплаты.ВалютаВзаиморасчетов <> ВалютаВзаиморасчетов Тогда
				СтрокаОплаты.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
				ДанныеИзменены = Истина;
			КонецЕсли;
			
			Если СтрокаОплаты.Заказ <> ОбъектРасчетов Тогда
				СтрокаОплаты.Заказ = ОбъектРасчетов;
				ДанныеИзменены = Истина;
			КонецЕсли;
			
			Если ДанныеДокумента.Партнер <> Партнер Тогда
				Если ЕстьКолонкаПартнер Тогда
					СтрокаОплаты.Партнер = Партнер;
					ДанныеИзменены = Истина;
				КонецЕсли;
				Если ЕстьКолонкаПоставщик Тогда
					СтрокаОплаты.Поставщик = Партнер;
					ДанныеИзменены = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если ЕстьОснованиеПлатежа И Не ЗначениеЗаполнено(СтрокаОплаты.ОснованиеПлатежа) Тогда
				СтрокаОплаты.ОснованиеПлатежа = СтрокаОплаты.Заказ;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеИзменены Тогда
		
		ИменаКолонок = "";
		МассивИсключаемыхКолонок = Новый Массив;
		МассивИсключаемыхКолонок.Добавить("НомерСтроки");
		МассивИсключаемыхКолонок.Добавить("ИдентификаторСтроки");
		МассивИсключаемыхКолонок.Добавить("Сумма");
		МассивИсключаемыхКолонок.Добавить("СуммаВзаиморасчетов");
		МассивИсключаемыхКолонок.Добавить("СуммаРегл");
		Для Каждого Колонка Из Колонки Цикл
			Если МассивИсключаемыхКолонок.Найти(Колонка.Имя) = Неопределено Тогда
				ИменаКолонок = ИменаКолонок + Колонка.Имя + ",";
			КонецЕсли;
		КонецЦикла;
		ИменаКолонок = Лев(ИменаКолонок, СтрДлина(ИменаКолонок) - 1);
		ИменаКолонокСуммирования = "Сумма, СуммаВзаиморасчетов";
		Если ЭтоВводОстатков Тогда
			ИменаКолонокСуммирования = ИменаКолонокСуммирования + ", СуммаРегл";
		КонецЕсли;
		
		ТаблицаРасшифровкаПлатежа.Свернуть(ИменаКолонок, ИменаКолонокСуммирования);
		ТаблицаРасшифровкаПлатежа.Сортировать("Заказ");
		
		Если ЭтоВводОстатков Тогда
			
			МассивОбъектовРасчетов = ТаблицаРасшифровкаПлатежа.ВыгрузитьКолонку("Заказ");
			ТаблицаРасшифровкаПлатежа.ЗагрузитьКолонку(МассивОбъектовРасчетов, "РасчетныйДокумент");
			
			МассивСумм = ТаблицаРасшифровкаПлатежа.ВыгрузитьКолонку("СуммаВзаиморасчетов");
			ТаблицаРасшифровкаПлатежа.ЗагрузитьКолонку(МассивСумм, "Сумма");
			
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектРасчетов, "Дата, Номер");
			
			Для Каждого СтрокаТаблицы Из ТаблицаРасшифровкаПлатежа Цикл
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.РасчетныйДокумент)
				 И Не ЗначениеЗаполнено(СтрокаТаблицы.НомерРасчетногоДокумента) Тогда
					СтрокаТаблицы.НомерРасчетногоДокумента = ЗначенияРеквизитов.Номер;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.РасчетныйДокумент)
				 И Не ЗначениеЗаполнено(СтрокаТаблицы.ДатаРасчетногоДокумента) Тогда
					СтрокаТаблицы.ДатаРасчетногоДокумента = ЗначенияРеквизитов.Дата;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.РасчетныйДокумент) Тогда
					СтрокаТаблицы.НомерРасчетногоДокумента = "";
					СтрокаТаблицы.ДатаРасчетногоДокумента = Дата(1,1,1);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ДокументОбъект[ИмяТабличнойЧасти].Загрузить(ТаблицаРасшифровкаПлатежа);
		Если ДокументОбъект.ПроверитьЗаполнение() Тогда
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Не удалось записать документ %1. %2';uk='Не вдалося записати документ %1. %2'"),
					ДокументСсылка,
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , ПолеОшибки, , Отказ);
			КонецПопытки;
		Иначе
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось записать документ %1';uk='Не вдалося записати документ %1'"),
				ДокументСсылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , ПолеОшибки, , Отказ);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтразитьЗачетАвансаВДокументе(ДокументВзаимозачета, ДанныеКор, СтруктураСумм, ПолеОшибки, Отказ)
	
	ДокументОбъект = ДокументВзаимозачета.ПолучитьОбъект();
	
	КорСтруктураСумм = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураСумм);
	
	ОтборЗачета = Новый Структура;
	ОтборЗачета.Вставить("ТипРасчетов", 
		?(ЕстьРасчетыСКлиентами, 
		Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом,
		Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком));
	ОтборЗачета.Вставить("Партнер", Партнер);
	ОтборЗачета.Вставить("Заказ", ОбъектРасчетов);
	
	ОтборАванса = Новый Структура;
	ОтборАванса.Вставить("ТипРасчетов", ОтборЗачета.ТипРасчетов);
	ОтборАванса.Вставить("Партнер", ДанныеКор.Партнер);
	ОтборАванса.Вставить("Заказ", ДанныеКор.Заказ);
	
	ДебиторскаяЗадолженность = ДокументОбъект.ДебиторскаяЗадолженность.Выгрузить();
	
	МассивСтрок = ДебиторскаяЗадолженность.НайтиСтроки(?(ЕстьРасчетыСКлиентами, ОтборЗачета, ОтборАванса));
	
	Для Каждого СтрокаДокумента Из МассивСтрок Цикл
		
		Если СтруктураСумм.СуммаЗачтено = 0 Тогда
			ДебиторскаяЗадолженность.Удалить(СтрокаДокумента);
		Иначе
			
			Если СтруктураСумм.СуммаВВалютеПлатежа < СтрокаДокумента.Сумма Тогда
				
				СтрокаДокумента.Сумма = СтруктураСумм.СуммаВВалютеПлатежа;
				СтрокаДокумента.СуммаВзаиморасчетов = СтруктураСумм.СуммаЗачтено;
				
			Иначе
				
				СтрокаДокумента.СуммаВзаиморасчетов = 
					Окр(СтрокаДокумента.Сумма * СтруктураСумм.СуммаЗачтено / СтруктураСумм.СуммаВВалютеПлатежа, 2);
				
			КонецЕсли;
			
			СтрокаДокумента.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
			
			СтруктураСумм.СуммаВВалютеПлатежа = СтруктураСумм.СуммаВВалютеПлатежа - СтрокаДокумента.Сумма;
			СтруктураСумм.СуммаЗачтено = СтруктураСумм.СуммаЗачтено - СтрокаДокумента.СуммаВзаиморасчетов;
		КонецЕсли;
	КонецЦикла;
	
	КредиторскаяЗадолженность = ДокументОбъект.КредиторскаяЗадолженность.Выгрузить();
	
	МассивСтрок = КредиторскаяЗадолженность.НайтиСтроки(?(ЕстьРасчетыСКлиентами, ОтборАванса, ОтборЗачета));
	
	Для Каждого СтрокаДокумента Из МассивСтрок Цикл
		
		Если КорСтруктураСумм.СуммаЗачтено = 0 Тогда
			КредиторскаяЗадолженность.Удалить(СтрокаДокумента);
		Иначе
			
			СуммаСтрокиДокумента = СтрокаДокумента.Сумма;
			СуммаВВалютеПлатежа = КорСтруктураСумм.СуммаВВалютеПлатежа;
			
			Если КорСтруктураСумм.СуммаВВалютеПлатежа < СтрокаДокумента.Сумма Тогда
				СтрокаДокумента.Сумма = КорСтруктураСумм.СуммаВВалютеПлатежа;
			КонецЕсли;
			
			СуммаСписано = СуммаСтрокиДокумента - СтрокаДокумента.Сумма;
			
			ВзаиморасчетыСервер.СписатьСуммуПропорционально(
				СтрокаДокумента.СуммаВзаиморасчетов,
				СуммаСписано,
				СуммаСтрокиДокумента);
				
			КорСтруктураСумм.СуммаВВалютеПлатежа = КорСтруктураСумм.СуммаВВалютеПлатежа - СтрокаДокумента.Сумма;
			
			ВзаиморасчетыСервер.СписатьСуммуПропорционально(
				КорСтруктураСумм.СуммаЗачтено,
				СуммаВВалютеПлатежа - КорСтруктураСумм.СуммаВВалютеПлатежа,
				СуммаВВалютеПлатежа);
		КонецЕсли;
	КонецЦикла;
	
	ДокументОбъект.ДебиторскаяЗадолженность.Загрузить(ДебиторскаяЗадолженность);
	ДокументОбъект.КредиторскаяЗадолженность.Загрузить(КредиторскаяЗадолженность);
	
	ДокументОбъект.СуммаДокумента = ДебиторскаяЗадолженность.Итог("Сумма");
	
	Если КредиторскаяЗадолженность.Количество() = 0
		И ДебиторскаяЗадолженность.Количество() = 0 Тогда
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ДокументОбъект.УстановитьПометкуУдаления(Истина);
		Исключение
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось записать документ %1. %2';uk='Не вдалося записати документ %1. %2'"),
				ДокументВзаимозачета,
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , ПолеОшибки, , Отказ);
		КонецПопытки;
		
	ИначеЕсли ДокументОбъект.ПроверитьЗаполнение() Тогда
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось записать документ %1. %2';uk='Не вдалося записати документ %1. %2'"),
				ДокументВзаимозачета,
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , ПолеОшибки, , Отказ);
		КонецПопытки;
	Иначе
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не удалось записать документ %1';uk='Не вдалося записати документ %1'"),
			ДокументВзаимозачета);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , ПолеОшибки, , Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьВзаимозачетЗадолженности(ДанныеКор, СтруктураСумм, ПолеОшибки, Отказ)
	
	Сумма = СтруктураСумм.СуммаЗачтено;
	
	ДокументОбъект = Документы.ВзаимозачетЗадолженности.СоздатьДокумент();
	Если ЗначениеЗаполнено(Документ) Тогда
		ДокументОбъект.Дата = КонецДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Дата"));
	Иначе
		ДокументОбъект.Дата = ТекущаяДата();
	КонецЕсли;
	ДокументОбъект.ДокументОснование = Документ;
	
	ДокументОбъект.Комментарий = НСтр("ru='Сформирован автоматически обработкой ""Зачет оплат"".';uk='Сформований автоматично обробкою ""Залік оплат"".'");
	
	ТипКонтрагента = Неопределено;
	Если ЕстьРасчетыМеждуОрганизациями Тогда
		
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийВзаимозачетаЗадолженности.Произвольный;
		ТипКонтрагента = ?(ЕстьРасчетыСКлиентами,
			Перечисления.ТипыУчастниковВзаимозачета.ОрганизацияКлиент,
			Перечисления.ТипыУчастниковВзаимозачета.ОрганизацияПоставщик);
			
	ИначеЕсли ЕстьРасчетыСКлиентами Тогда
		ДокументОбъект.ВидОперации  = Перечисления.ВидыОперацийВзаимозачетаЗадолженности.Клиента;
		ТипКонтрагента = Перечисления.ТипыУчастниковВзаимозачета.Клиент;
	Иначе //РасчетыСПоставщиками
		ДокументОбъект.ВидОперации  = Перечисления.ВидыОперацийВзаимозачетаЗадолженности.Поставщика;
		ТипКонтрагента = Перечисления.ТипыУчастниковВзаимозачета.Поставщик;
	КонецЕсли;
	
	Если ДанныеКор.Организация <> Организация Тогда
		ДокументОбъект.Организация    = ГоловнаяОрганизация;
	Иначе
		ДокументОбъект.Организация    = Организация;
	КонецЕсли;
	
	ДокументОбъект.КонтрагентКредитор = Контрагент;
	ДокументОбъект.КонтрагентДебитор  = Контрагент;
	ДокументОбъект.ТипДебитора        = ТипКонтрагента;
	ДокументОбъект.ТипКредитора       = ТипКонтрагента;
	ДокументОбъект.Валюта             = ВалютаВзаиморасчетов;
	ДокументОбъект.СуммаДокумента     = Сумма;
	
	Если ЕстьРасчетыСКлиентами Тогда
		СтрокаАванса = ДокументОбъект.ДебиторскаяЗадолженность.Добавить();
		СтрокаЗачета = ДокументОбъект.КредиторскаяЗадолженность.Добавить();
	Иначе
		СтрокаАванса = ДокументОбъект.КредиторскаяЗадолженность.Добавить();
		СтрокаЗачета = ДокументОбъект.ДебиторскаяЗадолженность.Добавить();
	КонецЕсли;
	
	СтрокаАванса.Организация          = Организация;
	СтрокаАванса.Партнер              = Партнер;
	СтрокаАванса.Заказ                = ОбъектРасчетов;
	СтрокаАванса.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
	СтрокаАванса.Сумма                = Сумма;
	СтрокаАванса.СуммаВзаиморасчетов  = Сумма;
	
	ЗаполнитьЗначенияСвойств(СтрокаЗачета, ДанныеКор);
	СтрокаЗачета.Сумма               = Сумма;
	СтрокаЗачета.СуммаВзаиморасчетов = СтруктураСумм.СуммаВВалютеПлатежа;
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не удалось создать документ взаимозачета. %1';uk='Не вдалося створити документ взаємозаліку. %1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , ПолеОшибки, , Отказ);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОРезультатеЗачетаОплаты(МассивОбработанныхДокументов)
	
	Если МассивОбработанныхДокументов.Количество() = 0 Тогда
		Текст = НСтр("ru='Изменений в зачете оплаты не было';uk='Змін в заліку оплати не було'");
		Пояснение = НСтр("ru='Изменений в документах при зачете оплаты не было';uk='Змін у документах при заліку оплати не було'");
		ПоказатьОповещениеПользователя(
			Текст,
			, // НавигационнаяСсылка
			Пояснение,
			БиблиотекаКартинок.Информация32);
	Иначе
		Для Каждого ДокументСсылка Из МассивОбработанныхДокументов Цикл
			Текст = НСтр("ru='Изменен зачет оплаты';uk='Змінено залік оплати'");
			Пояснение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Изменен зачет оплаты по документу: %1';uk='Змінено залік оплати за документом: %1'"),
				ДокументСсылка);
			ПоказатьОповещениеПользователя(
				Текст,
				ПолучитьНавигационнуюСсылку(ДокументСсылка),
				Пояснение,
				БиблиотекаКартинок.Информация32);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РазблокироватьДокументыДляРедактирования()
	
	Попытка
		РазблокироватьДанныеДляРедактирования(
			, // Ключ
			УникальныйИдентификатор);
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	
	РазблокироватьДокументыДляРедактирования();
	ЗаполнитьТаблицуПоРасчетамСПартнерами();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуЗачета()
	
	СуммаЗачета = Зачтено.Итог("СуммаЗачтено");
	
	Если СуммаЗачета < СуммаВзаиморасчетов Тогда
		Недостает = СуммаВзаиморасчетов - СуммаЗачета;
		Превышение = 0;
	Иначе
		Недостает = 0;
		Превышение = СуммаЗачета - СуммаВзаиморасчетов;
	КонецЕсли;
	
	Элементы.ИсправитьПревышение.Видимость = (Превышение > 0);
	
	ОбновитьИнформационнуюНадписьИтогов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформационнуюНадписьИтогов()
	
	МассивСтрок = Новый Массив;
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Сумма к оплате %1 %2.';uk='Сума до сплати %1 %2.'"),
		Формат(СуммаВзаиморасчетов, "ЧДЦ=2; ЧРД=; ЧН="),
		ВалютаВзаиморасчетов)));
	
	МассивСтрок.Добавить("   ");
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Зачтено на сумму %1 %2.';uk='Зараховано на суму %1 %2.'"),
		Формат(СуммаЗачета, "ЧДЦ=2; ЧРД=; ЧН="),
		ВалютаВзаиморасчетов)));
	
	Если Недостает > 0 Тогда
		
		МассивСтрок.Добавить("   ");
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Недостает %1 %2.';uk='Бракує %1 %2.'"),
			Формат(Недостает, "ЧДЦ=2; ЧРД=; ЧН="),
			ВалютаВзаиморасчетов);
		
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Текст, , ЦветаСтиля.ПросроченныеДанныеЦвет));
		
	ИначеЕсли Превышение > 0 Тогда
		
		МассивСтрок.Добавить("   ");
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Превышение на %1 %2.';uk='Перевищення на %1 %2.'"),
			Формат(Превышение, "ЧДЦ=2; ЧРД=; ЧН="),
			ВалютаВзаиморасчетов);
			
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Текст, , ЦветаСтиля.ПросроченныеДанныеЦвет));
		
	КонецЕсли;
	
	ИнформационнаяНадпись = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьИнформационнуюНадписьОтборы()
	
	НадписьОтборы = НСтр("ru='%Организация%, %Партнер%, %Контрагент%, %Договор%';uk='%Организация%, %Партнер%, %Контрагент%, %Договор%'");
	
	Если Не ИспользоватьДоговоры Тогда
		НадписьОтборы = СтрЗаменить(НадписьОтборы, ", %Договор%", "");
	КонецЕсли;
	
	Если ИспользоватьПартнеровКакКонтрагентов Тогда
		НадписьОтборы = СтрЗаменить(НадписьОтборы, ", %Контрагент%", "");
	КонецЕсли;
	
	Если Не ИспользоватьНесколькоОрганизаций Тогда
		НадписьОтборы = СтрЗаменить(НадписьОтборы, "%Организация%,", "");
	КонецЕсли;
	
	НадписьОтборы = СтрЗаменить(НадписьОтборы,"%Организация%",
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Организация: %1';uk='Організація: %1'"), Организация));
	НадписьОтборы = СтрЗаменить(НадписьОтборы,"%Партнер%",
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Партнер: %1';uk='Партнер: %1'"), Партнер));
	НадписьОтборы = СтрЗаменить(НадписьОтборы,"%Контрагент%",
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Контрагент: %1';uk='Контрагент: %1'"), Контрагент));
	НадписьОтборы = СтрЗаменить(НадписьОтборы,"%Договор%",
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Договор: %1';uk='Договір: %1'"), Договор));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоДоговорам()
	
	Если Не ИспользоватьДоговоры Или ПоВсемДоговорам = 1 Тогда
		Элементы.Авансы.ОтборСтрок = Неопределено;
	Иначе
		ОтборАвансы = Новый ФиксированнаяСтруктура("Договор", Договор);
		Элементы.Авансы.ОтборСтрок = ОтборАвансы;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПересчитатьСуммуВВалютуВзаиморасчетов(Сумма, ИсходнаяВалюта, Знач ДатаКурса = Неопределено)
	
	Если Не ЗначениеЗаполнено(ДатаКурса) Тогда
		ДатаКурса = ТекущаяДата();
	КонецЕсли;
	
	Результат = РаботаСКурсамиВалютУТ.ПересчитатьСуммуДокументаВВалюту(
		Сумма, ИсходнаяВалюта, ВалютаВзаиморасчетов, ДатаКурса);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура РасчитатьКоличествоСтрок()
	
	ОплатыКоличествоСтрок = Оплаты.Количество();
	АвансыКоличествоСтрок = Авансы.Количество();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
