#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		Результат = УправлениеКонтактнойИнформациейСлужебный.ПроверитьПараметрыВидаКонтактнойИнформации(ЭтотОбъект);
		Если Результат.ЕстьОшибки Тогда
			Отказ = Истина;
			ВызватьИсключение Результат.ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	Если ЭтотОбъект.ПроверятьКорректность И ЭтотОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		ЭтотОбъект.ПроверятьКорректность = Ложь;
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#КонецЕсли