#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы


Процедура КорректироватьДвижения_ДанныеДляОбновления(Параметры) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыЗапасов.Ссылка КАК Ссылка
	|ИЗ 
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями.ВидыЗапасов КАК ВидыЗапасов
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыПереданныеНаКомиссию КАК ТоварыНаКомиссии
	|	ПО ВидыЗапасов.Ссылка = ТоварыНаКомиссии.Регистратор
	|ГДЕ
	|	ВидыЗапасов.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НоменклатураГТД.ПустаяСсылка)
	|	И ТоварыНаКомиссии.НомерГТД = ЗНАЧЕНИЕ(Справочник.НоменклатураГТД.ПустаяСсылка)
	|");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(
        Параметры, 
        Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"), 
        "РегистрНакопления.ТоварыПереданныеНаКомиссию"
    );
	
КонецПроцедуры

// Обработчик обновления BAS УТ 3.2.3.70
// Заполняет в движениях по регистру ""Товары переданные на комиссию"" номенклатуру ГТД.
Процедура КорректироватьДвижения(Параметры) Экспорт
	
	ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(
		"Документ.ОтчетПоКомиссииМеждуОрганизациями",
		"РегистрНакопления.ТоварыПереданныеНаКомиссию",
		Параметры.Очередь
    );
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти

#КонецЕсли