#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает значение параметра учетной политики.
//
// Параметры:
//  УчетнаяПолитика - Справочник - Ссылка на элемент справочника "Учетная политика"
//	ИмяПараметра - Строка - Имя параметра учетной политики, значение которого необходимо получить
//
Функция ПараметрУчетнойПолитики(Знач УчетнаяПолитика, ИмяПараметра) Экспорт
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ИЗ
		|	Справочник.УчетныеПолитикиОрганизаций КАК Данные
		|ГДЕ
		|	Данные.Ссылка = &УчетнаяПолитика");
	
	Запрос.УстановитьПараметр("УчетнаяПолитика", УчетнаяПолитика);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка[ИмяПараметра], Неопределено);
	
КонецФункции

// Функция возвращает значения параметров учетной политики, которые являются параметризируемыми значениями функциональных опций
//		(см. ресурсы регистра сведений "УчетнаяПолитикаОрганизаций")
//
// Параметры:
//  УчетнаяПолитика - Справочник - Ссылка на элемент справочника "Учетная политика"
//
Функция ПараметрыУчетнойПолитики(Знач УчетнаяПолитика) Экспорт
  	
  	Запрос = Новый Запрос;

   Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   Данные.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.НалогНаПрибыльИНДС) ИЛИ Данные.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.НалогНаПрибыль) КАК ПлательщикНалогаНаПрибыль,
	|   Данные.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.НалогНаПрибыльИНДС) 
	|   	ИЛИ Данные.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ЕдиныйНалогИНДС)
	|			И Данные.ГруппаПлательщикаЕдиногоНалога <> ЗНАЧЕНИЕ(Перечисление.ГруппыПлательщиковЕдиногоНалога.ТретьяГруппаОсобая) КАК ПлательщикНДС,	
	|   Данные.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ЕдиныйНалог) ИЛИ Данные.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ЕдиныйНалогИНДС) КАК ПлательщикЕН
  	|ИЗ
  	|	Справочник.УчетныеПолитикиОрганизаций КАК Данные
  	|ГДЕ
  	|	Данные.Ссылка = &УчетнаяПолитика";

  	Запрос.УстановитьПараметр("УчетнаяПолитика", УчетнаяПолитика);
  	
 	Выборка = Запрос.Выполнить().Выбрать();
  	Возврат ?(Выборка.Следующий(), Выборка, Неопределено);
  	
КонецФункции

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("МетодОценкиСтоимостиТоваров");
	Результат.Добавить("СистемаНалогообложения");
	Результат.Добавить("ПроводкиПоРаботникам");
	Результат.Добавить("ФормироватьРезервОтпусковБУ");
	Результат.Добавить("МетодНачисленияРезерваОтпусков");
	Результат.Добавить("НормативОтчисленийВРезервОтпусков");
	Результат.Добавить("ПредельнаяВеличинаОтчисленийВРезервОтпусков");
	Результат.Добавить("ИспользуемыеКлассыСчетовРасходов");
	Результат.Добавить("ГруппаПлательщикаЕдиногоНалога");
	Результат.Добавить("ИнформацияОСтатусеПлательщикаНалогов");
	Результат.Добавить("НалогНаПрибыльБезКорректировокФинансовогоРезультата");
	Результат.Добавить("ВключатьСуммуДооценокОСВСоставНераспределеннойПрибыли");	
	
	Возврат Результат;
	
КонецФункции

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	
	
	
	Если ПолучитьФункциональнуюОпцию("УправлениеТорговлей") Тогда
		Результат.Добавить("ФормироватьРезервОтпусковБУ");
		Результат.Добавить("МетодНачисленияРезерваОтпусков");
		Результат.Добавить("НормативОтчисленийВРезервОтпусков");
		Результат.Добавить("ПредельнаяВеличинаОтчисленийВРезервОтпусков");
		Результат.Добавить("ПроводкиПоРаботникам");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы


#КонецОбласти

#КонецЕсли
