////////////////////////////////////////////////////////////////////////////////
// Подсистема "Управление доступом".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Виды доступа Пользователи и ВнешниеПользователи уже заполнены.
// Их можно удалить, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа.
//                                       Например, Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа.
//                                       Например, Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры), можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Подразделения";
	ВидДоступа.Представление    = НСтр("ru='Подразделения';uk='Підрозділи'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.СтруктураПредприятия");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Склады";
	ВидДоступа.Представление    = НСтр("ru='Склады';uk='Склади'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Склады");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Кассы";
	ВидДоступа.Представление    = НСтр("ru='Кассы';uk='Каси'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Кассы");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "КассыККМ";
	ВидДоступа.Представление    = НСтр("ru='Кассы ККМ';uk='Каси ККМ'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.КассыККМ");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ЭквайринговыеТерминалы";
	ВидДоступа.Представление    = НСтр("ru='Эквайринговые терминалы';uk='Еквайрингові термінали'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ЭквайринговыеТерминалы");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ВидыЦен";
	ВидДоступа.Представление    = НСтр("ru='Виды цен';uk='Види цін'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ВидыЦен");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ХозяйственныеОперации";
	ВидДоступа.Представление = НСтр("ru='Хозяйственные операции';uk='Господарські операції'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ХозяйственныеОперации");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "СоглашенияСКлиентамиЧтение";
	ВидДоступа.Представление = НСтр("ru='Виды соглашений с клиентами (чтение)';uk='Види оферт клієнтам (читання)'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ВидыСоглашенийСКлиентамиДляОграниченияЧтения");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "СоглашенияСКлиентамиИзменение";
	ВидДоступа.Представление = НСтр("ru='Виды соглашений с клиентами (изменение)';uk='Види оферт клієнтам (зміна)'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ВидыСоглашенийСКлиентамиДляОграниченияИзменения");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ГруппыНоменклатуры";
	ВидДоступа.Представление    = НСтр("ru='Группы номенклатуры';uk='Групи номенклатури'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Номенклатура");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаНоменклатуры");
	УправлениеДоступом.ДобавитьДополнительныеТипыВидаДоступа(ВидДоступа,
		Тип("СправочникСсылка.ВидыНоменклатуры"),
		Тип("СправочникСсылка.ГруппыДоступаНоменклатуры"));
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ГруппыПартнеров";
	ВидДоступа.Представление    = НСтр("ru='Группы партнеров';uk='Групи партнерів'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ГруппыФизическихЛиц";
	ВидДоступа.Представление    = НСтр("ru='Группы физических лиц';uk='Групи фізичних осіб'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ФизическиеЛица");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаФизическихЛиц");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ТипыОснованийАктаОРасхождениях";
	ВидДоступа.Представление = НСтр("ru='Типы оснований акта о расхождениях';uk='Типи підстав акта про розбіжності'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ТипыОснованияАктаОРасхождении");

	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ВидыОперацийВзаимозачетаЗадолженности";
	ВидДоступа.Представление = НСтр("ru='Виды операций взаимозачета задолженности';uk='Види операцій взаємозаліку заборгованості'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ВидыОперацийВзаимозачетаЗадолженности");

КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив - массив структур, в который нужно добавить описания.
//                        Пустая структура должна быть получена при помощи функции.
//                        УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
//  ПараметрыОбновления - Структура - структура со свойствами:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа который был удален из профиля, будут также удалены из групп доступа.
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	УправлениеДоступомУТ.ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	НСИССервер.ЗаполнитьПоставляемыеПрофилиПользователей(ОписанияПрофилей);
	
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта, например, задачи ЗадачаИсполнителя,
// от "ведущего" объекта, например,  бизнес-процесса Задание, которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект":
// 1) стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта
//    и проверяется отсутствие ограничения чтения "ведущего" объекта;
// 2) стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта
//    и проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным:
// в пункте "2)" вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений - с колонками:
//   * ВедущаяТаблица     - Строка - например, Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например, Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов, указанных типов.
// 
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений - с колонками, описание которых см. в комментарии
//                   к функции РегистрыСведений.НастройкиПравОбъектов.ВозможныеПрава().
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
	УпрощенныйИнтерфейс = ПолучитьФункциональнуюОпцию("БазоваяВерсия");
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВидДоступа = "ГруппыНоменклатуры" Тогда
		
		Использование = Константы.ИспользоватьГруппыДоступаНоменклатуры.Получить();
		
	ИначеЕсли ВидДоступа = "ГруппыПартнеров" Тогда
		
		Использование = Константы.ИспользоватьГруппыДоступаПартнеров.Получить();
		
	ИначеЕсли ВидДоступа = "ГруппыФизическихЛиц" Тогда
		
		ИмяКонстанты = "ОграничиватьДоступНаУровнеЗаписейФизическиеЛица";
		Если Метаданные.Константы.Найти(ИмяКонстанты) <> Неопределено Тогда
			Использование = Константы[ИмяКонстанты].Получить();
		Иначе
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Справочник.ГруппыДоступаФизическихЛиц");
			Использование = НЕ Запрос.Выполнить().Пустой();
		КонецЕсли;
		
	ИначеЕсли ВидДоступа = "ХозяйственныеОперации"
	 ИЛИ ВидДоступа = "СоглашенияСКлиентамиЧтение"
	  ИЛИ ВидДоступа = "СоглашенияСКлиентамиИзменение" Тогда
		
		Использование = Истина;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта].
//                 Например, Документ.ПриходнаяНакладная.Чтение.Организации
//                           Документ.ПриходнаяНакладная.Чтение.Контрагенты
//                           Документ.ПриходнаяНакладная.Изменение.Организации
//                           Документ.ПриходнаяНакладная.Изменение.Контрагенты
//                           Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма
//                           Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма
//                           Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов
//                           Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо
//                           Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов
//                           Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо
//                 Вид доступа Объект предопределен, как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа, как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть у поля.
//                 РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
 
	Описание = Описание + "

	|Документ.ВыгрузкаРегламентированныхОтчетов.Чтение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Изменение.Организации
	|Документ.РегламентированныйОтчет.Чтение.Организации
	|Документ.РегламентированныйОтчет.Изменение.Организации
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Чтение.Склады
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Изменение.Склады
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.БанковскиеСчетаКонтрагентов.Чтение.ВнешниеПользователи
	|Справочник.БанковскиеСчетаКонтрагентов.Изменение.ВнешниеПользователи
	|Справочник.БанковскиеСчетаОрганизаций.Чтение.Организации
	|Справочник.ВариантыКомплектацииНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ВерсииФайлов.Чтение.ГруппыПартнеров
	|Справочник.ВерсииФайлов.Чтение.ГруппыФизическихЛиц
	|Справочник.ВерсииФайлов.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.ВерсииФайлов.Изменение.ГруппыПартнеров
	|Справочник.ВерсииФайлов.Изменение.ГруппыФизическихЛиц
	|Справочник.ВерсииФайлов.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВидыЗапасов.Чтение.Организации
	|Справочник.ВидыНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ВидыЦен.Чтение.ВидыЦен
	|Справочник.ВидыЦен.Изменение.ВидыЦен
	|Справочник.ВидыЦенПоставщиков.Чтение.ГруппыПартнеров
	|Справочник.ВидыЦенПоставщиков.Изменение.ГруппыПартнеров
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ГруппыДоступаПартнеров.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентов.Чтение.ВнешниеПользователи
	|Справочник.ДоговорыКонтрагентов.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Чтение.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентов.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентов.Изменение.Организации
	|Справочник.ДоговорыКонтрагентов.Изменение.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.ДоговорыКредитовИДепозитов.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитов.Чтение.Организации
	|Справочник.ДоговорыКредитовИДепозитов.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитов.Изменение.Организации
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаданиеНаПеревозкуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаданиеНаПеревозкуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.ПретензииКлиентов
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.Проекты
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.ПретензииКлиентов
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.Проекты
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.Пользователи
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.Пользователи
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.Кассы.Чтение.Кассы
	|Справочник.Кассы.Чтение.Организации
	|Справочник.КассыККМ.Чтение.КассыККМ
	|Справочник.КассыККМ.Чтение.Организации
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КонтактныеЛицаПартнеров.Чтение.ВнешниеПользователи
	|Справочник.КонтактныеЛицаПартнеров.Чтение.ГруппыПартнеров
	|Справочник.КонтактныеЛицаПартнеров.Изменение.ВнешниеПользователи
	|Справочник.КонтактныеЛицаПартнеров.Изменение.ГруппыПартнеров
	|Справочник.Контрагенты.Чтение.ВнешниеПользователи
	|Справочник.Контрагенты.Чтение.ГруппыПартнеров
	|Справочник.Контрагенты.Изменение.ВнешниеПользователи
	|Справочник.Контрагенты.Изменение.ГруппыПартнеров
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Чтение.Склады
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.КорректировкаПоступленияПрисоединенныеФайлы.Изменение.Склады
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Склады
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Склады
	|Справочник.НаборыДополнительныхРеквизитовИСведений.Изменение.ГруппыНоменклатуры
	|Справочник.Номенклатура.Изменение.ГруппыНоменклатуры
	|Справочник.НоменклатураПоставщиков.Чтение.ГруппыПартнеров
	|Справочник.НоменклатураПоставщиков.Изменение.ГруппыПартнеров
	|Справочник.НоменклатураПоставщиковПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.НоменклатураПоставщиковПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.НоменклатураПрисоединенныеФайлы.Изменение.ГруппыНоменклатуры
	|Справочник.ОбластиХранения.Чтение.Склады
	|Справочник.ОбластиХранения.Изменение.Склады
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Чтение.Кассы
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Изменение.Кассы
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.Организации.Чтение.Организации
	|Справочник.Организации.Изменение.Организации
	|Справочник.ОрганизацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтветственныеЛицаОрганизаций.Чтение.Организации
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.Партнеры.Чтение.ВнешниеПользователи
	|Справочник.Партнеры.Чтение.ГруппыПартнеров
	|Справочник.Партнеры.Изменение.ГруппыПартнеров
	|Справочник.ПартнерыПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПартнерыПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПланПродажПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПланПродажПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПланПродажПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПланПродажПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПланПродажПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПланПродажПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Чтение.ВнешниеПользователи
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Чтение.ГруппыПартнеров
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Изменение.ВнешниеПользователи
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Изменение.ГруппыПартнеров
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПоступлениеТоваровУслугПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПоступлениеУслугПрочихАктивовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПоступлениеУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПоступлениеУслугПрочихАктивовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПоступлениеУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПретензииКлиентов.Чтение.ВнешниеПользователи
	|Справочник.ПретензииКлиентов.Чтение.ГруппыПартнеров
	|Справочник.ПретензииКлиентов.Изменение.ВнешниеПользователи
	|Справочник.ПретензииКлиентов.Изменение.ГруппыПартнеров
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Чтение.ВнешниеПользователи
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.РабочиеУчастки.Чтение.Склады
	|Справочник.РабочиеУчастки.Изменение.Склады
	|Справочник.РассылкаКлиентамПрисоединенныеФайлы.Чтение.Объект.Документ.РассылкаКлиентам
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.Склады
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.Склады
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СделкиСКлиентами.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентами.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентамиПрисоединенныеФайлы.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентамиПрисоединенныеФайлы.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СкладскиеПомещения.Чтение.Склады
	|Справочник.СкладскиеЯчейки.Чтение.Склады
	|Справочник.СкладскиеЯчейки.Изменение.Склады
	|Справочник.Склады.Чтение.Склады
	|Справочник.Склады.Изменение.Склады
	|Справочник.СоглашенияСКлиентами.Чтение.ВнешниеПользователи
	|Справочник.СоглашенияСКлиентами.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентами.Чтение.Организации
	|Справочник.СоглашенияСКлиентами.Чтение.Склады
	|Справочник.СоглашенияСКлиентами.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентами.Изменение.Организации
	|Справочник.СоглашенияСКлиентами.Изменение.Склады
	|Справочник.СоглашенияСКлиентами.Изменение.СоглашенияСКлиентамиИзменение
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.Склады
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.Склады
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.СоглашенияСКлиентамиИзменение
	|Справочник.СоглашенияСПоставщиками.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщиками.Чтение.Организации
	|Справочник.СоглашенияСПоставщиками.Чтение.Склады
	|Справочник.СоглашенияСПоставщиками.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщиками.Изменение.Организации
	|Справочник.СоглашенияСПоставщиками.Изменение.Склады
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.Склады
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.Склады
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СтруктураПредприятия.Чтение.Организации
	|Справочник.СтруктураПредприятия.Чтение.Подразделения
	|Справочник.СтруктураПредприятия.Изменение.Организации
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.УдалитьДоговорыЭквайринга.Чтение.Организации
	|Справочник.УдалитьДоговорыЭквайрингаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УпаковкиЕдиницыИзмерения.Изменение.ГруппыНоменклатуры
	|Справочник.УсловияОбслуживанияПартнеровТорговымиПредставителями.Чтение.ГруппыПартнеров
	|Справочник.УсловияОбслуживанияПартнеровТорговымиПредставителями.Изменение.ГруппыПартнеров
	|Справочник.УстановкаЦенНоменклатурыПрисоединенныеФайлы.Чтение.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.УстановкаЦенНоменклатурыПрисоединенныеФайлы.Изменение.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.Файлы.Чтение.ГруппыПартнеров
	|Справочник.Файлы.Чтение.ГруппыФизическихЛиц
	|Справочник.Файлы.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Файлы.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.Файлы.Изменение.ГруппыПартнеров
	|Справочник.Файлы.Изменение.ГруппыФизическихЛиц
	|Справочник.Файлы.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.ФизическиеЛица.Чтение.ГруппыФизическихЛиц
	|Справочник.ФизическиеЛица.Изменение.ГруппыФизическихЛиц
	|Справочник.ХарактеристикиНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ЭквайринговыеТерминалы.Чтение.Организации
	|Справочник.ЭквайринговыеТерминалы.Чтение.ЭквайринговыеТерминалы
	|Документ.АвансовыйОтчет.Чтение.ГруппыПартнеров
	|Документ.АвансовыйОтчет.Чтение.ГруппыФизическихЛиц
	|Документ.АвансовыйОтчет.Чтение.Организации
	|Документ.АвансовыйОтчет.Чтение.Подразделения
	|Документ.АвансовыйОтчет.Изменение.ГруппыПартнеров
	|Документ.АвансовыйОтчет.Изменение.ГруппыФизическихЛиц
	|Документ.АвансовыйОтчет.Изменение.Организации
	|Документ.АвансовыйОтчет.Изменение.Подразделения
	|Документ.АктВыполненныхРабот.Чтение.ВнешниеПользователи
	|Документ.АктВыполненныхРабот.Чтение.ГруппыПартнеров
	|Документ.АктВыполненныхРабот.Чтение.Организации
	|Документ.АктВыполненныхРабот.Чтение.Подразделения
	|Документ.АктВыполненныхРабот.Изменение.ГруппыПартнеров
	|Документ.АктВыполненныхРабот.Изменение.Организации
	|Документ.АктВыполненныхРабот.Изменение.Подразделения
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.ВнешниеПользователи
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.Организации
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.ТипыОснованийАктаОРасхождениях
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.ВнешниеПользователи
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.Организации
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.ТипыОснованийАктаОРасхождениях
	|Документ.АктОРасхожденияхПослеПеремещения.Чтение.Организации
	|Документ.АктОРасхожденияхПослеПеремещения.Чтение.Склады
	|Документ.АктОРасхожденияхПослеПеремещения.Изменение.Организации
	|Документ.АктОРасхожденияхПослеПеремещения.Изменение.Склады
	|Документ.АктОРасхожденияхПослеПриемки.Чтение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеПриемки.Чтение.Организации
	|Документ.АктОРасхожденияхПослеПриемки.Чтение.ТипыОснованийАктаОРасхождениях
	|Документ.АктОРасхожденияхПослеПриемки.Изменение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеПриемки.Изменение.Организации
	|Документ.АктОРасхожденияхПослеПриемки.Изменение.ТипыОснованийАктаОРасхождениях
	|Документ.ВводОстатков.Чтение.Организации
	|Документ.ВводОстатков.Чтение.Склады
	|Документ.ВводОстатков.Изменение.Организации
	|Документ.ВводОстатков.Изменение.Склады
	|Документ.ВзаимозачетЗадолженности.Чтение.ГруппыПартнеров
	|Документ.ВзаимозачетЗадолженности.Чтение.Организации
	|Документ.ВзаимозачетЗадолженности.Изменение.ВидыОперацийВзаимозачетаЗадолженности
	|Документ.ВзаимозачетЗадолженности.Изменение.ГруппыПартнеров
	|Документ.ВзаимозачетЗадолженности.Изменение.Организации
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.Кассы
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.КассыККМ
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.Организации
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.Кассы
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.КассыККМ
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Подразделения
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Склады
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Подразделения
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Склады
	|Документ.ВозвратТоваровМеждуОрганизациями.Чтение.Организации
	|Документ.ВозвратТоваровМеждуОрганизациями.Изменение.Организации
	|Документ.ВозвратТоваровОтКлиента.Чтение.ВнешниеПользователи
	|Документ.ВозвратТоваровОтКлиента.Чтение.ГруппыПартнеров
	|Документ.ВозвратТоваровОтКлиента.Чтение.Организации
	|Документ.ВозвратТоваровОтКлиента.Чтение.Подразделения
	|Документ.ВозвратТоваровОтКлиента.Чтение.Склады
	|Документ.ВозвратТоваровОтКлиента.Изменение.ГруппыПартнеров
	|Документ.ВозвратТоваровОтКлиента.Изменение.Организации
	|Документ.ВозвратТоваровОтКлиента.Изменение.Подразделения
	|Документ.ВозвратТоваровОтКлиента.Изменение.Склады
	|Документ.ВозвратТоваровПоставщику.Чтение.ГруппыПартнеров
	|Документ.ВозвратТоваровПоставщику.Чтение.Организации
	|Документ.ВозвратТоваровПоставщику.Чтение.Подразделения
	|Документ.ВозвратТоваровПоставщику.Чтение.Склады
	|Документ.ВозвратТоваровПоставщику.Изменение.ГруппыПартнеров
	|Документ.ВозвратТоваровПоставщику.Изменение.Организации
	|Документ.ВозвратТоваровПоставщику.Изменение.Подразделения
	|Документ.ВозвратТоваровПоставщику.Изменение.Склады
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Чтение.КассыККМ
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Чтение.Организации
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Изменение.КассыККМ
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Изменение.Организации
	|Документ.ВыкупВозвратнойТарыКлиентом.Чтение.Организации
	|Документ.ВыкупВозвратнойТарыКлиентом.Изменение.Организации
	|Документ.ВыкупВозвратнойТарыУПоставщика.Чтение.Организации
	|Документ.ВыкупВозвратнойТарыУПоставщика.Изменение.Организации
	|Документ.ДвижениеПрочихАктивовПассивов.Чтение.Организации
	|Документ.ДвижениеПрочихАктивовПассивов.Изменение.Организации
	|Документ.ДоверенностьВыданная.Чтение.ГруппыПартнеров
	|Документ.ДоверенностьВыданная.Чтение.ГруппыФизическихЛиц
	|Документ.ДоверенностьВыданная.Чтение.Организации
	|Документ.ДоверенностьВыданная.Изменение.ГруппыПартнеров
	|Документ.ДоверенностьВыданная.Изменение.ГруппыФизическихЛиц
	|Документ.ДоверенностьВыданная.Изменение.Организации
	|Документ.ЗаданиеНаПеревозку.Чтение.Склады
	|Документ.ЗаданиеНаПеревозку.Изменение.Склады
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.ГруппыПартнеров
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.Организации
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.Склады
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.ГруппыПартнеров
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.Организации
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.Склады
	|Документ.ЗаказКлиента.Чтение.ВнешниеПользователи
	|Документ.ЗаказКлиента.Чтение.ГруппыПартнеров
	|Документ.ЗаказКлиента.Чтение.Организации
	|Документ.ЗаказКлиента.Чтение.Подразделения
	|Документ.ЗаказКлиента.Чтение.Склады
	|Документ.ЗаказКлиента.Изменение.ВнешниеПользователи
	|Документ.ЗаказКлиента.Изменение.ГруппыПартнеров
	|Документ.ЗаказКлиента.Изменение.Организации
	|Документ.ЗаказКлиента.Изменение.Подразделения
	|Документ.ЗаказКлиента.Изменение.Склады
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Организации
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Подразделения
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Склады
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Организации
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Подразделения
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Склады
	|Документ.ЗаказНаПеремещение.Чтение.Организации
	|Документ.ЗаказНаПеремещение.Чтение.Склады
	|Документ.ЗаказНаПеремещение.Изменение.Организации
	|Документ.ЗаказНаПеремещение.Изменение.Склады
	|Документ.ЗаказНаСборку.Чтение.Организации
	|Документ.ЗаказНаСборку.Чтение.Склады
	|Документ.ЗаказНаСборку.Изменение.Организации
	|Документ.ЗаказНаСборку.Изменение.Склады
	|Документ.ЗаказПоставщику.Чтение.ГруппыПартнеров
	|Документ.ЗаказПоставщику.Чтение.Организации
	|Документ.ЗаказПоставщику.Чтение.Подразделения
	|Документ.ЗаказПоставщику.Чтение.Склады
	|Документ.ЗаказПоставщику.Изменение.ГруппыПартнеров
	|Документ.ЗаказПоставщику.Изменение.Организации
	|Документ.ЗаказПоставщику.Изменение.Подразделения
	|Документ.ЗаказПоставщику.Изменение.Склады
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.ВнешниеПользователи
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.Организации
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.Склады
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.ВнешниеПользователи
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.Организации
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.Склады
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Организации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Подразделения
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Пользователи
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Организации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Подразделения
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Пользователи
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.ИзменениеАссортимента.Чтение.Объект.Документ.ИзменениеАссортимента
	|Документ.ИзменениеАссортимента.Изменение.Объект.Документ.ИзменениеАссортимента
	|Документ.ИнвентаризационнаяОпись.Чтение.Организации
	|Документ.ИнвентаризационнаяОпись.Чтение.Склады
	|Документ.ИнвентаризационнаяОпись.Изменение.Организации
	|Документ.ИнвентаризационнаяОпись.Изменение.Склады
	|Документ.ИнвентаризацияНаличныхДенежныхСредств.Чтение.Организации
	|Документ.ИнвентаризацияНаличныхДенежныхСредств.Изменение.Организации
	|Документ.КассоваяСмена.Чтение.КассыККМ
	|Документ.КассоваяСмена.Чтение.Организации
	|Документ.КассоваяСмена.Чтение.Склады
	|Документ.КассоваяСмена.Изменение.КассыККМ
	|Документ.КассоваяСмена.Изменение.Организации
	|Документ.КассоваяСмена.Изменение.Склады
	|Документ.КоммерческоеПредложениеКлиенту.Чтение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеКлиенту.Чтение.Организации
	|Документ.КоммерческоеПредложениеКлиенту.Изменение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеКлиенту.Изменение.Организации
	|Документ.КорректировкаНазначенияТоваров.Чтение.Организации
	|Документ.КорректировкаНазначенияТоваров.Изменение.Организации
	|Документ.КорректировкаНалоговогоНазначенияЗапасов.Чтение.Организации
	|Документ.КорректировкаНалоговогоНазначенияЗапасов.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Склады
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Склады
	|Документ.КорректировкаПоОрдеруНаТовары.Чтение.Склады
	|Документ.КорректировкаПоОрдеруНаТовары.Изменение.Склады
	|Документ.КорректировкаПоступления.Чтение.ГруппыПартнеров
	|Документ.КорректировкаПоступления.Чтение.Организации
	|Документ.КорректировкаПоступления.Чтение.Подразделения
	|Документ.КорректировкаПоступления.Чтение.Склады
	|Документ.КорректировкаПоступления.Изменение.ГруппыПартнеров
	|Документ.КорректировкаПоступления.Изменение.Организации
	|Документ.КорректировкаПоступления.Изменение.Подразделения
	|Документ.КорректировкаПоступления.Изменение.Склады
	|Документ.КорректировкаРеализации.Чтение.ВнешниеПользователи
	|Документ.КорректировкаРеализации.Чтение.ГруппыПартнеров
	|Документ.КорректировкаРеализации.Чтение.Организации
	|Документ.КорректировкаРеализации.Чтение.Подразделения
	|Документ.КорректировкаРеализации.Чтение.Склады
	|Документ.КорректировкаРеализации.Изменение.ГруппыПартнеров
	|Документ.КорректировкаРеализации.Изменение.Организации
	|Документ.КорректировкаРеализации.Изменение.Подразделения
	|Документ.КорректировкаРеализации.Изменение.Склады
	|Документ.ЛимитыРасходаДенежныхСредств.Чтение.Организации
	|Документ.ЛимитыРасходаДенежныхСредств.Чтение.Подразделения
	|Документ.ЛимитыРасходаДенежныхСредств.Изменение.Организации
	|Документ.ЛимитыРасходаДенежныхСредств.Изменение.Подразделения
	|Документ.ЛистКассовойКниги.Чтение.Организации
	|Документ.ЛистКассовойКниги.Изменение.Организации
	|Документ.НалоговаяНакладная.Чтение.ГруппыПартнеров
	|Документ.НалоговаяНакладная.Чтение.Организации
	|Документ.НалоговаяНакладная.Изменение.Организации
	|Документ.НачисленияКредитовИДепозитов.Чтение.Организации
	|Документ.НачисленияКредитовИДепозитов.Изменение.Организации
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Чтение.Кассы
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Чтение.Организации
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Изменение.Кассы
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Изменение.Организации
	|Документ.ОперацияПоПлатежнойКарте.Чтение.ГруппыПартнеров
	|Документ.ОперацияПоПлатежнойКарте.Чтение.Организации
	|Документ.ОперацияПоПлатежнойКарте.Чтение.ЭквайринговыеТерминалы
	|Документ.ОперацияПоПлатежнойКарте.Изменение.ГруппыПартнеров
	|Документ.ОперацияПоПлатежнойКарте.Изменение.Организации
	|Документ.ОперацияПоПлатежнойКарте.Изменение.ЭквайринговыеТерминалы
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Подразделения
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Склады
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Подразделения
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеИзлишковТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеИзлишковТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеНедостачТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеНедостачТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеПорчиТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеПорчиТоваров.Изменение.Склады
	|Документ.ОрдерНаПеремещениеТоваров.Чтение.Склады
	|Документ.ОрдерНаПеремещениеТоваров.Изменение.Склады
	|Документ.ОтборРазмещениеТоваров.Чтение.Склады
	|Документ.ОтборРазмещениеТоваров.Изменение.Склады
	|Документ.ОтражениеРасхожденийПриИнкассацииДенежныхСредств.Чтение.Организации
	|Документ.ОтражениеРасхожденийПриИнкассацииДенежныхСредств.Изменение.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Чтение.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Чтение.Подразделения
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Изменение.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Изменение.Подразделения
	|Документ.ОтчетКомиссионера.Чтение.ВнешниеПользователи
	|Документ.ОтчетКомиссионера.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомиссионера.Чтение.Организации
	|Документ.ОтчетКомиссионера.Чтение.Подразделения
	|Документ.ОтчетКомиссионера.Изменение.ВнешниеПользователи
	|Документ.ОтчетКомиссионера.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомиссионера.Изменение.Организации
	|Документ.ОтчетКомиссионера.Изменение.Подразделения
	|Документ.ОтчетКомиссионераОСписании.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомиссионераОСписании.Чтение.Организации
	|Документ.ОтчетКомиссионераОСписании.Чтение.Подразделения
	|Документ.ОтчетКомиссионераОСписании.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомиссионераОСписании.Изменение.Организации
	|Документ.ОтчетКомиссионераОСписании.Изменение.Подразделения
	|Документ.ОтчетКомитенту.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомитенту.Чтение.Организации
	|Документ.ОтчетКомитенту.Чтение.Подразделения
	|Документ.ОтчетКомитенту.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомитенту.Изменение.Организации
	|Документ.ОтчетКомитенту.Изменение.Подразделения
	|Документ.ОтчетКомитентуОСписании.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомитентуОСписании.Чтение.Организации
	|Документ.ОтчетКомитентуОСписании.Чтение.Подразделения
	|Документ.ОтчетКомитентуОСписании.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомитентуОСписании.Изменение.Организации
	|Документ.ОтчетКомитентуОСписании.Изменение.Подразделения
	|Документ.ОтчетОРозничнойВыручке.Чтение.КассыККМ
	|Документ.ОтчетОРозничнойВыручке.Чтение.Организации
	|Документ.ОтчетОРозничнойВыручке.Чтение.Подразделения
	|Документ.ОтчетОРозничнойВыручке.Чтение.Склады
	|Документ.ОтчетОРозничнойВыручке.Изменение.КассыККМ
	|Документ.ОтчетОРозничнойВыручке.Изменение.Организации
	|Документ.ОтчетОРозничнойВыручке.Изменение.Подразделения
	|Документ.ОтчетОРозничнойВыручке.Изменение.Склады
	|Документ.ОтчетОРозничныхПродажах.Чтение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Чтение.Организации
	|Документ.ОтчетОРозничныхПродажах.Чтение.Подразделения
	|Документ.ОтчетОРозничныхПродажах.Чтение.Склады
	|Документ.ОтчетОРозничныхПродажах.Изменение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Изменение.Организации
	|Документ.ОтчетОРозничныхПродажах.Изменение.Подразделения
	|Документ.ОтчетОРозничныхПродажах.Изменение.Склады
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Чтение.Организации
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Изменение.Организации
	|Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании.Чтение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.Организации
	|Документ.ПеремещениеТоваров.Чтение.Организации
	|Документ.ПеремещениеТоваров.Чтение.Склады
	|Документ.ПеремещениеТоваров.Изменение.Организации
	|Документ.ПеремещениеТоваров.Изменение.Склады
	|Документ.ПереоценкаВалютныхСредств.Чтение.Организации
	|Документ.ПереоценкаВалютныхСредств.Изменение.Организации
	|Документ.ПересортицаТоваров.Чтение.Организации
	|Документ.ПересортицаТоваров.Чтение.Подразделения
	|Документ.ПересортицаТоваров.Чтение.Склады
	|Документ.ПересортицаТоваров.Изменение.Организации
	|Документ.ПересортицаТоваров.Изменение.Подразделения
	|Документ.ПересортицаТоваров.Изменение.Склады
	|Документ.ПересчетТоваров.Чтение.Склады
	|Документ.ПересчетТоваров.Изменение.Склады
	|Документ.ПланЗакупок.Чтение.ГруппыПартнеров
	|Документ.ПланЗакупок.Чтение.Подразделения
	|Документ.ПланЗакупок.Чтение.Склады
	|Документ.ПланЗакупок.Изменение.ГруппыПартнеров
	|Документ.ПланЗакупок.Изменение.Подразделения
	|Документ.ПланЗакупок.Изменение.Склады
	|Документ.ПланПродаж.Чтение.ВнешниеПользователи
	|Документ.ПланПродаж.Чтение.ГруппыПартнеров
	|Документ.ПланПродаж.Чтение.Подразделения
	|Документ.ПланПродаж.Чтение.Склады
	|Документ.ПланПродаж.Изменение.ВнешниеПользователи
	|Документ.ПланПродаж.Изменение.ГруппыПартнеров
	|Документ.ПланПродаж.Изменение.Подразделения
	|Документ.ПланПродаж.Изменение.Склады
	|Документ.ПланПродажПоКатегориям.Чтение.Подразделения
	|Документ.ПланПродажПоКатегориям.Чтение.Склады
	|Документ.ПланПродажПоКатегориям.Изменение.Подразделения
	|Документ.ПланПродажПоКатегориям.Изменение.Склады
	|Документ.ПоручениеЭкспедитору.Чтение.ГруппыПартнеров
	|Документ.ПоручениеЭкспедитору.Чтение.Подразделения
	|Документ.ПоручениеЭкспедитору.Чтение.Склады
	|Документ.ПоручениеЭкспедитору.Изменение.ГруппыПартнеров
	|Документ.ПоручениеЭкспедитору.Изменение.Подразделения
	|Документ.ПоручениеЭкспедитору.Изменение.Склады
	|Документ.ПорчаТоваров.Чтение.Организации
	|Документ.ПорчаТоваров.Чтение.Подразделения
	|Документ.ПорчаТоваров.Чтение.Склады
	|Документ.ПорчаТоваров.Изменение.Организации
	|Документ.ПорчаТоваров.Изменение.Подразделения
	|Документ.ПорчаТоваров.Изменение.Склады
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.Организации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.Организации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.ПоступлениеТоваровУслуг.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеТоваровУслуг.Чтение.Организации
	|Документ.ПоступлениеТоваровУслуг.Чтение.Подразделения
	|Документ.ПоступлениеТоваровУслуг.Чтение.Склады
	|Документ.ПоступлениеТоваровУслуг.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеТоваровУслуг.Изменение.Организации
	|Документ.ПоступлениеТоваровУслуг.Изменение.Подразделения
	|Документ.ПоступлениеТоваровУслуг.Изменение.Склады
	|Документ.ПоступлениеУслугПрочихАктивов.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеУслугПрочихАктивов.Чтение.Организации
	|Документ.ПоступлениеУслугПрочихАктивов.Чтение.Подразделения
	|Документ.ПоступлениеУслугПрочихАктивов.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеУслугПрочихАктивов.Изменение.Организации
	|Документ.ПоступлениеУслугПрочихАктивов.Изменение.Подразделения
	|Документ.Приложение2КНалоговойНакладной.Чтение.ГруппыПартнеров
	|Документ.Приложение2КНалоговойНакладной.Чтение.Организации
	|Документ.Приложение2КНалоговойНакладной.Изменение.Организации	
	|Документ.ПриходныйКассовыйОрдер.Чтение.ГруппыПартнеров
	|Документ.ПриходныйКассовыйОрдер.Чтение.ГруппыФизическихЛиц
	|Документ.ПриходныйКассовыйОрдер.Чтение.Кассы
	|Документ.ПриходныйКассовыйОрдер.Чтение.КассыККМ
	|Документ.ПриходныйКассовыйОрдер.Чтение.Организации
	|Документ.ПриходныйКассовыйОрдер.Чтение.ХозяйственныеОперации
	|Документ.ПриходныйКассовыйОрдер.Изменение.ГруппыПартнеров
	|Документ.ПриходныйКассовыйОрдер.Изменение.ГруппыФизическихЛиц
	|Документ.ПриходныйКассовыйОрдер.Изменение.Кассы
	|Документ.ПриходныйКассовыйОрдер.Изменение.КассыККМ
	|Документ.ПриходныйКассовыйОрдер.Изменение.Организации
	|Документ.ПриходныйКассовыйОрдер.Изменение.ХозяйственныеОперации
	|Документ.ПриходныйОрдерНаТовары.Чтение.Склады
	|Документ.ПриходныйОрдерНаТовары.Изменение.Склады
	|Документ.ПрочееОприходованиеТоваров.Чтение.Организации
	|Документ.ПрочееОприходованиеТоваров.Чтение.Подразделения
	|Документ.ПрочееОприходованиеТоваров.Чтение.Склады
	|Документ.ПрочееОприходованиеТоваров.Изменение.Организации
	|Документ.ПрочееОприходованиеТоваров.Изменение.Подразделения
	|Документ.ПрочееОприходованиеТоваров.Изменение.Склады
	|Документ.ПрочиеДоходыРасходы.Чтение.Организации
	|Документ.ПрочиеДоходыРасходы.Изменение.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.Кассы
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.Кассы
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.РаспределениеДоходовИРасходовПоНаправлениямДеятельности.Чтение.Организации
	|Документ.РаспределениеДоходовИРасходовПоНаправлениямДеятельности.Изменение.Организации
	|Документ.РаспределениеРасходовБудущихПериодов.Чтение.Организации
	|Документ.РаспределениеРасходовБудущихПериодов.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.ГруппыПартнеров
	|Документ.РасходныйКассовыйОрдер.Чтение.ГруппыФизическихЛиц
	|Документ.РасходныйКассовыйОрдер.Чтение.Кассы
	|Документ.РасходныйКассовыйОрдер.Чтение.КассыККМ
	|Документ.РасходныйКассовыйОрдер.Чтение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.ХозяйственныеОперации
	|Документ.РасходныйКассовыйОрдер.Изменение.ГруппыПартнеров
	|Документ.РасходныйКассовыйОрдер.Изменение.ГруппыФизическихЛиц
	|Документ.РасходныйКассовыйОрдер.Изменение.Кассы
	|Документ.РасходныйКассовыйОрдер.Изменение.КассыККМ
	|Документ.РасходныйКассовыйОрдер.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Изменение.ХозяйственныеОперации
	|Документ.РасходныйОрдерНаТовары.Чтение.Склады
	|Документ.РасходныйОрдерНаТовары.Изменение.Склады
	|Документ.РасчетСебестоимостиТоваров.Чтение.Организации
	|Документ.РасчетСебестоимостиТоваров.Изменение.Организации
	|Документ.РеализацияТоваровУслуг.Чтение.ВнешниеПользователи
	|Документ.РеализацияТоваровУслуг.Чтение.ГруппыПартнеров
	|Документ.РеализацияТоваровУслуг.Чтение.Организации
	|Документ.РеализацияТоваровУслуг.Чтение.Подразделения
	|Документ.РеализацияТоваровУслуг.Чтение.Склады
	|Документ.РеализацияТоваровУслуг.Изменение.ГруппыПартнеров
	|Документ.РеализацияТоваровУслуг.Изменение.Организации
	|Документ.РеализацияТоваровУслуг.Изменение.Подразделения
	|Документ.РеализацияТоваровУслуг.Изменение.Склады
	|Документ.РеализацияУслугПрочихАктивов.Чтение.ГруппыПартнеров
	|Документ.РеализацияУслугПрочихАктивов.Чтение.Организации
	|Документ.РеализацияУслугПрочихАктивов.Чтение.Подразделения
	|Документ.РеализацияУслугПрочихАктивов.Изменение.ГруппыПартнеров
	|Документ.РеализацияУслугПрочихАктивов.Изменение.Организации
	|Документ.РеализацияУслугПрочихАктивов.Изменение.Подразделения
	|Документ.РегистрацияВходящегоНалоговогоДокумента.Чтение.ГруппыПартнеров
	|Документ.РегистрацияВходящегоНалоговогоДокумента.Чтение.Организации
	|Документ.РегистрацияВходящегоНалоговогоДокумента.Изменение.ГруппыПартнеров
	|Документ.РегистрацияВходящегоНалоговогоДокумента.Изменение.Организации
	|Документ.РегистрацияЦенНоменклатурыПоставщика.Чтение.ГруппыПартнеров
	|Документ.РегистрацияЦенНоменклатурыПоставщика.Изменение.ГруппыПартнеров
	|Документ.СборкаТоваров.Чтение.Организации
	|Документ.СборкаТоваров.Чтение.Склады
	|Документ.СборкаТоваров.Изменение.Организации
	|Документ.СборкаТоваров.Изменение.Склады
	|Документ.СверкаВзаиморасчетов.Чтение.ГруппыПартнеров
	|Документ.СверкаВзаиморасчетов.Чтение.Организации
	|Документ.СверкаВзаиморасчетов.Изменение.ГруппыПартнеров
	|Документ.СверкаВзаиморасчетов.Изменение.Организации
	|Документ.СоглашениеСПоставщиком.Чтение.ГруппыПартнеров
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ГруппыФизическихЛиц
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.Организации
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ГруппыФизическихЛиц
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.Организации
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.СписаниеЗадолженности.Чтение.ГруппыПартнеров
	|Документ.СписаниеЗадолженности.Чтение.Организации
	|Документ.СписаниеЗадолженности.Изменение.ГруппыПартнеров
	|Документ.СписаниеЗадолженности.Изменение.Организации
	|Документ.СписаниеНедостачТоваров.Чтение.Организации
	|Документ.СписаниеНедостачТоваров.Чтение.Подразделения
	|Документ.СписаниеНедостачТоваров.Чтение.Склады
	|Документ.СписаниеНедостачТоваров.Изменение.Организации
	|Документ.СписаниеНедостачТоваров.Изменение.Подразделения
	|Документ.СписаниеНедостачТоваров.Изменение.Склады
	|Документ.СчетНаОплатуКлиенту.Чтение.ВнешниеПользователи
	|Документ.СчетНаОплатуКлиенту.Чтение.ГруппыПартнеров
	|Документ.СчетНаОплатуКлиенту.Чтение.Организации
	|Документ.СчетНаОплатуКлиенту.Изменение.ГруппыПартнеров
	|Документ.СчетНаОплатуКлиенту.Изменение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.ГруппыПартнеров
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.Подразделения
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.ГруппыПартнеров
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.Подразделения
	|Документ.ТранспортнаяНакладная.Чтение.Организации
	|Документ.ТранспортнаяНакладная.Изменение.Организации
	|Документ.УдалитьАктОРасхожденияхПриПоступленииТоваров.Чтение.ГруппыПартнеров
	|Документ.УдалитьАктОРасхожденияхПриПоступленииТоваров.Чтение.Организации
	|Документ.УдалитьАктОРасхожденияхПриПоступленииТоваров.Изменение.ГруппыПартнеров
	|Документ.УдалитьАктОРасхожденияхПриПоступленииТоваров.Изменение.Организации
	|Документ.УдалитьАктПриемкиТоваров.Чтение.ГруппыПартнеров
	|Документ.УдалитьАктПриемкиТоваров.Чтение.Организации
	|Документ.УдалитьАктПриемкиТоваров.Изменение.ГруппыПартнеров
	|Документ.УдалитьАктПриемкиТоваров.Изменение.Организации
    |Документ.УДАЛИТЬВыпискаПоРасчетномуСчету.Чтение.Организации
	|Документ.УстановкаБлокировокЯчеек.Чтение.Склады
	|Документ.УстановкаБлокировокЯчеек.Изменение.Склады
	|Документ.УстановкаЦенНоменклатуры.Чтение.Объект.Документ.УстановкаЦенНоменклатуры
	|Документ.УстановкаЦенНоменклатуры.Изменение.Объект.Документ.УстановкаЦенНоменклатуры
	|Документ.ЧекККМ.Чтение.КассыККМ
	|Документ.ЧекККМ.Чтение.Организации
	|Документ.ЧекККМ.Чтение.Склады
	|Документ.ЧекККМ.Изменение.КассыККМ
	|Документ.ЧекККМ.Изменение.Организации
	|Документ.ЧекККМ.Изменение.Склады
	|Документ.ЧекККМВозврат.Чтение.КассыККМ
	|Документ.ЧекККМВозврат.Чтение.Организации
	|Документ.ЧекККМВозврат.Чтение.Склады
	|Документ.ЧекККМВозврат.Изменение.КассыККМ
	|Документ.ЧекККМВозврат.Изменение.Организации
	|Документ.ЧекККМВозврат.Изменение.Склады
	|ЖурналДокументов.АвансовыеОтчеты.Чтение.Организации
	|ЖурналДокументов.БезналичныеПлатежи.Чтение.Организации
	|ЖурналДокументов.ДокументыПродажи.Чтение.ГруппыПартнеров
	|ЖурналДокументов.ДокументыПродажи.Чтение.Организации
	|ЖурналДокументов.ДокументыПродажи.Чтение.Подразделения
	|ЖурналДокументов.ДокументыПродажи.Чтение.Склады
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.ГруппыПартнеров
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.Организации
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.Подразделения
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.ГруппыПартнеров
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.Организации
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.Подразделения
	|ЖурналДокументов.ОтчетыОРозничныхПродажахИВыручке.Чтение.КассыККМ
	|ЖурналДокументов.ОтчетыОРозничныхПродажахИВыручке.Чтение.Организации
	|ЖурналДокументов.ОтчетыОРозничныхПродажахИВыручке.Чтение.Подразделения
	|ЖурналДокументов.ОтчетыОРозничныхПродажахИВыручке.Чтение.Склады
	|ЖурналДокументов.ПередачиВозвратыТоваровМеждуОрганизациями.Чтение.Организации
	|ЖурналДокументов.РегламентныеДокументы.Чтение.Организации
	|ЖурналДокументов.СкладскиеОрдера.Чтение.Склады
	|ЖурналДокументов.СкладскиеОрдераНаИзлишкиНедостачиПорчи.Чтение.Склады
	|ЖурналДокументов.ЧекиККМ.Чтение.КассыККМ
	|ЖурналДокументов.ЧекиККМ.Чтение.Организации
	|ЖурналДокументов.ЧекиККМ.Чтение.Склады
	|РегистрСведений.ABCXYZКлассификацияКлиентов.Чтение.ГруппыПартнеров
	|РегистрСведений.ABCXYZКлассификацияКлиентов.Изменение.ГруппыПартнеров
	|РегистрСведений.ABCXYZКлассификацияНоменклатуры.Изменение.ГруппыНоменклатуры
	|РегистрСведений.ВариантыОбеспеченияТоварами.Чтение.Склады
	|РегистрСведений.ВариантыОбеспеченияТоварами.Изменение.Склады
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЗакупки
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЗаявкиНаВозвратТоваровОтКлиента
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеПродажи
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЦенНоменклатуры
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ТиповаяПродажа
	|РегистрСведений.ДанныеВнутреннихДокументов.Чтение.Организации
	|РегистрСведений.ДанныеВнутреннихДокументов.Чтение.Подразделения
	|РегистрСведений.ДанныеВнутреннихДокументов.Чтение.Склады
	|РегистрСведений.ДанныеПервичныхДокументов.Чтение.Организации
	|РегистрСведений.ДокументыФизическихЛиц.Чтение.ГруппыПартнеров
	|РегистрСведений.ДокументыФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДокументыФизическихЛиц.Изменение.ГруппыПартнеров
	|РегистрСведений.ДокументыФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ДоступностьТоваровДляВнешнихПользователей.Чтение.Склады
	|РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений.Чтение.Склады
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСКлиентами.Чтение.ГруппыПартнеров
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСКлиентами.Чтение.Организации
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСПоставщиками.Чтение.ГруппыПартнеров
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСПоставщиками.Чтение.Организации
	|РегистрСведений.ЗаданияКФормированиюИсходящихНалоговыхДокументов.Чтение.ГруппыПартнеров
	|РегистрСведений.ЗаданияКФормированиюИсходящихНалоговыхДокументов.Чтение.Организации
	|РегистрСведений.ЗаданияКРасчетуНалоговыхОбязательствДополнительно.Чтение.ГруппыПартнеров
	|РегистрСведений.ЗаданияКРасчетуНалоговыхОбязательствДополнительно.Чтение.Организации
	|РегистрСведений.ИсточникиПервичногоИнтереса.Чтение.ГруппыПартнеров
	|РегистрСведений.ИсточникиПервичногоИнтереса.Чтение.Объект.Справочник.СделкиСКлиентами
	|РегистрСведений.КорзинаПокупателя.Чтение.ВнешниеПользователи
	|РегистрСведений.НастройкаКонтроляОбеспечения.Чтение.Склады
	|РегистрСведений.НастройкаКонтроляОбеспечения.Изменение.Склады
	|РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями.Чтение.Организации
	|РегистрСведений.НастройкиАдресныхСкладов.Чтение.Склады
	|РегистрСведений.НастройкиАдресныхСкладов.Изменение.Склады
	|РегистрСведений.ОстаткиНаБанковскихСчетахПоДаннымВыписок.Чтение.Организации
	|РегистрСведений.ПартнерыСегмента.Чтение.ВнешниеПользователи
	|РегистрСведений.ПартнерыСегмента.Чтение.ГруппыПартнеров
	|РегистрСведений.ПартнерыСегмента.Изменение.ГруппыПартнеров
	|РегистрСведений.ПравилаРазмещенияТоваровВЯчейках.Чтение.Склады
	|РегистрСведений.ПравилаРазмещенияТоваровВЯчейках.Изменение.Склады
	|РегистрСведений.ПрогнозыРасходаУпаковок.Чтение.Склады
	|РегистрСведений.ПрогнозыРасходаУпаковок.Изменение.Склады
	|РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.Чтение.Склады
	|РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.Изменение.Склады
	|РегистрСведений.СвязиМеждуПартнерами.Чтение.ГруппыПартнеров
	|РегистрСведений.СвязиМеждуПартнерами.Изменение.ГруппыПартнеров
	|РегистрСведений.СостоянияИРеквизитыДоставки.Чтение.ГруппыПартнеров
	|РегистрСведений.СостоянияИРеквизитыДоставки.Чтение.Подразделения
	|РегистрСведений.СостоянияИРеквизитыДоставки.Чтение.Склады
	|РегистрСведений.СтоимостьТоваров.Чтение.Организации
	|РегистрСведений.СхемыОбеспечения.Чтение.Склады
	|РегистрСведений.СхемыОбеспечения.Изменение.Склады
	|РегистрСведений.ТоварныеОграничения.Чтение.Склады
	|РегистрСведений.ТоварныеОграничения.Изменение.Склады
	|РегистрСведений.УчетнаяПолитикаОрганизаций.Чтение.Организации
	|РегистрСведений.УчетнаяПолитикаОрганизаций.Изменение.Организации
	|РегистрСведений.ФайлыВРабочемКаталоге.Чтение.Пользователи
	|РегистрСведений.ФайлыВРабочемКаталоге.Изменение.Пользователи
	|РегистрСведений.ФИОФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ФИОФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ХранимыеФайлыВерсий.Чтение.Объект.Справочник.ФизическиеЛица
	|РегистрСведений.ЦеныНоменклатуры.Чтение.ВидыЦен
	|РегистрСведений.ЦеныНоменклатурыПоставщиков.Чтение.ГруппыПартнеров
	|РегистрСведений.ШтрихкодыНоменклатуры.Изменение.ГруппыНоменклатуры
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.ГруппыПартнеров
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.Организации
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.Подразделения
	|РегистрНакопления.ГрафикОтгрузкиТоваров.Чтение.Склады
	|РегистрНакопления.ГрафикПоступленияТоваров.Чтение.Склады
	|РегистрНакопления.ДвижениеТоваров.Чтение.Склады
	|РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы.Чтение.Подразделения
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.Подразделения
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.Подразделения
	|РегистрНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы.Чтение.Организации
	|РегистрНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы.Чтение.Подразделения
	|РегистрНакопления.ДвиженияНоменклатураДоходыРасходы.Чтение.Организации
	|РегистрНакопления.ДвиженияНоменклатураДоходыРасходы.Чтение.Подразделения
	|РегистрНакопления.ДвиженияНоменклатураДоходыРасходы.Чтение.Склады
	|РегистрНакопления.ДвиженияНоменклатураНоменклатура.Чтение.ГруппыПартнеров
	|РегистрНакопления.ДвиженияНоменклатураНоменклатура.Чтение.Организации
	|РегистрНакопления.ДвиженияНоменклатураНоменклатура.Чтение.Подразделения
	|РегистрНакопления.ДвиженияНоменклатураНоменклатура.Чтение.Склады
	|РегистрНакопления.ДвиженияСерийТоваров.Чтение.Склады
	|РегистрНакопления.ДенежныеСредстваБезналичные.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВПути.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваВПути.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваКВыплате.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваНаличные.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваНаличные.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Чтение.Организации
	|РегистрНакопления.ЗаказыКлиентов.Чтение.ВнешниеПользователи
	|РегистрНакопления.ЗаказыКлиентов.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаказыКлиентов.Чтение.Организации
	|РегистрНакопления.ЗаказыКлиентов.Чтение.Склады
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Организации
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Подразделения
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Склады
	|РегистрНакопления.ЗаказыНаПеремещение.Чтение.Организации
	|РегистрНакопления.ЗаказыНаПеремещение.Чтение.Склады
	|РегистрНакопления.ЗаказыНаСборку.Чтение.Организации
	|РегистрНакопления.ЗаказыНаСборку.Чтение.Склады
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Организации
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Склады
	|РегистрНакопления.Закупки.Чтение.ГруппыПартнеров
	|РегистрНакопления.Закупки.Чтение.Организации
	|РегистрНакопления.Закупки.Чтение.Подразделения
	|РегистрНакопления.Закупки.Чтение.Склады
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.Организации
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.Склады
	|РегистрНакопления.КнигаДоходовРасходовПоЕдиномуНалогу.Чтение.Организации
	|РегистрНакопления.ЛимитыРасходаДенежныхСредств.Чтение.Организации
	|РегистрНакопления.ЛимитыРасходаДенежныхСредств.Чтение.Подразделения
	|РегистрНакопления.МатериалыИРаботыВПроизводстве.Чтение.Организации
	|РегистрНакопления.НДСНоменклатурныйСоставДляНалоговыхНакладных.Чтение.ГруппыПартнеров
	|РегистрНакопления.НДСНоменклатурныйСоставДляНалоговыхНакладных.Чтение.Организации
	|РегистрНакопления.НДСРасчетНалоговогоКредита.Чтение.ГруппыПартнеров
	|РегистрНакопления.НДСРасчетНалоговогоКредита.Чтение.Организации
	|РегистрНакопления.НДСРасчетНалоговыхОбязательств.Чтение.ГруппыПартнеров
	|РегистрНакопления.НДСРасчетНалоговыхОбязательств.Чтение.Организации
	|РегистрНакопления.НДСРеестрВыданныхНалоговыхДокументов.Чтение.ГруппыПартнеров
	|РегистрНакопления.НДСРеестрВыданныхНалоговыхДокументов.Чтение.Организации
	|РегистрНакопления.НДСРеестрПолученныхНалоговыхДокументов.Чтение.ГруппыПартнеров
	|РегистрНакопления.НДСРеестрПолученныхНалоговыхДокументов.Чтение.Организации
	|РегистрНакопления.НДССоставПоставкиДляРегистрацииВходящихНалоговыхДокументов.Чтение.ГруппыПартнеров
	|РегистрНакопления.НДССоставПоставкиДляРегистрацииВходящихНалоговыхДокументов.Чтение.Организации
	|РегистрНакопления.НДСУсловныеПродажи.Чтение.Организации
	|РегистрНакопления.ОбеспечениеЗаказов.Чтение.Склады
	|РегистрНакопления.ПартииЗатратНаВыпуск.Чтение.Организации
	|РегистрНакопления.ПартииПроизводственныхЗатрат.Чтение.Организации
	|РегистрНакопления.ПартииПрочихРасходов.Чтение.Организации
	|РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров.Чтение.Организации
	|РегистрНакопления.ПартииТоваровОрганизаций.Чтение.Организации
	|РегистрНакопления.ПартииТоваровПереданныеНаКомиссию.Чтение.Организации
	|РегистрНакопления.ПереданнаяВозвратнаяТара.Чтение.ГруппыПартнеров
	|РегистрНакопления.ПереданнаяВозвратнаяТара.Чтение.Организации
	|РегистрНакопления.ПереданнаяВозвратнаяТара.Чтение.Склады
	|РегистрНакопления.ПринятаяВозвратнаяТара.Чтение.ГруппыПартнеров
	|РегистрНакопления.ПринятаяВозвратнаяТара.Чтение.Организации
	|РегистрНакопления.ПринятаяВозвратнаяТара.Чтение.Склады
	|РегистрНакопления.ПрочиеАктивыПассивы.Чтение.Организации
	|РегистрНакопления.ПрочиеДоходы.Чтение.Организации
	|РегистрНакопления.ПрочиеДоходы.Чтение.Подразделения
	|РегистрНакопления.ПрочиеРасходы.Чтение.Организации
	|РегистрНакопления.ПрочиеРасходы.Чтение.Подразделения
	|РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов.Чтение.Организации
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.Организации
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.ЭквайринговыеТерминалы
	|РегистрНакопления.РасчетыСКлиентами.Чтение.ВнешниеПользователи
	|РегистрНакопления.РасчетыСКлиентами.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентами.Чтение.Организации
	|РегистрНакопления.РасчетыСКлиентамиПоДокументам.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентамиПоДокументам.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Чтение.Организации
	|РегистрНакопления.РозничныеПродажиПодакцизныхТоваров.Чтение.Организации	
	|РегистрНакопления.СвободныеОстатки.Чтение.Склады
	|РегистрНакопления.СебестоимостьТоваров.Чтение.Организации
	|РегистрНакопления.ТМЦВЭксплуатации.Чтение.Организации
	|РегистрНакопления.ТМЦВЭксплуатации.Чтение.Подразделения
	|РегистрНакопления.ТоварыВЯчейках.Чтение.Склады
	|РегистрНакопления.ТоварыКОтгрузке.Чтение.Склады
	|РегистрНакопления.ТоварыКОформлениюИзлишковНедостач.Чтение.Склады
	|РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Чтение.ГруппыПартнеров
	|РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Чтение.Организации
	|РегистрНакопления.ТоварыКОформлениюПоступления.Чтение.Склады
	|РегистрНакопления.ТоварыКПоступлению.Чтение.Склады
	|РегистрНакопления.ТоварыНаСкладах.Чтение.Склады
	|РегистрНакопления.ТоварыОрганизаций.Чтение.Организации
	|РегистрНакопления.ТоварыОрганизацийКОформлению.Чтение.ГруппыПартнеров
	|РегистрНакопления.ТоварыОрганизацийКОформлению.Чтение.Организации
	|РегистрНакопления.ТоварыОрганизацийКПередаче.Чтение.Организации
	|РегистрНакопления.ТоварыПереданныеНаКомиссию.Чтение.Организации
	|РегистрНакопления.ФинансовыеРезультаты.Чтение.Организации
	|РегистрНакопления.ФинансовыеРезультаты.Чтение.Подразделения
	|БизнесПроцесс.СогласованиеЦенНоменклатуры.Изменение.Пользователи
	|БизнесПроцесс.ТиповаяПродажа.Чтение.ГруппыПартнеров
	|БизнесПроцесс.ТиповаяПродажа.Чтение.Пользователи
	|БизнесПроцесс.ТиповаяПродажа.Изменение.ГруппыПартнеров
	|БизнесПроцесс.ТиповаяПродажа.Изменение.Пользователи
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЗакупки
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЗаявкиНаВозвратТоваровОтКлиента
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеПродажи
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЦенНоменклатуры
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ТиповаяПродажа
	|";

КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
//  Вызывается из процедур:
// УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа().
//
// Параметры:
//  Ссылка       - СправочникСсылка, ДокументСсылка, ... - ссылка на объект для которого
//                 записаны наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка, ...
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
