
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.ОткрытьПомощникПереходаСУправлениеТорговлей23.Видимость = ЛОЖЬ;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьПомощникЗаполненияНастроекИСправочников(Команда)
	
	ОткрытьФорму("Обработка.ПомощникЗаполненияНастроекИСправочников.Форма");
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПомощникПереходаСУправлениеТорговлей23(Команда)
	
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
