// Возвращает код языка интерфейса в формате ru/uk
Функция КодЯзыкаИнтерфейса() Экспорт
	
	ТекущийЯзык = ТекущийЯзык();
	Если ТипЗнч(ТекущийЯзык) = Тип("Строка") Тогда
		Возврат ТекущийЯзык;
	ИначеЕсли ТекущийЯзык = Неопределено Тогда
		Возврат КодЯзыкаИнформационнойБазы();
	Иначе
		Возврат ТекущийЯзык.КодЯзыка;	
	КонецЕсли; 
	
КонецФункции // КодЯзыкаИнтерфейса()

// Возвращает код языка информационной базы, который указан 
// в региональных настройках (в конфигураторе)
Функция КодЯзыкаИнформационнойБазы() Экспорт
	
	// если код локализации, установленный для базы не украинский - считаем русским
	Возврат ?(Лев(КодЛокализацииИнформационнойБазы(), 2) = "uk", "uk", "ru");
	
КонецФункции // КодЯзыкаИнформационнойБазы()

// Функция возвращает имя языка для формирования нерегламентированных печатных форм
// документов и некоторых справочников с учетом установленного режима в настройках
// пользователя. По умолчанию это язык информационной базы.
//
// Параметры: 
//
// Возвращаемое значение:
//		Строка   – код языка
//
Функция ПолучитьЯзыкФормированияПечатныхФорм() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	РежимПользователя = Константы.РежимФормированияПечатныхФорм.Получить();
	
	Если РежимПользователя = Перечисления.РежимыФормированияПечатныхФорм.НаРусскомЯзыке Тогда
		
		КодЯзыкаПечать = "ru";
		
	ИначеЕсли РежимПользователя = Перечисления.РежимыФормированияПечатныхФорм.НаУкраинскомЯзыке Тогда
		
		КодЯзыкаПечать = "uk";
		
	Иначе // РежимПользователя = Перечисления.РежимыФормированияПечатныхФорм.НаЯзыкеИнформационнойБазы 
		  // или по умолчанию
		 
		КодЯзыкаПечать = ЛокализацияПовтИсп.КодЯзыкаИнформационнойБазы();
		
	КонецЕсли;

	Возврат КодЯзыкаПечать;
	
КонецФункции // ПолучитьЯзыкФормированияПечатныхФорм()

// Преобразует код языка в формат понятный системной фунции Формат()
// Параметры
//  КодЯзыка  	 – Строка – код языка в формате uk/ru
//
// Возвращаемое значение:
//   Строка   	 – код языка в формате ru_RU/uk_UA
//
Функция ОпределитьКодЯзыкаДляФормат(КодЯзыка=Неопределено) Экспорт
	
	Если КодЯзыка=Неопределено Тогда
		КодЯзыка = КодЯзыкаИнтерфейса();
	КонецЕсли; 
	
	Возврат ?(КодЯзыка = "uk","uk_UA","ru_RU");
	
КонецФункции // ОпределитьКодЯзыкаДляФормат()

// По коду языка возвращает строку параметров прописи из справочника Валюты 
//(ПараметрыПрописиНаРусском или ПараметрыПрописиНаУкраинском).
Функция ПараметрыПрописи(Валюта, КодЯзыка) Экспорт
	
	Возврат ?(КодЯзыка = "uk", Валюта.ПараметрыПрописиНаУкраинском, Валюта.ПараметрыПрописиНаРусском);
	
КонецФункции // ПараметрыПрописи()

// Функция содержит в себе представления на 2-х языках для всех объектов
// конфигурации выводимых на печать
Функция ОбработатьПереводы(ПолноеИмяОбъектаМетаданных, ИмяДляПеревода, КодЯзыка) Экспорт

	
		Если ПолноеИмяОбъектаМетаданных = "Документ.АвансовыйОтчет" Тогда 
			Возврат НСтр("ru='Авансовый отчет';uk='Авансовий звіт'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АктВыполненныхРабот" Тогда 
			Возврат НСтр("ru='Акт выполненных работ для клиента';uk='Акт виконаних робіт для клієнта'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АктОРасхожденияхПослеОтгрузки" Тогда 
			Возврат НСтр("ru='Акт о расхождениях после отгрузки';uk='Акт про розбіжності після відвантаження'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АктОРасхожденияхПослеПеремещения" Тогда 
			Возврат НСтр("ru='Акт о расхождениях после перемещения';uk='Акт про розбіжності після переміщення'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АктОРасхожденияхПослеПриемки" Тогда 
			Возврат НСтр("ru='Акт о расхождениях после приемки';uk='Акт про розбіжності після приймання'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АктПриемкиВыполненныхРаботОказанныхУслуг" Тогда 
			Возврат НСтр("ru='Акт приемки выполненных работ';uk='Акт приймання виконаних робіт'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АктПроверкиСтраховыхВзносов" Тогда 
			Возврат НСтр("ru='Доначисление страховых взносов';uk='Донарахування страхових внесків'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АмортизацияНМА" Тогда 
			Возврат НСтр("ru='Амортизация НМА';uk='Амортизація НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АмортизацияНМАМеждународныйУчет" Тогда 
			Возврат НСтр("ru='Амортизация НМА (международный учет)';uk='Амортизація НМА (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АмортизацияОС" Тогда 
			Возврат НСтр("ru='Амортизация основных средств';uk='Амортизація основних засобів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АмортизацияОСМеждународныйУчет" Тогда 
			Возврат НСтр("ru='Амортизация ОС (международный учет)';uk='Амортизація ОЗ (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Анкета" Тогда 
			Возврат НСтр("ru='Анкета';uk='Анкета'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АннулированиеПодарочныхСертификатов" Тогда 
			Возврат НСтр("ru='Аннулирование подарочных сертификатов';uk='Анулювання подарункових сертифікатів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АттестацияРабочихМестДляУчетаСпецстажа" Тогда 
			Возврат НСтр("ru='Аттестация рабочих мест для учета спецстажа';uk='Атестація робочих місць для обліку спецстажу'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.БольничныйЛист" Тогда 
			Возврат НСтр("ru='Больничный лист';uk='Лікарняний лист'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.БронированиеГражданПребывающихВЗапасе" Тогда 
			Возврат НСтр("ru='Бронирование граждан';uk='Бронювання громадян'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВводВыводДенежныхСредствПоНаправлению" Тогда 
			Возврат НСтр("ru='Ввод\вывод денежных средств по направлению';uk='Введення\виведення грошових коштів за напрямом'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВводНачальныхОстатковОтпусков" Тогда 
			Возврат НСтр("ru='Ввод начальных остатков отпусков';uk='Введення початкових залишків відпусток'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВводОстатков" Тогда 
			Возврат НСтр("ru='Ввод начальных остатков';uk='Введення початкових залишків'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВводОстатковВнеоборотныхАктивов" Тогда 
			Возврат НСтр("ru='Ввод остатков необоротных активов';uk='Введення залишків необоротних активів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВводОстатковНМАМеждународныйУчет" Тогда 
			Возврат НСтр("ru='Ввод остатков НМА (международный учет)';uk='Введення залишків НМА (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВводОстатковОСМеждународныйУчет" Тогда 
			Возврат НСтр("ru='Ввод остатков ОС (международный учет)';uk='Введення залишків ОЗ (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВедомостьНаВыплатуЗарплатыВБанк" Тогда 
			Возврат НСтр("ru='Ведомость в банк';uk='Відомість в банк'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВедомостьНаВыплатуЗарплатыВКассу" Тогда 
			Возврат НСтр("ru='Ведомость в кассу';uk='Відомість в касу'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВедомостьНаВыплатуЗарплатыПеречислением" Тогда 
			Возврат НСтр("ru='Ведомость перечислений на счета';uk='Відомість перерахувань на рахунки'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком" Тогда 
			Возврат НСтр("ru='Ведомость выплаты через раздатчика';uk='Відомість виплати через роздавальника'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВзаимозачетЗадолженности" Тогда 
			Возврат НСтр("ru='Взаимозачет задолженности';uk='Взаємозалік заборгованості'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВнесениеДенежныхСредствВКассуККМ" Тогда 
			Возврат НСтр("ru='Внесение денежных средств в кассу ККМ';uk='Внесення грошових коштів в касу ККМ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВнутреннееПотреблениеТоваров" Тогда 
			Возврат НСтр("ru='Внутреннее потребление товаров';uk='Внутрішнє споживання товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратИзОтпускаПоУходуЗаРебенком" Тогда 
			Возврат НСтр("ru='Возврат из отпуска по уходу';uk='Повернення з відпустки по догляду'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратМатериаловИзПроизводства" Тогда 
			Возврат НСтр("ru='Возврат материалов из производства';uk='Повернення матеріалів з виробництва'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратОСОтАрендатора" Тогда 
			Возврат НСтр("ru='Возврат ОС от арендатора';uk='Повернення ОЗ від орендаря'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратПодарочныхСертификатов" Тогда 
			Возврат НСтр("ru='Возврат подарочных сертификатов';uk='Повернення подарункових сертифікатів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратСырьяДавальцу" Тогда 
			Возврат НСтр("ru='Возврат сырья давальцу';uk='Повернення сировини давальцю'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратСырьяОтПереработчика" Тогда 
			Возврат НСтр("ru='Возврат сырья от переработчика';uk='Повернення сировини від переробника'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратТоваровМеждуОрганизациями" Тогда 
			Возврат НСтр("ru='Возврат товаров между организациями';uk='Повернення товарів між організаціями'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратТоваровОтКлиента" Тогда 
			Возврат НСтр("ru='Возврат товаров от клиента';uk='Повернення товарів від клієнта'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратТоваровПоставщику" Тогда 
			Возврат НСтр("ru='Возврат товаров поставщику';uk='Повернення товарів постачальнику'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Встреча" Тогда 
			Возврат НСтр("ru='Встреча';uk='Зустріч'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВходящаяСправкаОЗаработкеДляРасчетаПособий" Тогда 
			Возврат НСтр("ru='Входящая справка о заработке для расчета пособий';uk='Вхідна довідка про заробіток для розрахунку допомоги'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВходящаяСправкаОРасчетеБольничного" Тогда 
			Возврат НСтр("ru='Входящая справка о расчете больничного';uk='Вхідна довідка про розрахунок лікарняного'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВыбытиеАрендованныхОС" Тогда 
			Возврат НСтр("ru='Выбытие арендованных ОС';uk='Вибуття орендованих ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВыбытиеДенежныхДокументов" Тогда 
			Возврат НСтр("ru='Выбытие денежных документов';uk='Вибуття грошових документів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВыгрузкаРегламентированныхОтчетов" Тогда 
			Возврат НСтр("ru='Выгрузка регламентированных отчетов';uk='Вивантаження регламентованих звітів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВыемкаДенежныхСредствИзКассыККМ" Тогда 
			Возврат НСтр("ru='Выемка денежных средств из кассы ККМ';uk='Виймання грошових коштів з каси ККМ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВыкупВозвратнойТарыКлиентом" Тогда 
			Возврат НСтр("ru='Выкуп возвратной тары клиентом';uk='Викуп зворотної тари клієнтом'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВыкупВозвратнойТарыУПоставщика" Тогда 
			Возврат НСтр("ru='Выкуп возвратной тары у поставщика';uk='Викуп зворотної тари в постачальника'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВыплатаБывшимСотрудникам" Тогда 
			Возврат НСтр("ru='Выплата бывшим сотрудникам';uk='Виплата колишнім співробітникам'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВыпускПродукции" Тогда 
			Возврат НСтр("ru='Выпуск продукции и выполнение работ';uk='Випуск продукції і виконання робіт'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВыработкаНМА" Тогда 
			Возврат НСтр("ru='Выработка НМА';uk='Виробіток НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВыработкаСотрудников" Тогда 
			Возврат НСтр("ru='Выработка сотрудников';uk='Виробіток співробітників'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ГрафикИсполненияДоговора" Тогда 
			Возврат НСтр("ru='График исполнения договора';uk='Графік виконання договору'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ГрафикОтпусков" Тогда 
			Возврат НСтр("ru='График отпусков';uk='Графік відпусток'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ДанныеДляРасчетаЗарплаты" Тогда 
			Возврат НСтр("ru='Данные для расчета зарплаты';uk='Дані для розрахунку зарплати'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ДвижениеПрочихАктивовПассивов" Тогда 
			Возврат НСтр("ru='Движение прочих активов и пассивов';uk='Рух інших активів і пасивів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ДепонированиеЗарплаты" Тогда 
			Возврат НСтр("ru='Депонирование зарплаты';uk='Депонування зарплати'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ДоверенностьВыданная" Тогда 
			Возврат НСтр("ru='Выданная доверенность';uk='Видана довіреність'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ДоговорАвторскогоЗаказа" Тогда 
			Возврат НСтр("ru='Договор авторского заказа';uk='Договір авторського замовлення'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ДоговорЗаймаСотруднику" Тогда 
			Возврат НСтр("ru='Договор займа сотруднику';uk='Договір позики співробітнику'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ДоговорРаботыУслуги" Тогда 
			Возврат НСтр("ru='Договор (работы, услуги)';uk='Договір (роботи, послуги)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ДокументРасчетовСКонтрагентом" Тогда 
			Возврат НСтр("ru='Документ расчетов с контрагентом';uk='Документ розрахунків з контрагентом'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ДоступностьВидаРабочихЦентров" Тогда 
			Возврат НСтр("ru='Доступность вида рабочих центров';uk='Доступність виду робочих центрів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ДоступностьРабочихЦентров" Тогда 
			Возврат НСтр("ru='Доступность рабочих центров';uk='Доступність робочих центрів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ДоходВНатуральнойФорме" Тогда 
			Возврат НСтр("ru='Доход в натуральной форме';uk='Дохід у натуральній формі'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЕдиновременноеПособиеЗаСчетФСС" Тогда 
			Возврат НСтр("ru='Единовременное пособие за счет социльного страхования';uk='Одноразова допомога за рахунок соціального страхування'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаданиеНаПеревозку" Тогда 
			Возврат НСтр("ru='Задание на перевозку';uk='Завдання на перевезення'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаданиеТорговомуПредставителю" Тогда 
			Возврат НСтр("ru='Задание торговому представителю';uk='Завдання торговому представнику'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказДавальца" Тогда 
			Возврат НСтр("ru='Заказ давальца';uk='Замовлення давальця'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказКлиента" Тогда 
			Возврат НСтр("ru='Заказ клиента';uk='Замовлення клієнта'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказМатериаловВПроизводство" Тогда 
			Возврат НСтр("ru='Заказ материалов в производство';uk='Замовлення матеріалів у виробництво'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказНаВнутреннееПотребление" Тогда 
			Возврат НСтр("ru='Заказ на внутреннее потребление';uk='Замовлення на внутрішнє споживання'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказНаПеремещение" Тогда 
			Возврат НСтр("ru='Заказ на перемещение';uk='Замовлення на переміщення'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказНаПроизводство" Тогда 
			Возврат НСтр("ru='Заказ на производство';uk='Замовлення на виробництво'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказНаРемонт" Тогда 
			Возврат НСтр("ru='Заказ на ремонт';uk='Замовлення на ремонт'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказНаСборку" Тогда 
			Возврат НСтр("ru='Заказ на сборку (разборку)';uk='Замовлення на збирання (розбирання)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказПереработчику" Тогда 
			Возврат НСтр("ru='Заказ переработчику';uk='Замовлення переробнику'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказПоставщику" Тогда 
			Возврат НСтр("ru='Заказ поставщику';uk='Замовлення постачальнику'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗапланированноеВзаимодействие" Тогда 
			Возврат НСтр("ru='Запланированное взаимодействие';uk='Запланована взаємодія'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаявкаНаВозвратТоваровОтКлиента" Тогда 
			Возврат НСтр("ru='Заявка на возврат товаров от клиента';uk='Заявка на повернення товарів від клієнта'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников" Тогда 
			Возврат НСтр("ru='Заявка на закрытие лицевых счетов';uk='Заявка на закриття особових рахунків'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников" Тогда 
			Возврат НСтр("ru='Заявка на открытие лицевых счетов';uk='Заявка на відкриття особових рахунків'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаявкаНаПокупкуПродажуВалюты" Тогда 
			Возврат НСтр("ru='(не используется) Заявка на покупку-продажу валюты';uk='(не використовується) Заявка на купівлю-продаж валюти'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаявкаНаРасходованиеДенежныхСредств" Тогда 
			Возврат НСтр("ru='Заявка на расходование денежных средств';uk='Заявка на витрачання грошових коштів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаявлениеНаПредоставлениеЛьготыПоНДФЛ" Тогда 
			Возврат НСтр("ru='Заявление на применение льготы по НДФЛ';uk='Заява на застосування пільги з ПДФО'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаявлениеРасчетВФСС" Тогда 
			Возврат НСтр("ru='Заявление-расчет по социальному страхованию';uk='Заява-розрахунок з соціального страхування'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзделияИЗатратыНЗП" Тогда 
			Возврат НСтр("ru='Изделия и затраты НЗП';uk='Вироби і витрати НЗВ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеАванса" Тогда 
			Возврат НСтр("ru='Изменение аванса';uk='Зміна авансу'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеАссортимента" Тогда 
			Возврат НСтр("ru='Изменение ассортимента';uk='Зміна асортименту'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеГрафикаРаботыСписком" Тогда 
			Возврат НСтр("ru='Изменение графика работы списком';uk='Зміна графіка роботи списком'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеКвалификационногоРазряда" Тогда 
			Возврат НСтр("ru='Изменение квалификационного разряда (категории) сотрудника';uk='Зміна кваліфікаційного розряду (категорії) співробітника'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеМестРаботы" Тогда 
			Возврат НСтр("ru='Изменение мест работы';uk='Зміна місць роботи'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеОплатыТруда" Тогда 
			Возврат НСтр("ru='Изменение оплаты труда';uk='Зміна оплати праці'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеПараметровНМА" Тогда 
			Возврат НСтр("ru='Изменение параметров НМА';uk='Зміна параметрів НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеПараметровНМАМеждународныйУчет" Тогда 
			Возврат НСтр("ru='Изменение параметров НМА (международный учет)';uk='Зміна параметрів НМА (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеПараметровОС" Тогда 
			Возврат НСтр("ru='Изменение параметров ОС';uk='Зміна параметрів ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеПараметровОСМеждународныйУчет" Тогда 
			Возврат НСтр("ru='Изменение параметров ОС (международный учет)';uk='Зміна параметрів ОЗ (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеПлановыхНачислений" Тогда 
			Возврат НСтр("ru='Изменение плановых начислений';uk='Зміна планових нарахувань'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеСостоянияОС" Тогда 
			Возврат НСтр("ru='Изменение состояния ОС';uk='Зміна стану ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеУсловийДоговораЗаймаСотруднику" Тогда 
			Возврат НСтр("ru='Изменение условий договора займа сотруднику';uk='Зміна умов договору позики співробітникові'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеУсловийИсполнительногоЛиста" Тогда 
			Возврат НСтр("ru='Изменение условий исполнительного листа';uk='Зміна умов виконавчого листа'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком" Тогда 
			Возврат НСтр("ru='Изменение условий отпуска по уходу за ребенком';uk='Зміна умов відпустки по догляду за дитиною'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеШтатногоРасписания" Тогда 
			Возврат НСтр("ru='Изменение штатного расписания';uk='Зміна штатного розкладу'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИнвентаризационнаяОпись" Тогда 
			Возврат НСтр("ru='Инвентаризационная опись';uk='Інвентаризаційний опис'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИнвентаризацияНаличныхДенежныхСредств" Тогда 
			Возврат НСтр("ru='Инвентаризация наличных денежных средств';uk='Інвентаризація готівки'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИнвентаризацияНМА" Тогда 
			Возврат НСтр("ru='Инвентаризация НМА';uk='Інвентаризація НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИнвентаризацияОС" Тогда 
			Возврат НСтр("ru='Инвентаризация ОС';uk='Інвентаризація ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИндексацияЗаработка" Тогда 
			Возврат НСтр("ru='Индексация заработка';uk='Індексація заробітку'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИндексацияШтатногоРасписания" Тогда 
			Возврат НСтр("ru='Индексация штатного расписания';uk='Індексація штатного розкладу'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИндивидуальныйГрафик" Тогда 
			Возврат НСтр("ru='Индивидуальный график';uk='Індивідуальний графік'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИсполнительныйЛист" Тогда 
			Возврат НСтр("ru='Исполнительный лист';uk='Виконавчий лист'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КадровыйПеревод" Тогда 
			Возврат НСтр("ru='Кадровый перевод';uk='Кадрове переведення'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КадровыйПереводСписком" Тогда 
			Возврат НСтр("ru='Кадровый перевод списком';uk='Кадрове переведення списком'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КассоваяСмена" Тогда 
			Возврат НСтр("ru='Кассовая смена';uk='Касова зміна'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Командировка" Тогда 
			Возврат НСтр("ru='Командировка';uk='Відрядження'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КомандировкиСотрудников" Тогда 
			Возврат НСтр("ru='Командировка группы';uk='Відрядження групи'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КоммерческоеПредложениеКлиенту" Тогда 
			Возврат НСтр("ru='Коммерческое предложение клиенту';uk='Комерційна пропозиція клієнту'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КомпенсацияЗаЗадержкуЗарплаты" Тогда 
			Возврат НСтр("ru='Компенсация за задержку выплаты заработной платы';uk='Компенсація за затримку виплати заробітної плати'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаЗаказаМатериаловВПроизводство" Тогда 
			Возврат НСтр("ru='Корректировка заказа материалов в производство';uk='Коригування замовлення матеріалів у виробництво'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаНазначенияТоваров" Тогда 
			Возврат НСтр("ru='Корректировка назначения товаров';uk='Коригування призначення товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаНалоговогоНазначенияЗапасов" Тогда 
			Возврат НСтр("ru='Корректировка налогового назначения запасов';uk='Коригування податкового призначення запасів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаНалоговогоНазначенияКапитальныхИнвестиций" Тогда 
			Возврат НСтр("ru='Корректировка налогового назначения капитальных инвестиций';uk='Коригування податкового призначення капітальних інвестицій'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаНалоговогоНазначенияОС" Тогда 
			Возврат НСтр("ru='Корректировка налогового назначения ОС';uk='Коригування податкового призначення ОС'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаОбособленногоУчетаЗапасов" Тогда 
			Возврат НСтр("ru='Корректировка обособленного учета запасов';uk='Коригування відокремленого обліку запасів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаПоОрдеруНаТовары" Тогда 
			Возврат НСтр("ru='Корректировка по ордеру на товары';uk='Коригування по ордеру на товари'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаПоступления" Тогда 
			Возврат НСтр("ru='ѳ(не украинский) Корректировка поступления';uk='ѳ(не український) Коригування надходження'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаРеализации" Тогда 
			Возврат НСтр("ru='ѳ(не украинский) Корректировка реализации';uk='ѳ(не український) Коригування реалізації'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаРегистров" Тогда 
			Возврат НСтр("ru='Корректировка регистров';uk='Коригування регістрів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЛимитыРасходаДенежныхСредств" Тогда 
			Возврат НСтр("ru='Лимиты расхода денежных средств';uk='Ліміти витрачання грошових коштів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЛистКассовойКниги" Тогда 
			Возврат НСтр("ru='Лист кассовой книги';uk='Сторінка касової книги'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЛистокСообщенияДляВоенкомата" Тогда 
			Возврат НСтр("ru='Листок сообщения об изменениях';uk='Листок повідомлення про зміни'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.МаршрутныйЛистПроизводства" Тогда 
			Возврат НСтр("ru='Маршрутный лист производства';uk='Маршрутний лист виробництва'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.МатериальнаяПомощь" Тогда 
			Возврат НСтр("ru='Материальная помощь';uk='Матеріальна допомога'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.МодернизацияНМА" Тогда 
			Возврат НСтр("ru='Модернизация НМА';uk='Модернізація НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.МодернизацияОС" Тогда 
			Возврат НСтр("ru='Модернизация ОС';uk='Модернізація ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НазначениеОпросов" Тогда 
			Возврат НСтр("ru='Проведение опросов';uk='Проведення опитувань'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НазначениеПлановогоНачисления" Тогда 
			Возврат НСтр("ru='Назначение планового начисления';uk='Призначення планового нарахування'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НазначениеПодработки" Тогда 
			Возврат НСтр("ru='Назначение подработки';uk='Призначення підробітку'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НалоговаяНакладная" Тогда 
			Возврат НСтр("ru='Налоговая накладная';uk='Податкова накладна'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НачальнаяЗадолженностьПоЗарплате" Тогда 
			Возврат НСтр("ru='Начальная задолженность по зарплате';uk='Початкова заборгованість по зарплаті'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НачальнаяШтатнаяРасстановка" Тогда 
			Возврат НСтр("ru='Начальная штатная расстановка';uk='Початкова штатна розстановка'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НачислениеДивидендов" Тогда 
			Возврат НСтр("ru='Начисление дивидендов';uk='Нарахування дивідендів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НачислениеЗаПервуюПоловинуМесяца" Тогда 
			Возврат НСтр("ru='Начисление за первую половину месяца';uk='Нарахування за першу половину місяця'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НачислениеЗарплаты" Тогда 
			Возврат НСтр("ru='Начисление зарплаты и взносов';uk='Нарахування зарплати та внесків'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НачислениеИСписаниеБонусныхБаллов" Тогда 
			Возврат НСтр("ru='Начисление и списание бонусных баллов';uk='Нарахування та списання бонусних балів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НачислениеОценочныхОбязательствПоОтпускам" Тогда 
			Возврат НСтр("ru='Начисление оценочных обязательств по отпускам';uk='Нарахування оціночних зобов'язань щодо відпусток'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НачисленияКредитовИДепозитов" Тогда 
			Возврат НСтр("ru='Начисления по кредитам и депозитам';uk='Нарахування за кредитами і депозитами'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.НормативРаспределенияПлановПродажПоКатегориям" Тогда 
			Возврат НСтр("ru='Норматив распределения планов продаж по категориям';uk='Норматив розподілу планів продажів за категоріями'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОжидаемоеПоступлениеДенежныхСредств" Тогда 
			Возврат НСтр("ru='Ожидаемое поступление денежных средств';uk='Очікуване надходження грошових коштів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОперацияБух" Тогда 
			Возврат НСтр("ru='Операция (регламентированный учет)';uk='Операція (регламентований облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОперацияМеждународный" Тогда 
			Возврат НСтр("ru='Операция (международный учет)';uk='Операція (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОперацияНалоговогоУчетаПоНДФЛ" Тогда 
			Возврат НСтр("ru='Операция учета НДФЛ';uk='Операція обліку ПДФО'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОперацияПоПлатежнойКарте" Тогда 
			Возврат НСтр("ru='Операция по платежной карте';uk='Операція по платіжній карті'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОперацияУчетаПоСтраховымВзносам" Тогда 
			Возврат НСтр("ru='Операция учета взносов';uk='Операція обліку внесків'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОплатаПоСреднемуЗаработку" Тогда 
			Возврат НСтр("ru='Отсутствие с сохранением оплаты';uk='Відсутність із збереженням оплати'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОприходованиеИзлишковТоваров" Тогда 
			Возврат НСтр("ru='Оприходование излишков товаров';uk='Оприбуткування надлишків товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОрдерНаОтражениеИзлишковТоваров" Тогда 
			Возврат НСтр("ru='Ордер на отражение излишков товаров';uk='Ордер на відображення надлишків товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОрдерНаОтражениеНедостачТоваров" Тогда 
			Возврат НСтр("ru='Ордер на отражение недостач товаров';uk='Ордер на відображення нестач товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОрдерНаОтражениеПорчиТоваров" Тогда 
			Возврат НСтр("ru='Ордер на отражение порчи товаров';uk='Ордер на відображення псування товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОрдерНаПеремещениеТоваров" Тогда 
			Возврат НСтр("ru='Ордер на перемещение товаров';uk='Ордер на переміщення товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтборРазмещениеТоваров" Тогда 
			Возврат НСтр("ru='Отбор (размещение) товаров';uk='Відбір (розміщення) товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Отгул" Тогда 
			Возврат НСтр("ru='Отгул';uk='Відгул'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтменаБронированияГражданПребывающихВЗапасе" Тогда 
			Возврат НСтр("ru='Отмена бронирования граждан';uk='Скасування бронювання громадян'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтменаДоплатыДоСреднегоЗаработка" Тогда 
			Возврат НСтр("ru='Отмена доплаты до среднего заработка';uk='Скасування доплати до середнього заробітку'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтменаСовмещения" Тогда 
			Возврат НСтр("ru='Отмена совмещения';uk='Скасування суміщення'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Отпуск" Тогда 
			Возврат НСтр("ru='Отпуск';uk='Відпустка'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтпускаСотрудников" Тогда 
			Возврат НСтр("ru='Отпуск сотрудников';uk='Відпустка співробітників'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтпускБезСохраненияОплаты" Тогда 
			Возврат НСтр("ru='Отпуск без сохранения оплаты';uk='Відпустка без збереження оплати'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтпускПоУходуЗаРебенком" Тогда 
			Возврат НСтр("ru='Отпуск по уходу за ребенком';uk='Відпустка по догляду за дитиною'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтражениеЗарплатыВФинансовомУчете" Тогда 
			Возврат НСтр("ru='Отражение зарплаты в финансовом учете';uk='Відображення зарплати в фінансовому обліку'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтражениеРасхожденийПриИнкассацииДенежныхСредств" Тогда 
			Возврат НСтр("ru='Отражение расхождений при инкассации денежных средств';uk='Відображення розбіжностей при інкасації грошових коштів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетБанкаПоОперациямЭквайринга" Тогда 
			Возврат НСтр("ru='Отчет банка по операциям эквайринга';uk='Звіт банку за операціями еквайрингу'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетДавальцу" Тогда 
			Возврат НСтр("ru='Отчет давальцу';uk='Звіт давальцю'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетКомиссионера" Тогда 
			Возврат НСтр("ru='Отчет комиссионера о продажах';uk='Звіт комісіонера про продажі'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетКомиссионераОСписании" Тогда 
			Возврат НСтр("ru='Отчет комиссионера о списании';uk='Звіт комісіонера про списання'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетКомитенту" Тогда 
			Возврат НСтр("ru='Отчет комитенту о продажах';uk='Звіт комітенту про продажі'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетКомитентуОСписании" Тогда 
			Возврат НСтр("ru='Отчет комитенту о списании';uk='Звіт комітенту про списання'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетОРозничнойВыручке" Тогда 
			Возврат НСтр("ru='Отчет о розничной выручке (Z-отчет)';uk='Звіт про роздрібний виторг (Z-звіт)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетОРозничныхПродажах" Тогда 
			Возврат НСтр("ru='Отчет о розничных продажах';uk='Звіт про роздрібні продажі'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетПереработчика" Тогда 
			Возврат НСтр("ru='Отчет переработчика';uk='Звіт переробника'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетПоКомиссииМеждуОрганизациями" Тогда 
			Возврат НСтр("ru='Отчет по комиссии между организациями';uk='Звіт з комісії між організаціями'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании" Тогда 
			Возврат НСтр("ru='Отчет по комиссии между организациями о списании';uk='Звіт з комісії між організаціями про списання'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПакетЭД" Тогда 
			Возврат НСтр("ru='Пакет электронных документов';uk='Пакет електронних документів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПереводКДругомуРаботодателю" Тогда 
			Возврат НСтр("ru='Перевод к другому работодателю';uk='Переведення до іншого роботодавця'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет" Тогда 
			Возврат НСтр("ru='Перевод основных средств и инвестиционного имущества (международный учет)';uk='Переведення основних засобів та інвестиційного майна (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаДавальцу" Тогда 
			Возврат НСтр("ru='Передача давальцу';uk='Передача давальцю'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаМатериаловВПроизводство" Тогда 
			Возврат НСтр("ru='Передача материалов в производство';uk='Передача матеріалів у виробництво'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаОСАрендатору" Тогда 
			Возврат НСтр("ru='Передача ОС арендатору';uk='Передача ОЗ орендарю'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаСырьяПереработчику" Тогда 
			Возврат НСтр("ru='Передача сырья переработчику';uk='Передача сировини переробнику'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаТоваровМеждуОрганизациями" Тогда 
			Возврат НСтр("ru='Передача товаров между организациями';uk='Передача товарів між організаціями'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПеремещениеВДругоеПодразделение" Тогда 
			Возврат НСтр("ru='Перемещение в другое подразделение';uk='Переміщення в інший підрозділ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПеремещениеВЭксплуатации" Тогда 
			Возврат НСтр("ru='Перемещение в эксплуатации';uk='Переміщення в експлуатації'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПеремещениеМатериаловВПроизводстве" Тогда 
			Возврат НСтр("ru='Перемещение материалов в производстве';uk='Переміщення матеріалів у виробництві'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПеремещениеМеждуТерриториями" Тогда 
			Возврат НСтр("ru='Перемещение между территориями';uk='Переміщення між територіями'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПеремещениеНМА" Тогда 
			Возврат НСтр("ru='Перемещение НМА';uk='Переміщення НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПеремещениеНМАМеждународныйУчет" Тогда 
			Возврат НСтр("ru='Перемещение НМА (международный учет)';uk='Переміщення НМА (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПеремещениеОС" Тогда 
			Возврат НСтр("ru='Перемещение ОС';uk='Переміщення ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПеремещениеОСМеждународныйУчет" Тогда 
			Возврат НСтр("ru='Перемещение ОС (международный учет)';uk='Переміщення ОЗ (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПеремещениеТоваров" Тогда 
			Возврат НСтр("ru='Перемещение товаров';uk='Переміщення товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПереносДанных" Тогда 
			Возврат НСтр("ru='Перенос данных';uk='Перенесення даних'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПереносОтпуска" Тогда 
			Возврат НСтр("ru='Перенос отпуска';uk='Перенесення відпустки'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПереоценкаВалютныхСредств" Тогда 
			Возврат НСтр("ru='Расчет курсовых разниц';uk='Розрахунок курсових різниць'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПереоценкаНМА" Тогда 
			Возврат НСтр("ru='Переоценка НМА';uk='Переоцінка нематеріального активу'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПереоценкаОС" Тогда 
			Возврат НСтр("ru='Переоценка ОС';uk='Переоцінка ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПерерасчетНДФЛ" Тогда 
			Возврат НСтр("ru='Перерасчет НДФЛ';uk='Перерахунок ПДФО'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС" Тогда 
			Возврат НСтр("ru='Перерасчет пропорционального НДС по товарам и ОС';uk='Перерахунок пропорційного ПДВ за товарами та ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПересортицаТоваров" Тогда 
			Возврат НСтр("ru='Пересортица товаров';uk='Пересортиця товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПересчетТоваров" Тогда 
			Возврат НСтр("ru='Пересчет товаров';uk='Перерахунок товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПериодыОплаченныеДоНачалаЭксплуатации" Тогда 
			Возврат НСтр("ru='Периоды, оплаченные до начала эксплуатации';uk='Періоди, сплачені до початку експлуатації'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПланЗакупок" Тогда 
			Возврат НСтр("ru='План закупок';uk='План купівель'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПлановаяКалькуляция" Тогда 
			Возврат НСтр("ru='Плановая калькуляция';uk='Планова калькуляція'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПланПродаж" Тогда 
			Возврат НСтр("ru='План продаж по номенклатуре';uk='План продажів по номенклатурі'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПланПродажПоКатегориям" Тогда 
			Возврат НСтр("ru='План продаж по категориям';uk='План продажів по категоріях'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПланПроизводства" Тогда 
			Возврат НСтр("ru='План производства';uk='План виробництва'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПланСборкиРазборки" Тогда 
			Возврат НСтр("ru='План сборки (разборки)';uk='План збирання (розбирання)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПодготовкаКПередачеНМА" Тогда 
			Возврат НСтр("ru='Подготовка к передаче НМА';uk='Підготовка до передачі НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПодготовкаКПередачеОС" Тогда 
			Возврат НСтр("ru='Подготовка к передаче ОС';uk='Підготовка до передачі ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПодтверждениеВыплатЗаСчетФСС" Тогда 
			Возврат НСтр("ru='Подтверждение выплат за счет социального страхования';uk='Підтвердження виплат за рахунок соціального страхування'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПодтверждениеЗачисленияЗарплаты" Тогда 
			Возврат НСтр("ru='Подтверждение зачисления зарплаты';uk='Підтвердження зарахування зарплати'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПодтверждениеОплатыЗаявленияРасчетаВФСС" Тогда 
			Возврат НСтр("ru='Подтверждение оплаты заявления расчета по социальному страхованию';uk='Підтвердження оплати заяви розрахунку з соціального страхування'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников" Тогда 
			Возврат НСтр("ru='Подтверждение открытия счетов';uk='Підтвердження відкриття рахунків'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПокупкаПродажаВалюты" Тогда 
			Возврат НСтр("ru='(не используется) Покупка-продажа валюты';uk='(не використовується) Купівля-продаж валюти'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоручениеЭкспедитору" Тогда 
			Возврат НСтр("ru='Поручение экспедитору';uk='Доручення експедитору'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПорчаТоваров" Тогда 
			Возврат НСтр("ru='Порча товаров';uk='Псування товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПостоянноеУдержаниеВПользуТретьихЛиц" Тогда 
			Возврат НСтр("ru='Постоянное удержание в пользу третьих лиц';uk='Постійне утримання на користь третіх осіб'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеАрендованныхОС" Тогда 
			Возврат НСтр("ru='Поступление арендованных ОС';uk='Надходження орендованих ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеБезналичныхДенежныхСредств" Тогда 
			Возврат НСтр("ru='Поступление безналичных денежных средств';uk='Надходження безготівкових коштів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеДенежныхДокументов" Тогда 
			Возврат НСтр("ru='Поступление денежных документов';uk='Надходження грошових документів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеОтПереработчика" Тогда 
			Возврат НСтр("ru='Поступление от переработчика';uk='Надходження від переробника'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеПредметовЛизинга" Тогда 
			Возврат НСтр("ru='Поступление предметов лизинга';uk='Надходження предметів лізингу'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеСырьяОтДавальца" Тогда 
			Возврат НСтр("ru='Поступление сырья от давальца';uk='Надходження сировини від давальця'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеТоваровУслуг" Тогда 
			Возврат НСтр("ru='Поступление товаров и услуг';uk='Надходження товарів і послуг'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеУслугПоЛизингу" Тогда 
			Возврат НСтр("ru='Поступление услуг по лизингу';uk='Надходження послуг по лізингу'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеУслугПрочихАктивов" Тогда 
			Возврат НСтр("ru='Поступление услуг и прочих активов';uk='Надходження послуг та інших активів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПрекращениеЛьготПоНДФЛ" Тогда 
			Возврат НСтр("ru='Отмена льгот по НДФЛ';uk='Скасування пільг з ПДФО'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПрекращениеПлановогоНачисления" Тогда 
			Возврат НСтр("ru='Прекращение планового начисления';uk='Припинення планового нарахування'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПрекращениеПодработки" Тогда 
			Возврат НСтр("ru='Прекращение подработки';uk='Припинення підробітку'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Премия" Тогда 
			Возврат НСтр("ru='Премия';uk='Премія'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПриемНаРаботу" Тогда 
			Возврат НСтр("ru='Прием на работу';uk='Прийом на роботу'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПриемНаРаботуСписком" Тогда 
			Возврат НСтр("ru='Прием на работу списком';uk='Прийом на роботу списком'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПризПодарок" Тогда 
			Возврат НСтр("ru='Приз, подарок';uk='Приз, подарунок'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПриказНаДоплатуДоСреднегоЗаработка" Тогда 
			Возврат НСтр("ru='Приказ на доплату до среднего заработка';uk='Наказ на доплату до середнього заробітку'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Приложение2КНалоговойНакладной" Тогда 
			Возврат НСтр("ru='Приложение 2 к налоговой накладной';uk='Додаток 2 до податкової накладної'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПринятиеКУчетуНМА" Тогда 
			Возврат НСтр("ru='Принятие к учету НМА';uk='Прийняття до обліку НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПринятиеКУчетуНМАМеждународныйУчет" Тогда 
			Возврат НСтр("ru='Принятие к учету НМА (международный учет)';uk='Прийняття до обліку НМА (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПринятиеКУчетуОС" Тогда 
			Возврат НСтр("ru='Принятие к учету ОС';uk='Прийняття до обліку ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПринятиеКУчетуОСМеждународныйУчет" Тогда 
			Возврат НСтр("ru='Принятие к учету ОС (международный учет)';uk='Прийняття до обліку ОЗ (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПриходныйКассовыйОрдер" Тогда 
			Возврат НСтр("ru='Приходный кассовый ордер';uk='Прибутковий касовий ордер'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПриходныйОрдерНаТовары" Тогда 
			Возврат НСтр("ru='Приходный ордер на товары';uk='Прибутковий ордер на товари'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПрогулНеявка" Тогда 
			Возврат НСтр("ru='Прогул, неявка';uk='Прогул, неявка'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПродлениеКонтрактаДоговора" Тогда 
			Возврат НСтр("ru='Продление контракта, договора';uk='Продовження контракту, договору'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПроизвольныйЭД" Тогда 
			Возврат НСтр("ru='Произвольный электронный документ';uk='Довільний електронний документ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПростойСотрудников" Тогда 
			Возврат НСтр("ru='Простой сотрудников';uk='Простій співробітників'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПроцессПодготовкиБюджетов" Тогда 
			Возврат НСтр("ru='Процесс подготовки бюджетов';uk='Процес підготовки бюджетів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПрочееОприходованиеТоваров" Тогда 
			Возврат НСтр("ru='Прочее оприходование товаров';uk='Інше оприбуткування товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПрочиеДоходыРасходы" Тогда 
			Возврат НСтр("ru='Отражение прочих доходов и расходов';uk='Відображення інших доходів і витрат'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РаботаВВыходныеИПраздничныеДни" Тогда 
			Возврат НСтр("ru='Работа в выходные и праздничные дни';uk='Робота у вихідні та святкові дні'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РаботаСверхурочно" Тогда 
			Возврат НСтр("ru='Работа сверхурочно';uk='Робота понаднормово'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РазовоеНачисление" Тогда 
			Возврат НСтр("ru='Разовое начисление';uk='Разове нарахування'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РазрешениеНаЗаменуМатериалов" Тогда 
			Возврат НСтр("ru='Разрешение на замену материалов';uk='Дозвіл на заміну матеріалів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РаспоряжениеНаПеремещениеДенежныхСредств" Тогда 
			Возврат НСтр("ru='Распоряжение на перемещение денежных средств';uk='Розпорядження на переміщення грошових коштів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РаспределениеДоходовИРасходовПоНаправлениямДеятельности" Тогда 
			Возврат НСтр("ru='Распределение доходов и расходов по направлениям деятельности';uk='Розподіл доходів і витрат за напрямами діяльності'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РаспределениеОсновногоЗаработка" Тогда 
			Возврат НСтр("ru='Распределение основного заработка';uk='Розподіл основного заробітку'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РаспределениеПроизводственныхЗатрат" Тогда 
			Возврат НСтр("ru='Распределение материалов и работ';uk='Розподіл матеріалів і робіт'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РаспределениеПрочихЗатрат" Тогда 
			Возврат НСтр("ru='Распределение расходов на себестоимость продукции';uk='Розподіл витрат на собівартість продукції'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РаспределениеРасходовБудущихПериодов" Тогда 
			Возврат НСтр("ru='Распределение расходов будущих периодов';uk='Розподіл витрат майбутніх періодів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РассылкаКлиентам" Тогда 
			Возврат НСтр("ru='Рассылка клиентам';uk='Розсилка клієнтам'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РасходныйКассовыйОрдер" Тогда 
			Возврат НСтр("ru='Расходный кассовый ордер';uk='Видатковий касовий ордер'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РасходныйОрдерНаТовары" Тогда 
			Возврат НСтр("ru='Расходный ордер на товары';uk='Видатковий ордер на товари'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РасчетСебестоимостиТоваров" Тогда 
			Возврат НСтр("ru='Расчет себестоимости товаров';uk='Розрахунок собівартості товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РасчетСпецстажаСотрудников" Тогда 
			Возврат НСтр("ru='Расчет спецстажа сотрудников';uk='Розрахунок спецстажу співробітників'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РеализацияПодарочныхСертификатов" Тогда 
			Возврат НСтр("ru='Реализация подарочных сертификатов';uk='Реалізація подарункових сертифікатів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РеализацияТоваровУслуг" Тогда 
			Возврат НСтр("ru='Реализация товаров и услуг';uk='Реалізація товарів і послуг'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РеализацияУслугПрочихАктивов" Тогда 
			Возврат НСтр("ru='Реализация услуг и прочих активов';uk='Реалізація послуг та інших активів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РегистрацияВходящегоНалоговогоДокумента" Тогда 
			Возврат НСтр("ru='Регистрация входящего налогового документа';uk='Реєстрація вхідного податкового документа'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РегистрацияДефекта" Тогда 
			Возврат НСтр("ru='Регистрация дефекта';uk='Реєстрація дефекту'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РегистрацияНаработок" Тогда 
			Возврат НСтр("ru='Регистрация наработок';uk='Реєстрація напрацювань'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РегистрацияПереработок" Тогда 
			Возврат НСтр("ru='Регистрация переработок';uk='Реєстрація переробітків'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РегистрацияПрочихДоходов" Тогда 
			Возврат НСтр("ru='Регистрация прочих доходов';uk='Реєстрація інших доходів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РегистрацияСтоимостиПриобретенияОСПропорциональноОблагаемыхНДС" Тогда 
			Возврат НСтр("ru='Регистрация стоимости приобретения ОС, пропорционально облагаемых НДС';uk='Реєстрація вартості придбання ОЗ, що пропорційно оподатковуються ПДВ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РегистрацияЦенНоменклатурыПоставщика" Тогда 
			Возврат НСтр("ru='Регистрация цен номенклатуры поставщика';uk='Реєстрація цін номенклатури постачальника'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РегистрУчета" Тогда 
			Возврат НСтр("ru='Регистр учета';uk='Регістр обліку'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РегламентированныйОтчет" Тогда 
			Возврат НСтр("ru='Регламентированный отчет';uk='Регламентований звіт'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РегламентнаяОперация" Тогда 
			Возврат НСтр("ru='Регламентная операция';uk='Регламентна операція'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РегламентнаяОперацияМеждународныйУчет" Тогда 
			Возврат НСтр("ru='Регламентная операция (международный учет)';uk='Регламентна операція (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РемонтОС" Тогда 
			Возврат НСтр("ru='Ремонт ОС';uk='Ремонт ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СборкаТоваров" Тогда 
			Возврат НСтр("ru='Сборка товаров';uk='Збирання товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СведенияОКонтролируемыхОперациях" Тогда 
			Возврат НСтр("ru='Сведения о контролируемых операциях';uk='Відомості про контрольовані операції'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СверкаВзаиморасчетов" Тогда 
			Возврат НСтр("ru='Сверка взаиморасчетов';uk='Звірка взаєморозрахунків'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Совмещение" Тогда 
			Возврат НСтр("ru='Совмещение должностей';uk='Суміщення посад'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СоглашениеСПоставщиком" Тогда 
			Возврат НСтр("ru='Соглашение с поставщиком';uk='Оферта постачальника'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СообщениеSMS" Тогда 
			Возврат НСтр("ru='Сообщение SMS';uk='Повідомлення SMS'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СписаниеБезналичныхДенежныхСредств" Тогда 
			Возврат НСтр("ru='Списание безналичных денежных средств';uk='Списання безготівкових грошових коштів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СписаниеЗадолженности" Тогда 
			Возврат НСтр("ru='Корректировка задолженности';uk='Коригування заборгованості'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СписаниеЗатратНаВыпуск" Тогда 
			Возврат НСтр("ru='Списание затрат на выпуск';uk='Списання витрат на випуск'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СписаниеИзЭксплуатации" Тогда 
			Возврат НСтр("ru='Списание из эксплуатации';uk='Списання з експлуатації'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СписаниеНедостачТоваров" Тогда 
			Возврат НСтр("ru='Списание недостач товаров';uk='Списання нестач товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СписаниеНМА" Тогда 
			Возврат НСтр("ru='Списание НМА';uk='Списання НМА'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СписаниеНМАМеждународныйУчет" Тогда 
			Возврат НСтр("ru='Списание НМА (международный учет)';uk='Списання НМА (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СписаниеОС" Тогда 
			Возврат НСтр("ru='Списание ОС';uk='Списання ОЗ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СписаниеОСМеждународныйУчет" Тогда 
			Возврат НСтр("ru='Списание ОС (международный учет)';uk='Списання ОЗ (міжнародний облік)'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СправкаОДоходах" Тогда 
			Возврат НСтр("ru='Справка о доходах';uk='Довідка про доходи'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СторнированиеНачислений" Тогда 
			Возврат НСтр("ru='Сторнирование начислений';uk='Сторнування нарахувань'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СчетНаОплатуКлиенту" Тогда 
			Возврат НСтр("ru='Счет на оплату клиенту';uk='Рахунок на оплату клієнту'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ТабельУчетаРабочегоВремени" Тогда 
			Возврат НСтр("ru='Табель учета рабочего времени';uk='Табель обліку робочого часу'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ТаможеннаяДекларацияИмпорт" Тогда 
			Возврат НСтр("ru='Таможенная декларация на импорт';uk='Митна декларація на імпорт'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ТелефонныйЗвонок" Тогда 
			Возврат НСтр("ru='Телефонный звонок';uk='Телефонний дзвінок'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ТранспортнаяНакладная" Тогда 
			Возврат НСтр("ru='Транспортная накладная';uk='Транспортна накладна'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Увольнение" Тогда 
			Возврат НСтр("ru='Увольнение';uk='Звільнення'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УвольнениеСписком" Тогда 
			Возврат НСтр("ru='Увольнение списком';uk='Звільнення списком'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УдалитьАктОРасхожденияхПриПоступленииТоваров" Тогда 
			Возврат НСтр("ru='(не используется) Акт о расхождениях при поступлении товаров';uk='(не використовується) Акт про розбіжності при надходженні товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УдалитьАктПриемкиТоваров" Тогда 
			Возврат НСтр("ru='(не используется) Акт приемки товаров';uk='(не використовується) Акт приймання товарів'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УДАЛИТЬВыпискаПоРасчетномуСчету" Тогда 
			Возврат НСтр("ru='(не используется) Выписка по банковскому счету';uk='(не використовується) Виписка з банківського рахунку'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УдержаниеВСчетРасчетовПоПрочимОперациям" Тогда 
			Возврат НСтр("ru='Удержание по прочим операциям';uk='Утримання за іншими операціями'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УдержаниеПрофсоюзныхВзносов" Тогда 
			Возврат НСтр("ru='Удержание профсоюзных взносов';uk='Утримання профспілкових внесків'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УпаковочныйЛист" Тогда 
			Возврат НСтр("ru='Упаковочный лист';uk='Пакувальний лист'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УстановкаБлокировокЯчеек" Тогда 
			Возврат НСтр("ru='Установка блокировок ячеек';uk='Встановлення блокувань комірок'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УстановкаЗначенийНаработки" Тогда 
			Возврат НСтр("ru='Установка значений наработки';uk='Установка значень напрацювання'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УстановкаЗначенийНефинансовыхПоказателей" Тогда 
			Возврат НСтр("ru='Значения нефинансовых показателей';uk='Значення нефінансових показників'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УстановкаКвотАссортимента" Тогда 
			Возврат НСтр("ru='Установка квот ассортимента';uk='Встановлення квот асортименту'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УстановкаКоэффициентаПропорциональногоНДС" Тогда 
			Возврат НСтр("ru='Установка коэффициента пропорционального НДС';uk='Встановлення коефіцієнта пропорційного ПДВ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УстановкаЦенНоменклатуры" Тогда 
			Возврат НСтр("ru='Установка цен номенклатуры';uk='Встановлення цін номенклатури'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УтверждениеТарифнойСетки" Тогда 
			Возврат НСтр("ru='Утверждение тарифной группы';uk='Затвердження тарифної групи'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УтверждениеШтатногоРасписания" Тогда 
			Возврат НСтр("ru='Утверждение штатного расписания';uk='Затвердження штатного розкладу'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ФормированиеСоставаБригады" Тогда 
			Возврат НСтр("ru='Формирование состава бригады';uk='Формування складу бригади'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЧекККМ" Тогда 
			Возврат НСтр("ru='Чек ККМ';uk='Чек ККМ'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЧекККМВозврат" Тогда 
			Возврат НСтр("ru='Чек ККМ на возврат';uk='Чек ККМ на повернення'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЭкземплярБюджета" Тогда 
			Возврат НСтр("ru='Экземпляр бюджета';uk='Примірник бюджету'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЭкземплярФинансовогоОтчета" Тогда 
			Возврат НСтр("ru='Экземпляр финансового отчета';uk='Примірник фінансового звіту'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЭлектронноеПисьмоВходящее" Тогда 
			Возврат НСтр("ru='Электронное письмо входящее';uk='Електронний лист вхідний'" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЭлектронноеПисьмоИсходящее" Тогда 
			Возврат НСтр("ru='Электронное письмо исходящее';uk='Електронний лист вихідний'" ,КодЯзыка);
		КонецЕсли;	

		Если ПолноеИмяОбъектаМетаданных = "Перечисление.ABCКлассификация" Тогда 
			Если ИмяДляПеревода = "AКласс" Тогда 
				Возврат НСтр("ru='A - класс';uk='A - клас'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "BКласс" Тогда 
				Возврат НСтр("ru='B - класс';uk='B - клас'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "CКласс" Тогда 
				Возврат НСтр("ru='C - класс';uk='C - клас'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеКлассифицирован" Тогда 
				Возврат НСтр("ru='Не классифицирован';uk='Не класифікований'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.XYZКлассификация" Тогда 
			Если ИмяДляПеревода = "XКласс" Тогда 
				Возврат НСтр("ru='X - класс';uk='X - клас'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "YКласс" Тогда 
				Возврат НСтр("ru='Y - класс';uk='Y - клас'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ZКласс" Тогда 
				Возврат НСтр("ru='Z - класс';uk='Z - клас'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеКлассифицирован" Тогда 
				Возврат НСтр("ru='Не классифицирован';uk='Не класифікований'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.АналитикаКурсовыхРазниц" Тогда 
			Если ИмяДляПеревода = "ДенежныеСредства" Тогда 
				Возврат НСтр("ru='Денежные средства';uk='Грошові кошти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КредитыИДепозиты" Тогда 
				Возврат НСтр("ru='Кредиты, депозиты, займы';uk='Кредити, депозити, позики'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыСКлиентами" Тогда 
				Возврат НСтр("ru='Расчеты с клиентами';uk='Розрахунки з клієнтами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыСПоставщиками" Тогда 
				Возврат НСтр("ru='Расчеты с поставщиками';uk='Розрахунки з постачальниками'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.БонусныеПрограммыБанков" Тогда 
			Если ИмяДляПеревода = "AE" Тогда 
				Возврат НСтр("ru='Аэрофлот бонус';uk='Аерофлот бонус'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "GM" Тогда 
				Возврат НСтр("ru='Золотая маска';uk='Золота маска'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "PG" Тогда 
				Возврат НСтр("ru='Подари жизнь';uk='Подаруй життя'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантЛогинаПароляДляЛентыНовостей" Тогда 
			Если ИмяДляПеревода = "БезЛогинаПароля" Тогда 
				Возврат НСтр("ru='Без логина / пароля';uk='Без логіна / пароля'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВебИТС" Тогда 
				Возврат НСтр("ru='Значения логина / пароля из Веб-ИТС';uk='Значення логіна / пароля Веб-ІТС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВручнуюОдинаковыйДляВсех" Тогда 
				Возврат НСтр("ru='Введено вручную (одинаковый для всех)';uk='Введено вручну (однаковий для всіх)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВручнуюРазныйДляВсех" Тогда 
				Возврат НСтр("ru='Введено вручную (разный для всех)';uk='Введено вручну (різний для всіх)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыSMTPАутентификации" Тогда 
			Если ИмяДляПеревода = "POP3ПередSMTP" Тогда 
				Возврат НСтр("ru='POP3 перед SMTP';uk='POP3 перед SMTP'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АналогичноPOP3" Тогда 
				Возврат НСтр("ru='Аналогично POP3';uk='Аналогічно POP3'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗадаетсяПараметрами" Тогда 
				Возврат НСтр("ru='Задается параметрами';uk='Задається параметрами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеЗадано" Тогда 
				Возврат НСтр("ru='Не задано';uk='Не задано'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыАнализаНоменклатурыПродаваемойСовместно" Тогда 
			Если ИмяДляПеревода = "ОптоваяТорговля" Тогда 
				Возврат НСтр("ru='Оптовая торговля';uk='Гуртова торгівля'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РозничнаяТорговля" Тогда 
				Возврат НСтр("ru='Розничная торговля';uk='Роздрібна торгівля'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыВажностиВзаимодействия" Тогда 
			Если ИмяДляПеревода = "Высокая" Тогда 
				Возврат НСтр("ru='Высокая';uk='Висока'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Низкая" Тогда 
				Возврат НСтр("ru='Низкая';uk='Низька'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обычная" Тогда 
				Возврат НСтр("ru='Обычная';uk='Звичайна'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыВажностиЗадачи" Тогда 
			Если ИмяДляПеревода = "Высокая" Тогда 
				Возврат НСтр("ru='Высокая';uk='Висока'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Низкая" Тогда 
				Возврат НСтр("ru='Низкая';uk='Низька'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обычная" Тогда 
				Возврат НСтр("ru='Обычная';uk='Звичайна'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыВерсионированияОбъектов" Тогда 
			Если ИмяДляПеревода = "ВерсионироватьПриЗаписи" Тогда 
				Возврат НСтр("ru='Версионировать при записи';uk='Версіонувати під час запису'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВерсионироватьПриПроведении" Тогда 
				Возврат НСтр("ru='Версионировать при проведении';uk='Версіонувати при проведенні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВерсионироватьПриСтарте" Тогда 
				Возврат НСтр("ru='Версионировать при старте';uk='Версіонувати при старті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВерсионировать" Тогда 
				Возврат НСтр("ru='Не версионировать';uk='Не версіонувати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыВыводаДанныхОТоварномСоставе" Тогда 
			Если ИмяДляПеревода = "НомераНакладных" Тогда 
				Возврат НСтр("ru='Номера накладных';uk='Номери накладних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварныйСостав" Тогда 
				Возврат НСтр("ru='Товарный состав';uk='Товарний склад'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыВыводаМесяцаВДатеДокумента" Тогда 
			Если ИмяДляПеревода = "Прописью" Тогда 
				Возврат НСтр("ru='Прописью';uk='Прописом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Числом" Тогда 
				Возврат НСтр("ru='Числом';uk='Числом'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыВыводаСкидокВПечатныхФормах" Тогда 
			Если ИмяДляПеревода = "ВыбиратьПриПечати" Тогда 
				Возврат НСтр("ru='Выбирать при печати';uk='Вибирати при друку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыводитьСкидки" Тогда 
				Возврат НСтр("ru='Выводить';uk='Виводити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВыводитьСкидки" Тогда 
				Возврат НСтр("ru='Не выводить';uk='Не виводити'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыВыводаСуммВБюджетныхОтчетах" Тогда 
			Если ИмяДляПеревода = "ВВалютеРеглУчета" Тогда 
				Возврат НСтр("ru='В валюте регл. учета';uk='У валюті регл. обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВВалютеСценария" Тогда 
				Возврат НСтр("ru='В валюте сценария';uk='У валюті сценарію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВВалютеУпрУчета" Тогда 
				Возврат НСтр("ru='В валюте упр. учета';uk='У валюті упр. обліку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки" Тогда 
			Если ИмяДляПеревода = "ВозвратПерепоставленного" Тогда 
				Возврат НСтр("ru='Оформить и вернуть';uk='Оформити і повернути'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДопоставкаНеТребуется" Тогда 
				Возврат НСтр("ru='Оформить';uk='Оформити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НедостачаНеПризнана" Тогда 
				Возврат НСтр("ru='Не признавать';uk='Не визнавати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОприходоватьСейчас" Тогда 
				Возврат НСтр("ru='Вернуть без оформления';uk='Повернути без оформлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтгрузитьСейчас" Тогда 
				Возврат НСтр("ru='Допоставить без оформления';uk='Допоставити без оформлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПерепоставленноеДарится" Тогда 
				Возврат НСтр("ru='Не признавать';uk='Не визнавати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокупкаПерепоставленного" Тогда 
				Возврат НСтр("ru='Оформить';uk='Оформити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуетсяДопоставка" Тогда 
				Возврат НСтр("ru='Оформить и допоставить';uk='Оформити і допоставити'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки" Тогда 
			Если ИмяДляПеревода = "ВернутьПерепоставленноеБезОформления" Тогда 
				Возврат НСтр("ru='Вернуть без оформления';uk='Повернути без оформлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидатьДопоставкуБезОформления" Тогда 
				Возврат НСтр("ru='Ожидать допоставку без оформления';uk='Очікувати допоставку без оформлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтнестиНедостачуНаПрочиеРасходы" Тогда 
				Возврат НСтр("ru='На прочие расходы';uk='На інші витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтнестиПерепоставленноеНаПрочиеДоходы" Тогда 
				Возврат НСтр("ru='На прочие доходы';uk='На інші доходи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОформитьНедостачу" Тогда 
				Возврат НСтр("ru='Оформить';uk='Оформити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОформитьНедостачуИОжидатьДопоставку" Тогда 
				Возврат НСтр("ru='Оформить и ожидать допоставку';uk='Оформити і чекати допоставку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОформитьПерепоставленное" Тогда 
				Возврат НСтр("ru='Оформить ';uk='Оформити '" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОформитьПерепоставленноеИВернуть" Тогда 
				Возврат НСтр("ru='Оформить и вернуть';uk='Оформити і повернути'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыЗагрузкиРабочихЦентров" Тогда 
			Если ИмяДляПеревода = "Асинхронный" Тогда 
				Возврат НСтр("ru='Асинхронный';uk='Асинхронний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Синхронный" Тогда 
				Возврат НСтр("ru='Синхронный';uk='Синхронний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыИспользованияПериодаНачисления" Тогда 
			Если ИмяДляПеревода = "БазовыйПериод" Тогда 
				Возврат НСтр("ru='Базовый период';uk='Базовий період'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИспользовать" Тогда 
				Возврат НСтр("ru='Не использовать';uk='Не використовувати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПериодДействия" Тогда 
				Возврат НСтр("ru='Период действия';uk='Період дії'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыИспользованияПериодическойИнвентаризацииЯчеек" Тогда 
			Если ИмяДляПеревода = "ИспользоватьНастройкиОбластиХранения" Тогда 
				Возврат НСтр("ru='Использовать настройки области хранения';uk='Використовувати настройки області зберігання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИспользоватьНастройкиЯчейки" Тогда 
				Возврат НСтр("ru='Использовать настройки ячейки';uk='Використовувати настройки комірки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИспользовать" Тогда 
				Возврат НСтр("ru='Не использовать';uk='Не використовувати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыИспользованияХарактеристикНоменклатуры" Тогда 
			Если ИмяДляПеревода = "ИндивидуальныеДляНоменклатуры" Тогда 
				Возврат НСтр("ru='Индивидуальные для номенклатуры';uk='Індивідуальні для номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИспользовать" Тогда 
				Возврат НСтр("ru='Не используются';uk='Не використовуються'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбщиеДляВидаНоменклатуры" Тогда 
				Возврат НСтр("ru='Общие для вида номенклатуры';uk='Спільні для виду номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбщиеСДругимВидомНоменклатуры" Тогда 
				Возврат НСтр("ru='Общие с другим видом номенклатуры';uk='Загальні з іншим видом номенклатури'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыНавигацииВФормахНоменклатуры" Тогда 
			Если ИмяДляПеревода = "ПоВидам" Тогда 
				Возврат НСтр("ru='По видам';uk='За видами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоВидамИСвойствам" Тогда 
				Возврат НСтр("ru='По видам и свойствам';uk='За видами і властивостями'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоИерархии" Тогда 
				Возврат НСтр("ru='По иерархии';uk='За ієрархією'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоИерархииПоставщика" Тогда 
				Возврат НСтр("ru='По иерархии поставщика';uk='По ієрархії постачальника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоНоменклатуре" Тогда 
				Возврат НСтр("ru='По номенклатуре';uk='По номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоНоменклатуреПоставщика" Тогда 
				Возврат НСтр("ru='По номенклатуре поставщика';uk='По номенклатурі постачальника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСвойствам" Тогда 
				Возврат НСтр("ru='По свойствам';uk='За властивостями'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСовместноПродаваемымТоварам" Тогда 
				Возврат НСтр("ru='По совместно продаваемым товарам';uk='За товарами, які спільно продаються'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоТоварамДругогоКачества" Тогда 
				Возврат НСтр("ru='По товарам другого качества';uk='По товарам іншої якості'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыНакопленияКумулятивнойСкидкиНаценки" Тогда 
			Если ИмяДляПеревода = "ПоПартнеру" Тогда 
				Возврат НСтр("ru='По партнеру';uk='За партнером'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоТорговомуСоглашению" Тогда 
				Возврат НСтр("ru='По торговому соглашению';uk='За торговельною офертою'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОбеспечения" Тогда 
			Если ИмяДляПеревода = "ИзЗаказов" Тогда 
				Возврат НСтр("ru='Резервировать к дате';uk='Резервувати до дати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеТребуется" Тогда 
				Возврат НСтр("ru='Не обеспечивать';uk='Не забезпечувати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обособленно" Тогда 
				Возврат НСтр("ru='Обеспечивать обособленно';uk='Забезпечувати відокремлено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отгрузить" Тогда 
				Возврат НСтр("ru='Отгрузить';uk='Відвантажити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтгрузитьОбособленно" Тогда 
				Возврат НСтр("ru='Отгрузить обособленно';uk='Відвантажити відокремлено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СоСклада" Тогда 
				Возврат НСтр("ru='Резервировать на складе';uk='Резервувати на складі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Требуется" Тогда 
				Возврат НСтр("ru='К обеспечению';uk='До забезпечення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОбластейОграниченияСкидокНаценок" Тогда 
			Если ИмяДляПеревода = "ВДокументе" Тогда 
				Возврат НСтр("ru='В документе';uk='В документі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВСтроке" Тогда 
				Возврат НСтр("ru='В строке';uk='У рядку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОбластейОграниченияСкидокНаценокВДокументе" Тогда 
			Если ИмяДляПеревода = "НаВсеСтроки" Тогда 
				Возврат НСтр("ru='На все строки';uk='На всі рядки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаНоменклатуруСегмента" Тогда 
				Возврат НСтр("ru='На номенклатуру сегмента';uk='На номенклатуру сегмента'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаСтрокиВыполненияУсловий" Тогда 
				Возврат НСтр("ru='На строки выполнения условий';uk='На рядки виконання умов'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОбособленияПоНаправлениюДеятельности" Тогда 
			Если ИмяДляПеревода = "ПоЗаказамНаправления" Тогда 
				Возврат НСтр("ru='По заказам направления';uk='По замовленнях напрямки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоНаправлениюВЦелом" Тогда 
				Возврат НСтр("ru='По направлению в целом';uk='По напряму в цілому'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОбособленногоУчетаТоваров" Тогда 
			Если ИмяДляПеревода = "НеВедется" Тогда 
				Возврат НСтр("ru='Не ведется';uk='Не ведеться'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоМенеджерамПодразделения" Тогда 
				Возврат НСтр("ru='По менеджерам подразделения';uk='За менеджерами підрозділів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПодразделению" Тогда 
				Возврат НСтр("ru='По подразделению';uk='По підрозділу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОказанияУслуг" Тогда 
			Если ИмяДляПеревода = "ОрганизациейПоАгентскойСхеме" Тогда 
				Возврат НСтр("ru='Организацией по агентской схеме';uk='Організацією за агентською схемою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОрганизациейПродавцом" Тогда 
				Возврат НСтр("ru='Организацией-продавцом';uk='Організацією-продавцем'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Партнером" Тогда 
				Возврат НСтр("ru='Партнером';uk='Партнером'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОкругления" Тогда 
			Если ИмяДляПеревода = "ВсегдаВПользуКлиента" Тогда 
				Возврат НСтр("ru='Всегда в пользу клиента';uk='Завжди на користь клієнта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВсегдаВПользуПредприятия" Тогда 
				Возврат НСтр("ru='Всегда в пользу предприятия';uk='Завжди на користь підприємства'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоАрифметическимПравилам" Тогда 
				Возврат НСтр("ru='По арифметическим правилам';uk='За арифметичними правилами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОплатыКлиентом" Тогда 
			Если ИмяДляПеревода = "АвансДоОбеспечения" Тогда 
				Возврат НСтр("ru='Аванс (до обеспечения)';uk='Аванс (до забезпечення)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КредитПослеОтгрузки" Тогда 
				Возврат НСтр("ru='Кредит (после отгрузки)';uk='Кредит (після відвантаження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредоплатаДоОтгрузки" Тогда 
				Возврат НСтр("ru='Предоплата (до отгрузки)';uk='Передплата (до відвантаження)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОплатыПоставщику" Тогда 
			Если ИмяДляПеревода = "АвансДоПодтверждения" Тогда 
				Возврат НСтр("ru='Аванс (до подтверждения)';uk='Аванс (до підтвердження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КредитПослеПоступления" Тогда 
				Возврат НСтр("ru='Кредит (после поступления)';uk='Кредит (після надходження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредоплатаДоПоступления" Тогда 
				Возврат НСтр("ru='Предоплата (до поступления)';uk='Передплата (до надходження)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОпределенияПериодаНакопительнойСкидки" Тогда 
			Если ИмяДляПеревода = "ВесьПериод" Тогда 
				Возврат НСтр("ru='Весь период';uk='Весь період'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрошлыйПериод" Тогда 
				Возврат НСтр("ru='Прошлый период';uk='Минулий період'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрошлыйСкользящийПериод" Тогда 
				Возврат НСтр("ru='Прошлый скользящий период';uk='Минулий змінний період'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СНачалаТекущегоПериода" Тогда 
				Возврат НСтр("ru='С начала текущего периода';uk='З початку поточного періоду'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок" Тогда 
			Если ИмяДляПеревода = "БезОграничений" Тогда 
				Возврат НСтр("ru='Без ограничений';uk='Без обмежень'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтборКомпоновкиДанных" Тогда 
				Возврат НСтр("ru='Отбор компоновки данных';uk='Відбір компонування даних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СегментНоменклатуры" Тогда 
				Возврат НСтр("ru='Сегмент номенклатуры';uk='Сегмент номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписокНоменклатуры" Тогда 
				Возврат НСтр("ru='Список номенклатуры';uk='Список номенклатури'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОтображенияВариантовАнализа" Тогда 
			Если ИмяДляПеревода = "Диаграмма" Тогда 
				Возврат НСтр("ru='Диаграмма';uk='Діаграма'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Кратко" Тогда 
				Возврат НСтр("ru='Кратко';uk='Коротко'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Таблица" Тогда 
				Возврат НСтр("ru='Таблица';uk='Таблиця'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОтображенияДоступности" Тогда 
			Если ИмяДляПеревода = "ДефицитДоступности" Тогда 
				Возврат НСтр("ru='Дефицит доступности';uk='Дефіцит доступності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоВидуРЦ" Тогда 
				Возврат НСтр("ru='По виду РЦ';uk='По виду РЦ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоГрафикуПроизводства" Тогда 
				Возврат НСтр("ru='По графику производства';uk='За графіком виробництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоГрафикуРаботыРЦ" Тогда 
				Возврат НСтр("ru='По графику работы РЦ';uk='За графіком роботи РЦ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОтправкиPushУведомлений" Тогда 
			Если ИмяДляПеревода = "НеОтправлять" Тогда 
				Возврат НСтр("ru='Не отправлять';uk='Не відправляти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтправлятьНепосредственно" Тогда 
				Возврат НСтр("ru='Отправлять непосредственно';uk='Відправляти безпосередньо'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтправлятьЧерезВспомогательныйСервис" Тогда 
				Возврат НСтр("ru='Отправлять через вспомогательный сервис';uk='Відправляти через допоміжний сервіс'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОтраженияКорректировокПоступлений" Тогда 
			Если ИмяДляПеревода = "ОтразитьНаПрочихДоходах" Тогда 
				Возврат НСтр("ru='Отразить на прочих доходах';uk='Відобразити на інші доходи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписатьНаРасходы" Тогда 
				Возврат НСтр("ru='Списать на расходы';uk='Списати на витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УвеличитьЗакупкуУвеличитьСкладскиеОстатки" Тогда 
				Возврат НСтр("ru='Увеличить закупку, увеличить складские остатки';uk='Збільшити купівлю, збільшити складські залишки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УвеличитьЗакупкуУчестьПриИнвентаризации" Тогда 
				Возврат НСтр("ru='Увеличить закупку, учесть при инвентаризации';uk='Збільшити купівлю, врахувати при інвентаризації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УвеличитьСтоимостьТовара" Тогда 
				Возврат НСтр("ru='Увеличить стоимость';uk='Збільшити вартість'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УменьшитьЗакупкуУменьшитьСкладскиеОстатки" Тогда 
				Возврат НСтр("ru='Уменьшить закупку, уменьшить складские остатки';uk='Зменшити купівлю, зменшити складські залишки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УменьшитьЗакупкуУчестьПриИнвентаризации" Тогда 
				Возврат НСтр("ru='Уменьшить закупку, учесть при инвентаризации';uk='Зменшити купівлю, врахувати при інвентаризації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УменьшитьСтоимостьТовара" Тогда 
				Возврат НСтр("ru='Уменьшить стоимость';uk='Зменшити вартість'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОтраженияКорректировокРеализаций" Тогда 
			Если ИмяДляПеревода = "ОтразитьНаПрочихДоходах" Тогда 
				Возврат НСтр("ru='Отразить на прочих доходах';uk='Відобразити на інші доходи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписатьНаРасходы" Тогда 
				Возврат НСтр("ru='Списать на расходы';uk='Списати на витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УвеличитьВыручку" Тогда 
				Возврат НСтр("ru='Увеличить выручку';uk='Збільшити виторг'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УвеличитьРеализациюУменьшитьСкладскиеОстатки" Тогда 
				Возврат НСтр("ru='Увеличить реализацию, уменьшить складские остатки';uk='Збільшити реалізацію, зменшити складські залишки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УвеличитьРеализациюУчестьПриИнвентаризации" Тогда 
				Возврат НСтр("ru='Увеличить реализацию, учесть при инвентаризации';uk='Збільшити реалізацію, врахувати при інвентаризації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УменьшитьВыручку" Тогда 
				Возврат НСтр("ru='Уменьшить выручку';uk='Зменшити виторг'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УменьшитьРеализациюУвеличитьСкладскиеОстатки" Тогда 
				Возврат НСтр("ru='Уменьшить реализацию, увеличить складские остатки';uk='Зменшити реалізацію, збільшити складські залишки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УменьшитьРеализациюУчестьПриИнвентаризации" Тогда 
				Возврат НСтр("ru='Уменьшить реализацию, учесть при инвентаризации';uk='Зменшити реалізацію, врахувати при інвентаризації'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОтраженияРасхождений" Тогда 
			Если ИмяДляПеревода = "ИзлишкиВПользуПоставщика" Тогда 
				Возврат НСтр("ru='В пользу поставщика';uk='На користь постачальника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзлишкиНаПрочиеДоходы" Тогда 
				Возврат НСтр("ru='На прочие доходы';uk='На інші доходи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НедостачиЗаСчетПоставщика" Тогда 
				Возврат НСтр("ru='За счет поставщика';uk='За рахунок постачальника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НедостачиЗаСчетСтороннейКомпании" Тогда 
				Возврат НСтр("ru='За счет сторонней компании';uk='За рахунок сторонньої компанії'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НедостачиНаПрочиеРасходы" Тогда 
				Возврат НСтр("ru='На прочие расходы';uk='На інші витрати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОформленияДокументовПродажи" Тогда 
			Если ИмяДляПеревода = "ЗаказКлиента" Тогда 
				Возврат НСтр("ru='Заказ';uk='Замовлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаказКлиентаРеализацияТоваровУслуг" Тогда 
				Возврат НСтр("ru='Заказ + Реализация';uk='Замовлення + Реалізація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КоммерческоеПредложение" Тогда 
				Возврат НСтр("ru='Коммерческое предложение';uk='Комерційна пропозиція'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияТоваровУслуг" Тогда 
				Возврат НСтр("ru='Реализация';uk='Реалізація'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОформленияПродажи" Тогда 
			Если ИмяДляПеревода = "АктВыполненныхРабот" Тогда 
				Возврат НСтр("ru='Акт выполненных работ';uk='Акт виконаних робіт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АктНаПередачуПрав" Тогда 
				Возврат НСтр("ru='Акт на передачу прав';uk='Акт на передачу прав'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияТоваровУслуг" Тогда 
				Возврат НСтр("ru='Реализация товаров и услуг';uk='Реалізація товарів і послуг'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыОчисткиФайлов" Тогда 
			Если ИмяДляПеревода = "НеОчищать" Тогда 
				Возврат НСтр("ru='Не очищать';uk='Не очищати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОчиститьВерсии" Тогда 
				Возврат НСтр("ru='Очистить версии';uk='Очистити версії'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОчиститьФайлы" Тогда 
				Возврат НСтр("ru='Очистить файлы';uk='Очистити файли'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОчиститьФайлыИВерсии" Тогда 
				Возврат НСтр("ru='Очистить файлы и версии';uk='Очистити файли і версії'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыПечатиМаршрутнойКартыНаПродукцию" Тогда 
			Если ИмяДляПеревода = "ПоМаршрутнымКартам" Тогда 
				Возврат НСтр("ru='По маршрутным картам';uk='За маршрутними картами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЭтапам" Тогда 
				Возврат НСтр("ru='По этапам';uk='За етапами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыПравилЗаполненияРеквизитов" Тогда 
			Если ИмяДляПеревода = "ВыражениеНаВстроенномЯзыке" Тогда 
				Возврат НСтр("ru='Из выражения на встроенном языке';uk='З виразу на вбудованій мові'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзШаблона" Тогда 
				Возврат НСтр("ru='Из шаблона';uk='З шаблону'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеквизитОбъекта" Тогда 
				Возврат НСтр("ru='Из реквизита объекта потребителя';uk='З реквізиту об'єкта споживача'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УказанноеЗначение" Тогда 
				Возврат НСтр("ru='Из указанного значения';uk='З вказаного значення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыПравилФормированияПредставленияЭлементовСправочникаСотрудники" Тогда 
			Если ИмяДляПеревода = "ФамилияИмяОтчествоВидЗанятостиДополнение" Тогда 
				Возврат НСтр("ru='Фамилия Имя Отчество (вид занятости) [дополнение]';uk='Прізвище Ім'я по Батькові (вид зайнятості) [доповнення]'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФамилияИмяОтчествоВидЗанятостиУволенДополнение" Тогда 
				Возврат НСтр("ru='Фамилия Имя Отчество (вид занятости, ув.) [дополнение]';uk='Прізвище Ім'я по Батькові (вид зайнятості, зв.) [доповнення]'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФамилияИмяОтчествоДополнение" Тогда 
				Возврат НСтр("ru='Фамилия Имя Отчество [дополнение]';uk='Прізвище Ім'я по Батькові [доповнення]'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФамилияИмяОтчествоУволенДополнение" Тогда 
				Возврат НСтр("ru='Фамилия Имя Отчество (ув.) [дополнение]';uk='Прізвище Ім'я по Батькові (зв.) [доповнення]'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФамилияИОВидЗанятостиДополнение" Тогда 
				Возврат НСтр("ru='Фамилия И. О. (вид занятости) [дополнение]';uk='Прізвище І. Б. (вид зайнятості) [доповнення]'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФамилияИОВидЗанятостиУволенДополнение" Тогда 
				Возврат НСтр("ru='Фамилия И. О. (вид занятости, ув.) [дополнение]';uk='Прізвище І. Б. (вид зайнятості, зв.) [доповнення]'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФамилияИОДополнение" Тогда 
				Возврат НСтр("ru='Фамилия И. О. [дополнение]';uk='Прізвище І. Б. [доповнення]'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФамилияИОУволенДополнение" Тогда 
				Возврат НСтр("ru='Фамилия И. О. (ув.) [дополнение]';uk='Прізвище І. Б. (зв.) [доповнення]'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыПредставленияНаборовВПечатныхФормах" Тогда 
			Если ИмяДляПеревода = "НаборИКомплектующие" Тогда 
				Возврат НСтр("ru='Набор и комплектующие';uk='Набір та комплектуючі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТолькоКомплектующие" Тогда 
				Возврат НСтр("ru='Только комплектующие';uk='Тільки комплектуючі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТолькоНабор" Тогда 
				Возврат НСтр("ru='Только набор';uk='Тільки набір'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыПреобразования" Тогда 
			Если ИмяДляПеревода = "Максимум" Тогда 
				Возврат НСтр("ru='Максимум';uk='Максимум'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Минимум" Тогда 
				Возврат НСтр("ru='Минимум';uk='Мінімум'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сложение" Тогда 
				Возврат НСтр("ru='Сложение';uk='Додавання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Среднее" Тогда 
				Возврат НСтр("ru='Среднее';uk='Середнє'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыПриемкиТоваров" Тогда 
			Если ИмяДляПеревода = "МожетПроисходитьБезЗаказовИНакладных" Тогда 
				Возврат НСтр("ru='Может происходить без заказов и накладных';uk='Може відбуватися без замовлень і накладних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеРазделенаПоЗаказамИНакладным" Тогда 
				Возврат НСтр("ru='Не разделена по заказам и накладным';uk='Не розділена за замовленнями та накладними'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазделенаПоЗаказамИНакладным" Тогда 
				Возврат НСтр("ru='Разделена по заказам и накладным';uk='Розділено по замовленнях і накладних'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыПримененияЦелевогоФинансирования" Тогда 
			Если ИмяДляПеревода = "НеИспользуется" Тогда 
				Возврат НСтр("ru='Не используется';uk='Не використовується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Полное" Тогда 
				Возврат НСтр("ru='Полное';uk='Повне'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Частичное" Тогда 
				Возврат НСтр("ru='Частичное';uk='Часткове'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок" Тогда 
			Если ИмяДляПеревода = "Используется" Тогда 
				Возврат НСтр("ru='Используется';uk='Використовується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отключена" Тогда 
				Возврат НСтр("ru='Отключена';uk='Відключена'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РежимОтладки" Тогда 
				Возврат НСтр("ru='Режим отладки';uk='Режим налагодження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыРасположенияГраницыФактическиДанных" Тогда 
			Если ИмяДляПеревода = "ВнутриПериодаБюджета" Тогда 
				Возврат НСтр("ru='Внутри периода бюджета';uk='Всередині періоду бюджету'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоНачалаСоставленияБюджета" Тогда 
				Возврат НСтр("ru='До начала составления бюджета';uk='До початку складання бюджету'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыРаспределенияРасходов" Тогда 
			Если ИмяДляПеревода = "НаВнеоборотныеАктивы" Тогда 
				Возврат НСтр("ru='На необоротные активы';uk='На необоротні активи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаНаправленияДеятельности" Тогда 
				Возврат НСтр("ru='На направления деятельности';uk='На напрями діяльності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаПроизводственныеЗатраты" Тогда 
				Возврат НСтр("ru='На производственные затраты';uk='На виробничі витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаПрочиеАктивы" Тогда 
				Возврат НСтр("ru='На прочие активы';uk='На інші активи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаРасходыБудущихПериодов" Тогда 
				Возврат НСтр("ru='На расходы будущих периодов';uk='На витрати майбутніх періодів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаСебестоимостьТоваров" Тогда 
				Возврат НСтр("ru='На себестоимость товаров';uk='На собівартість товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеРаспределять" Тогда 
				Возврат НСтр("ru='Не распределять';uk='Не розподіляти'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыРасхождений" Тогда 
			Если ИмяДляПеревода = "Излишки" Тогда 
				Возврат НСтр("ru='Излишки';uk='Надлишки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Недостачи" Тогда 
				Возврат НСтр("ru='Недостачи';uk='Нестачі'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыРасчетаРезультатаСовместногоПрименения" Тогда 
			Если ИмяДляПеревода = "ПоДокументуВЦелом" Тогда 
				Возврат НСтр("ru='По документу в целом';uk='По документу в цілому'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСтроке" Тогда 
				Возврат НСтр("ru='По строке';uk='По рядку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыРасчетаЦенНаборов" Тогда 
			Если ИмяДляПеревода = "РассчитываетсяИзЦенКомплектующих" Тогда 
				Возврат НСтр("ru='Складывается из цен комплектующих';uk='Складається з цін комплектуючих'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям" Тогда 
				Возврат НСтр("ru='Назначается за набор и распределяется по комплектующим пропорционально долям стоимости';uk='Призначається за набір і розподіляється по комплектуючим пропорційно часткам вартості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам" Тогда 
				Возврат НСтр("ru='Назначается за набор и распределяется по комплектующим пропорционально их цене';uk='Призначається за набір і розподіляється по комплектуючим пропорційно їх ціні'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыРасчетаЦенПоСоглашениямСКлиентами" Тогда 
			Если ИмяДляПеревода = "БезЦен" Тогда 
				Возврат НСтр("ru='Без цен';uk='Без цін'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВидЦенВШапке" Тогда 
				Возврат НСтр("ru='Вид цен в шапке';uk='Вид цін в шапці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВидЦенВШапкеВидыЦенПоНоменклатуре" Тогда 
				Возврат НСтр("ru='Вид цен в шапке и виды цен по номенклатуре';uk='Вид цін у шапці та види цін по номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВидЦенВШапкеВидыЦенПоНоменклатуреУточненныеЦеныПоНоменклатуре" Тогда 
				Возврат НСтр("ru='Вид цен в шапке, виды цен по номенклатуре и уточненные цены по номенклатуре';uk='Вид цін в шапці, види цін по номенклатурі і уточнені ціни по номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВидЦенВШапкеВидыЦенПоЦеновымГруппам" Тогда 
				Возврат НСтр("ru='Вид цен в шапке и виды цен по ценовым группам';uk='Вид цін у шапці та види цін по цінових групах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВидЦенВШапкеВидыЦенПоЦеновымГруппамВидыЦенПоНоменклатуре" Тогда 
				Возврат НСтр("ru='Вид цен в шапке, виды цен по ценовым группам и виды цен по номенклатуре';uk='Вид цін в шапці, види цін по цінових групах та види цін по номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВидЦенВШапкеВидыЦенПоЦеновымГруппамВидыЦенПоНоменклатуреУточненныеЦеныПоНоменклатуре" Тогда 
				Возврат НСтр("ru='Вид цен в шапке, виды цен по ценовым группам, виды цен по номенклатуре и уточненные цены по номенклатуре';uk='Вид цін в шапці, види цін по цінових групах, види цін по номенклатурі і уточнені ціни по номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВидЦенВШапкеВидыЦенПоЦеновымГруппамУточненныеЦеныПоНоменклатуре" Тогда 
				Возврат НСтр("ru='Вид цен в шапке, виды цен по ценовым группам и уточненные цены по номенклатуре';uk='Вид цін в шапці, види цін по цінових групах і уточнені ціни по номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВидЦенВШапкеУточненныеЦеныПоНоменклатуре" Тогда 
				Возврат НСтр("ru='Вид цен в шапке и уточненные цены по номенклатуре';uk='Вид цін в шапці і уточнені ціни по номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВидыЦенПоНоменклатуре" Тогда 
				Возврат НСтр("ru='Виды цен по номенклатуре';uk='Види цін по номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВидыЦенПоНоменклатуреУточненныеЦеныПоНоменклатуре" Тогда 
				Возврат НСтр("ru='Виды цен по номенклатуре и уточненные цены по номенклатуре';uk='Види цін по номенклатурі і уточнені ціни по номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВидыЦенПоЦеновымГруппам" Тогда 
				Возврат НСтр("ru='Виды цен по ценовым группам';uk='Види цін по цінових групах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВидыЦенПоЦеновымГруппамВидыЦенПоНоменклатуре" Тогда 
				Возврат НСтр("ru='Виды цен по ценовым группам и виды цен по номенклатуре';uk='Види цін по цінових групах та види цін по номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВидыЦенПоЦеновымГруппамВидыЦенПоНоменклатуреУточненныеЦеныПоНоменклатуре" Тогда 
				Возврат НСтр("ru='Виды цен по ценовым группам, виды цен по номенклатуре и уточненные цены по номенклатуре';uk='Види цін по цінових групах, види цін по номенклатурі і уточнені ціни по номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВидыЦенПоЦеновымГруппамУточненныеЦеныПоНоменклатуре" Тогда 
				Возврат НСтр("ru='Виды цен по ценовым группам и уточненные цены по номенклатуре';uk='Види цін за ціновими групами і уточнені ціни по номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УточненныеЦеныПоНоменклатуре" Тогда 
				Возврат НСтр("ru='Только уточненные цены номенклатуре';uk='Тільки уточнені ціни номенклатурі'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыСжатияTIFF" Тогда 
			Если ИмяДляПеревода = "CCITT3" Тогда 
				Возврат НСтр("ru='CCITT3';uk='CCITT3'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "CCITT4" Тогда 
				Возврат НСтр("ru='CCITT4';uk='CCITT4'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "LZW" Тогда 
				Возврат НСтр("ru='LZW';uk='LZW'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "RLE" Тогда 
				Возврат НСтр("ru='RLE';uk='RLE'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "БезСжатия" Тогда 
				Возврат НСтр("ru='Без сжатия';uk='Без ущільнення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыСовместногоПримененияСкидокНаценок" Тогда 
			Если ИмяДляПеревода = "Вытеснение" Тогда 
				Возврат НСтр("ru='Вытеснение';uk='Витіснення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Максимум" Тогда 
				Возврат НСтр("ru='Максимум';uk='Максимум'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Минимум" Тогда 
				Возврат НСтр("ru='Минимум';uk='Мінімум'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сложение" Тогда 
				Возврат НСтр("ru='Сложение';uk='Додавання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Умножение" Тогда 
				Возврат НСтр("ru='Умножение';uk='Множення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыСовместногоПримененияШаблоновПроводок" Тогда 
			Если ИмяДляПеревода = "Все" Тогда 
				Возврат НСтр("ru='Все';uk='Всі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Вытеснение" Тогда 
				Возврат НСтр("ru='Вытеснение';uk='Витіснення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыУдержанияНДФЛ" Тогда 
			Если ИмяДляПеревода = "ВозвращеноНалоговымАгентом" Тогда 
				Возврат НСтр("ru='Возвращено налоговым агентом';uk='Повернуто податковим агентом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗачетАвансовыхПлатежей" Тогда 
				Возврат НСтр("ru='Зачет авансовых платежей';uk='Залік авансових платежів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереданоНаВзысканиеВНалоговыйОрган" Тогда 
				Возврат НСтр("ru='Передано на взыскание в налоговый орган';uk='Передано на стягнення податкового органу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Удержано" Тогда 
				Возврат НСтр("ru='Удержано';uk='Утримано'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВариантыУчетаИмуществаПриЛизинге" Тогда 
			Если ИмяДляПеревода = "ЗаБалансом" Тогда 
				Возврат НСтр("ru='За балансом';uk='За балансом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаБалансе" Тогда 
				Возврат НСтр("ru='На балансе';uk='На балансі'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВерсииРегламентаОбмена1С" Тогда 
			Если ИмяДляПеревода = "Версия10" Тогда 
				Возврат НСтр("ru='Не поддерживается - 1.0';uk='Не підтримується - 1.0'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Версия20" Тогда 
				Возврат НСтр("ru='2.0';uk='2.0'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВерсииФорматаПакетаЭД" Тогда 
			Если ИмяДляПеревода = "Версия10" Тогда 
				Возврат НСтр("ru='Версия 1.0';uk='Версія 1.0'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Версия20" Тогда 
				Возврат НСтр("ru='Версия 2.0';uk='Версія 2.0'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Версия30" Тогда 
				Возврат НСтр("ru='Версия 3.0';uk='Версія 3.0'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВерсииФорматовВыгрузки" Тогда 
			Если ИмяДляПеревода = "ГНСУ_XML" Тогда 
				Возврат НСтр("ru='ГНСУ, формат XML';uk='ДПСУ, формат XML'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидУсловнойПродажи" Тогда 
			Если ИмяДляПеревода = "ВосстановлениеНДС" Тогда 
				Возврат НСтр("ru='Восстановление НДС';uk='Відновлення ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаУсловнойПродажи" Тогда 
				Возврат НСтр("ru='Корректировка условной продажи';uk='Коригування умовного продажу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредполагаемаяКорректировкаУсловнойПродажи" Тогда 
				Возврат НСтр("ru='Предполагаемая корректировка условной продажи';uk='Передбачувана коригування умовного продажу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредполагаемаяСводнаяУсловнаяПродажа" Тогда 
				Возврат НСтр("ru='Предполагаемая условная продажа при приобретении';uk='Передбачуваний умовний продаж при придбанні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредполагаемаяУсловнаяПродажа" Тогда 
				Возврат НСтр("ru='Предполагаемая условная продажа при использовании';uk='Передбачуваний умовний продаж при використанні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредполагаемаяУсловнаяПродажаНеоборотныхАктивов" Тогда 
				Возврат НСтр("ru='Предполагаемая условная продажа необоротных активов';uk='Передбачуваний умовний продаж необоротних активів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредполагаемоеВосстановлениеНДС" Тогда 
				Возврат НСтр("ru='Предполагаемое восстановление НДС';uk='Передбачуване відновлення ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СводнаяУсловнаяПродажа" Тогда 
				Возврат НСтр("ru='Условная продажа при приобретении';uk='Умовний продаж при придбанні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УсловнаяПродажа" Тогда 
				Возврат НСтр("ru='Условная продажа при использовании';uk='Умовний продаж при використанні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УсловнаяПродажаНеоборотныхАктивов" Тогда 
				Возврат НСтр("ru='Условная продажа необоротных активов';uk='Умовний продаж необоротних активів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыАктивовДляРБП" Тогда 
			Если ИмяДляПеревода = "ДебиторскаяЗадолженность" Тогда 
				Возврат НСтр("ru='Дебиторская задолженность';uk='Дебіторська заборгованість'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Запасы" Тогда 
				Возврат НСтр("ru='Запасы';uk='Запаси'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсновныеСредства" Тогда 
				Возврат НСтр("ru='Основные средства';uk='Основні засоби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеВнеоборотныеАктивы" Тогда 
				Возврат НСтр("ru='Прочие необоротные активы';uk='Інші необоротні активи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеОборотныеАктивы" Тогда 
				Возврат НСтр("ru='Прочие оборотные активы';uk='Інші оборотні активи'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыБазыУдержанияПоИсполнительномуДокументу" Тогда 
			Если ИмяДляПеревода = "Заработок" Тогда 
				Возврат НСтр("ru='Заработок';uk='Заробіток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрожиточныйМинимум" Тогда 
				Возврат НСтр("ru='Прожиточный минимум';uk='Прожитковий мінімум'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыБригадныхНарядов" Тогда 
			Если ИмяДляПеревода = "Производство" Тогда 
				Возврат НСтр("ru='Производство';uk='Виробництво'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРаботы" Тогда 
				Возврат НСтр("ru='Прочие работы';uk='Інші роботи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ремонт" Тогда 
				Возврат НСтр("ru='Ремонт';uk='Ремонт'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыВзаиморасчетовССотрудниками" Тогда 
			Если ИмяДляПеревода = "ВнеочередноеПогашениеЗайма" Тогда 
				Возврат НСтр("ru='Внеочередное погашение займа';uk='Позачергове погашення позики'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаАванса" Тогда 
				Возврат НСтр("ru='Выплата аванса';uk='Виплата авансу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаВМежрасчетныйПериод" Тогда 
				Возврат НСтр("ru='Выплата в межрасчетный период';uk='Виплата в міжрозрахунковий період'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаЗарплаты" Тогда 
				Возврат НСтр("ru='Выплата зарплаты';uk='Виплата зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачальнаяЗадолженность" Тогда 
				Возврат НСтр("ru='Начальная задолженность';uk='Початкова заборгованість'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереносЗадолженности" Тогда 
				Возврат НСтр("ru='Перенос задолженности';uk='Перенесення заборгованості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПогашениеЗадолженностиПоЗарплате" Тогда 
				Возврат НСтр("ru='Погашение задолженности по зарплате';uk='Погашення заборгованості по зарплаті'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыВнеоборотныхАктивов" Тогда 
			Если ИмяДляПеревода = "ИнвестиционноеИмущество" Тогда 
				Возврат НСтр("ru='Инвестиционное имущество';uk='Інвестиційне майно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсновноеСредство" Тогда 
				Возврат НСтр("ru='Основное средство';uk='Основний засіб'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыВозвратовЧерезКассу" Тогда 
			Если ИмяДляПеревода = "ВозвратВТекущуюСмену" Тогда 
				Возврат НСтр("ru='Возврат в текущую смену';uk='Повернення в поточну зміну'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратНеЭтойСмены" Тогда 
				Возврат НСтр("ru='Возврат не этой смены';uk='Повернення не цієї зміни'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыГруппУчетаНачисленийИУдержаний" Тогда 
			Если ИмяДляПеревода = "Депоненты" Тогда 
				Возврат НСтр("ru='Депоненты';uk='Депоненти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалогиИВзносы" Тогда 
				Возврат НСтр("ru='Налоги и взносы';uk='Податки та внески'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Начисления" Тогда 
				Возврат НСтр("ru='Начисления';uk='Нарахування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсобыеНачисления" Тогда 
				Возврат НСтр("ru='Особые начисления';uk='Особливі нарахування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Удержания" Тогда 
				Возврат НСтр("ru='Удержания';uk='Утримання'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДанныхУчетаВремениСотрудников" Тогда 
			Если ИмяДляПеревода = "ВытесняемоеПлановоеВремя" Тогда 
				Возврат НСтр("ru='Вытесняемое плановое время';uk='Плановий час, що витісняється'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДанныеВнутрисменныхНеявок" Тогда 
				Возврат НСтр("ru='Данные внутрисменных неявок';uk='Дані внутрішньозмінних неявок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДанныеИндивидуальныхГрафиков" Тогда 
				Возврат НСтр("ru='Данные индивидуальных графиков';uk='Дані індивідуальних графіків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДанныеОбщихГрафиков" Тогда 
				Возврат НСтр("ru='Данные общих графиков';uk='Дані загальних графіків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДанныеОперативногоУчета" Тогда 
				Возврат НСтр("ru='Данные оперативного учета';uk='Дані оперативного обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДанныеТабельногоУчета" Тогда 
				Возврат НСтр("ru='Данные табельного учета';uk='Дані табельного обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДополнительноеВнутрисменноеВремя" Тогда 
				Возврат НСтр("ru='Дополнительное внутрисменное время';uk='Додатковий внутрішньозмінний час'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СводныеДанные" Тогда 
				Возврат НСтр("ru='Сводные данные';uk='Зведені дані'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДвиженийБухгалтерии" Тогда 
			Если ИмяДляПеревода = "Дебет" Тогда 
				Возврат НСтр("ru='Дебет';uk='Дебет'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Кредит" Тогда 
				Возврат НСтр("ru='Кредит';uk='Кредит'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДвиженийДенежныхСредств" Тогда 
			Если ИмяДляПеревода = "АвансыПокупателейЗаказчиков" Тогда 
				Возврат НСтр("ru='Поступление авансов от покупателей и заказчиков';uk='Надходження авансів від покупців і замовників'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратАвансовПокупателей" Тогда 
				Возврат НСтр("ru='Расход на оплату возврата авансов';uk='Витрата на оплату повернення авансів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратАвансовПоставщиков" Тогда 
				Возврат НСтр("ru='Поступления от возврата авансов';uk='Надходження від повернення авансів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратНалоговСборов" Тогда 
				Возврат НСтр("ru='Поступления от возарата налогов и сборов, кроме НДС';uk='Надходження від повернення податків і зборів, крім ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратНДС" Тогда 
				Возврат НСтр("ru='Поступления от возврата НДС';uk='Надходження від повернення ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыбытиеДочернегоПредприятия" Тогда 
				Возврат НСтр("ru='Поступления от выбытия дочернего предприятия и другой хозяйственной единицы';uk='Надходження від вибуття дочірнього підприємства або іншої господарської одиниці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыкупСобственныхАкций" Тогда 
				Возврат НСтр("ru='Расход на выкуп собственных акций';uk='Витрата на викуп власних акцій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаДивидендов" Тогда 
				Возврат НСтр("ru='Расход на оплату дивидендов';uk='Витрата на оплату дивідендів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаНеконтролируемымДолям" Тогда 
				Возврат НСтр("ru='Расход на выплаты неконтроллируемым долям в дочерних предприятиях';uk='Витрата на виплати неконтрольованих часток у дочірніх підприємствах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаПроцентов" Тогда 
				Возврат НСтр("ru='Расход на выплату процентов';uk='Витрата на виплату відсотків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаПроцентовПоДолговымОбязательствам" Тогда 
				Возврат НСтр("ru='Расход на оплату процентов';uk='Витрата на оплату відсотків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыручкаОтПродажиНеоборотныхАктивовКромеФинансовых" Тогда 
				Возврат НСтр("ru='Поступления от реализации необоротных активов';uk='Надходження від реалізації необоротних активів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыручкаОтРеализацииТоваровУслуг" Тогда 
				Возврат НСтр("ru='Поступления от реализации продукции (товаров, работ, услуг)';uk='Надходження від реалізації продукції (товарів, робіт, послуг)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаймыПредоставленные" Тогда 
				Возврат НСтр("ru='Расход финансовых учреждений на предоставление займов';uk='Витрата фінансових установ на надання позик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалогНаПрибыль" Тогда 
				Возврат НСтр("ru='Расход на оплату обязательств по налогу на прибыль';uk='Витрата на оплату зобов'язань з податку на прибуток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаАвансовПоставщикам" Тогда 
				Возврат НСтр("ru='Расход на оплату авансов';uk='Витрата на оплату авансів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаДругихНалоговСборов" Тогда 
				Возврат НСтр("ru='Расход на оплату обязательств по налогам и сборам, кроме налога на прибыль и НДС';uk='Витрата на оплату зобов'язань з податків і зборів, крім податку на прибуток та ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаНДС" Тогда 
				Возврат НСтр("ru='Расход на оплату обязательств по НДС';uk='Витрата на оплату зобов'язань з ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПоСтраховымКонтрактам" Тогда 
				Возврат НСтр("ru='Расходы на оплату обязательств по страховым контрактам';uk='Витрати на оплату зобов'язань за страховими контрактами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаСоцОбеспечения" Тогда 
				Возврат НСтр("ru='Расход от оплаты отчислений на социальные мероприятия';uk='Витрата від оплати відрахувань на соціальні заходи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаТоваровУслуг" Тогда 
				Возврат НСтр("ru='Расход на оплату товаров (работ, услуг)';uk='Витрата на оплату товарів (робіт, послуг)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаТруда" Тогда 
				Возврат НСтр("ru='Расход на оплату труда';uk='Витрата на оплату праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаЦелевыхВзносов" Тогда 
				Возврат НСтр("ru='Расход на оплату целевых взносов';uk='Витрата на оплату цільових внесків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатыДеривативы" Тогда 
				Возврат НСтр("ru='Виплаты за деривативами';uk='Виплати за деривативами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПлатежиСобственникамВСвязиСВыкупомАкций" Тогда 
				Возврат НСтр("ru='Расход на выкуп собственных акций';uk='Витрата на викуп власних акцій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПогашениеКредитовИЗаймов" Тогда 
				Возврат НСтр("ru='Расход на погашение займов';uk='Витрата на погашення позик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПогашениеОбязательствПоФинансовойАренде" Тогда 
				Возврат НСтр("ru='Расход на оплату задолженности по финансовой аренде';uk='Витрата на оплату заборгованості за фінансовою орендою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолученныеПроценты" Тогда 
				Возврат НСтр("ru='Поступления от полученных процентов';uk='Надходження від отриманих відсотків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеВозвратЗаймов" Тогда 
				Возврат НСтр("ru='Поступления от погашения займов';uk='Надходження від погашення позик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеДеривативы" Тогда 
				Возврат НСтр("ru='Поступление от деривативов';uk='Надходження від деривативів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеНеустоекШтрафовПени" Тогда 
				Возврат НСтр("ru='Поступление от должников неустойки (штрафов, пени)';uk='Надходження від боржників неустойки (штрафів, пені)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОтДивидендов" Тогда 
				Возврат НСтр("ru='Поступления от полученных дивидендов';uk='Надходження від отриманих дивідендів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеРоялти" Тогда 
				Возврат НСтр("ru='Поступления от получения роялти, авторских вознаграждений';uk='Надходження від отримання роялті, авторських винагород'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеСтраховыхПремий" Тогда 
				Возврат НСтр("ru='Поступление от страховых премий';uk='Надходження від страхових премій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеСубсидийДотаций" Тогда 
				Возврат НСтр("ru='Поступление от получения субсидий, дотаций';uk='Надходження від отримання субсидій, дотацій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступленияОтЗаймовИКредитовПолученных" Тогда 
				Возврат НСтр("ru='Поступления от получения займов';uk='Надходження від отримання позик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступленияОтОперационнойАренды" Тогда 
				Возврат НСтр("ru='Поступления от операционной аренды';uk='Надходження від операційної оренди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступленияОтПогашенияЗаймов" Тогда 
				Возврат НСтр("ru='Поступления от погашения займов';uk='Надходження від погашення позик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступленияОтПогашенияЗаймовФинучреждениями" Тогда 
				Возврат НСтр("ru='Поступления финансовых организаций от погашения займов';uk='Надходження фінансових організацій від погашення позик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступленияОтПродажиДоли" Тогда 
				Возврат НСтр("ru='Поступления от продажи доли в дочернем предприятии';uk='Надходження від продажу частки в дочірньому підприємстві'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступленияОтПродажиФинансовыхИнвестиций" Тогда 
				Возврат НСтр("ru='Поступления от реализации финансовых инвестиций';uk='Надходження від реалізації фінансових інвестицій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступленияСобственныйКапитал" Тогда 
				Возврат НСтр("ru='Поступления от собственного капитала';uk='Надходження від власного капіталу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредоставлениеЗаймов" Тогда 
				Возврат НСтр("ru='Расход на предоставление займов';uk='Витрата на надання позик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриобретениеДоли" Тогда 
				Возврат НСтр("ru='Расход на приобретение доли в дочернем предприятии';uk='Витрата на придбання частки в дочірньому підприємстві'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриобретениеДочернихОрганизаций" Тогда 
				Возврат НСтр("ru='Расход на приобретение дочернего предприятия и другой хозяйственной единицы';uk='Витрата на придбання дочірнього підприємства та іншої господарської одиниці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриобретениеНеоборотныхАктивов" Тогда 
				Возврат НСтр("ru='Расход на приобретение необоротных активов';uk='Витрата на придбання необоротних активів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриобретениеФинансовыхИнвестиций" Тогда 
				Возврат НСтр("ru='Расход на приобретение финансовых инвестиций';uk='Витрата на придбання фінансових інвестицій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроцентыПоДепозитам" Тогда 
				Возврат НСтр("ru='Поступления процентов по остаткам ДС на текущих счетах';uk='Надходження відсотків за залишками грошових коштів на поточних рахунках'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеПоступленияПоИнвестиционнойДеятельности" Тогда 
				Возврат НСтр("ru='Прочие поступления от инвестиционной деятельности';uk='Інші надходження від інвестиційної діяльності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеПоступленияПоОперационнойДеятельности" Тогда 
				Возврат НСтр("ru='Прочие поступления от операционной деятельности';uk='Інші надходження від операційної діяльності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеПоступленияПоФинансовойДеятельности" Тогда 
				Возврат НСтр("ru='Прочие поступления от финансовой деятельности';uk='Інші надходження від фінансової діяльності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРасходыПоИнвестиционнойДеятельности" Тогда 
				Возврат НСтр("ru='Прочие платежи инвестиционой деятельности';uk='Інші платежі інвестиційної діяльності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРасходыПоОперационнойДеятельности" Тогда 
				Возврат НСтр("ru='Прочие расходы операционной деятельности';uk='Інші витрати операційної діяльності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРасходыПоФинансовойДеятельности" Тогда 
				Возврат НСтр("ru='Прочие платежи финансовой деятельности';uk='Інші платежі фінансової діяльності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыПоНалогамИСборамПрочие" Тогда 
				Возврат НСтр("ru='Расход на оплату обязательств по другим налогам и сборам';uk='Витрата на оплату зобов'язань з інших податків і зборів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЦелевоеФинансирование" Тогда 
				Возврат НСтр("ru='Поступления от целевого финансирования';uk='Надходження від цільового фінансування'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДеятельностиДляДДС" Тогда 
			Если ИмяДляПеревода = "Инвестиционная" Тогда 
				Возврат НСтр("ru='Инвестиционная';uk='Інвестиційна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Операционная" Тогда 
				Возврат НСтр("ru='Операционная';uk='Операційна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Финансовая" Тогда 
				Возврат НСтр("ru='Финансовая';uk='Фінансова'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДеятельностиНДС" Тогда 
			Если ИмяДляПеревода = "Необлагаемая" Тогда 
				Возврат НСтр("ru='Необлагаемая';uk='Неоподатковувана'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Облагаемая" Тогда 
				Возврат НСтр("ru='Облагаемая';uk='Оподатковувана'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПропорциональноОблагаемая" Тогда 
				Возврат НСтр("ru='Пропорционально облагаемая';uk='Пропорційно оподатковувана'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДнейПроизводственногоКалендаря" Тогда 
			Если ИмяДляПеревода = "Воскресенье" Тогда 
				Возврат НСтр("ru='Воскресенье';uk='Неділя'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Праздник" Тогда 
				Возврат НСтр("ru='Праздник';uk='Свято'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Предпраздничный" Тогда 
				Возврат НСтр("ru='Предпраздничный';uk='Передсвятковий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Рабочий" Тогда 
				Возврат НСтр("ru='Рабочий';uk='Робочий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Суббота" Тогда 
				Возврат НСтр("ru='Суббота';uk='Субота'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДоговоровССотрудниками" Тогда 
			Если ИмяДляПеревода = "ВоеннослужащийПоПризыву" Тогда 
				Возврат НСтр("ru='Военнослужащий по призыву';uk='Військовослужбовець за призовом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоговорМуниципальногоСлужащего" Тогда 
				Возврат НСтр("ru='Договор муниципального служащего';uk='Договір муніципального службовця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КонтрактВоеннослужащего" Тогда 
				Возврат НСтр("ru='Контракт военнослужащего';uk='Контракт військовослужбовця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КонтрактГосслужащего" Тогда 
				Возврат НСтр("ru='Контракт госслужащего';uk='Контракт держслужбовця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТрудовойДоговор" Тогда 
				Возврат НСтр("ru='Трудовой договор';uk='Трудовий договір'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГигКонтракт" Тогда 
				Возврат НСтр("ru='Гиг-контракт';uk='Гіг-контракт'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДокументовМежрасчетныхНачислений" Тогда 
			Если ИмяДляПеревода = "БольничныйЛист" Тогда 
				Возврат НСтр("ru='Больничный лист';uk='Лікарняний лист'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратНДФЛ" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Возврат НДФЛ';uk='ѳ(не український) Повернення ПДФО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕдиновременноеПособиеЗаСчетФСС" Тогда 
				Возврат НСтр("ru='Единовременное пособие за счет социального страхования';uk='Одноразова допомога за рахунок соціального страхування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Командировка" Тогда 
				Возврат НСтр("ru='Командировка';uk='Відрядження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомпенсацияЗаЗадержкуЗарплаты" Тогда 
				Возврат НСтр("ru='Компенсация за задержку выплаты заработной платы';uk='Компенсація за затримку виплати заробітної плати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МатериальнаяПомощь" Тогда 
				Возврат НСтр("ru='Материальная помощь';uk='Матеріальна допомога'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачислениеЗарплаты" Тогда 
				Возврат НСтр("ru='Начисление зарплаты';uk='Нарахування зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаДнейУходаЗаДетьмиИнвалидами" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Оплата дней ухода за детьми-инвалидами';uk='ѳ(не український) Оплата днів догляду за дітьми-інвалідами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПоСреднемуЗаработку" Тогда 
				Возврат НСтр("ru='Оплата по среднему заработку';uk='Оплата за середнім заробітком'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отпуск" Тогда 
				Возврат НСтр("ru='Отпуск';uk='Відпустка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускПоУходуЗаРебенком" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Отпуск по уходу за ребенком';uk='ѳ(не український) Відпустка по догляду за дитиною'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Премия" Тогда 
				Возврат НСтр("ru='Премия';uk='Премія'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПростойСотрудников" Тогда 
				Возврат НСтр("ru='Простой сотрудников';uk='Простій співробітників'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазовоеНачисление" Тогда 
				Возврат НСтр("ru='Разовое начисление';uk='Разове нарахування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Увольнение" Тогда 
				Возврат НСтр("ru='Увольнение';uk='Звільнення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДокументовНачисления" Тогда 
			Если ИмяДляПеревода = "БольничныйЛист" Тогда 
				Возврат НСтр("ru='Больничный лист';uk='Лікарняний лист'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоходВНатуральнойФорме" Тогда 
				Возврат НСтр("ru='Доход в натуральной форме';uk='Дохід у натуральній формі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Командировка" Тогда 
				Возврат НСтр("ru='Командировка';uk='Відрядження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МатериальнаяПомощь" Тогда 
				Возврат НСтр("ru='Материальная помощь';uk='Матеріальна допомога'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаДнейУходаЗаДетьмиИнвалидами" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Оплата дней ухода за детьми инвалидами';uk='ѳ(не український) Оплата днів догляду за дітьми інвалідами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПоСреднемуЗаработку" Тогда 
				Возврат НСтр("ru='Отсутствие с сохранением оплаты';uk='Відсутність із збереженням оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отгул" Тогда 
				Возврат НСтр("ru='Отгул';uk='Відгул'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отпуск" Тогда 
				Возврат НСтр("ru='Отпуск';uk='Відпустка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускБезСохраненияОплаты" Тогда 
				Возврат НСтр("ru='Отпуск без сохранения оплаты';uk='Відпустка без збереження оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Премия" Тогда 
				Возврат НСтр("ru='Премия';uk='Премія'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрогулНеявка" Тогда 
				Возврат НСтр("ru='Прогул, неявка';uk='Прогул, неявка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПростойСотрудников" Тогда 
				Возврат НСтр("ru='Простой сотрудников';uk='Простій співробітників'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазовоеНачисление" Тогда 
				Возврат НСтр("ru='Разовое начисление';uk='Разове нарахування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Увольнение" Тогда 
				Возврат НСтр("ru='Увольнение';uk='Звільнення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДокументовУдержания" Тогда 
			Если ИмяДляПеревода = "Увольнение" Тогда 
				Возврат НСтр("ru='Увольнение';uk='Звільнення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДополнительныхОтчетовИОбработок" Тогда 
			Если ИмяДляПеревода = "ДополнительнаяОбработка" Тогда 
				Возврат НСтр("ru='Дополнительная обработка';uk='Додаткова обробка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДополнительныйОтчет" Тогда 
				Возврат НСтр("ru='Дополнительный отчет';uk='Додатковий звіт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаполнениеОбъекта" Тогда 
				Возврат НСтр("ru='Заполнение объекта';uk='Заповнення об'єкта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отчет" Тогда 
				Возврат НСтр("ru='Отчет';uk='Звіт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПечатнаяФорма" Тогда 
				Возврат НСтр("ru='Печатная форма';uk='Друкована форма'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроверкаУсловияПредоставленияСкидкиНаценки" Тогда 
				Возврат НСтр("ru='Проверка условия предоставления скидки (наценки)';uk='Перевірка умови надання знижки (націнки)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетСкидкиНаценки" Тогда 
				Возврат НСтр("ru='Расчет скидки (наценки)';uk='Розрахунок знижки (націнки)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СозданиеСвязанныхОбъектов" Тогда 
				Возврат НСтр("ru='Создание связанных объектов';uk='Створення зв'язаних об'єктів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ШаблонСообщения" Тогда 
				Возврат НСтр("ru='Шаблон сообщения';uk='Шаблон повідомлення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДоставки" Тогда 
			Если ИмяДляПеревода = "НаСклад" Тогда 
				Возврат НСтр("ru='Доставка на наш склад';uk='Доставка на наш склад'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СоСклада" Тогда 
				Возврат НСтр("ru='Доставка с нашего склада';uk='Доставка з нашого складу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыЕСВ" Тогда 
			Если ИмяДляПеревода = "Больничные" Тогда 
				Возврат НСтр("ru='Больничные';uk='Лікарняні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Декретные" Тогда 
				Возврат НСтр("ru='Декретные';uk='Декретні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачисленияМобилизованным" Тогда 
				Возврат НСтр("ru='Начисления мобилизованным';uk='Нарахування мобілізованим'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеУчитывается" Тогда 
				Возврат НСтр("ru='Не учитывается';uk='Не враховується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсновнаяЗарплата" Тогда 
				Возврат НСтр("ru='Основная зарплата';uk='Основна зарплата'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоДоговорамГПХ" Тогда 
				Возврат НСтр("ru='По договорам ГПХ';uk='За договорами ЦПХ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоГигКонтрактам" Тогда 
				Возврат НСтр("ru='По гиг-контрактам';uk='За гіг-контрактами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыЗанятости" Тогда 
			Если ИмяДляПеревода = "ВнутреннееСовместительство" Тогда 
				Возврат НСтр("ru='Внутреннее совместительство';uk='Внутрішнє сумісництво'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсновноеМестоРаботы" Тогда 
				Возврат НСтр("ru='Основное место работы';uk='Основне місце роботи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подработка" Тогда 
				Возврат НСтр("ru='Подработка';uk='Підробіток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Совместительство" Тогда 
				Возврат НСтр("ru='Внешнее совместительство';uk='Зовнішнє сумісництво'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыИсполнительныхДокументов" Тогда 
			Если ИмяДляПеревода = "ИсполнительныйЛист" Тогда 
				Возврат НСтр("ru='Исполнительный лист';uk='Виконавчий лист'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СоглашениеОбУплатеАлиментов" Тогда 
				Возврат НСтр("ru='Соглашение об уплате алиментов';uk='Угода про сплату аліментів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыИспользованияАмортизации" Тогда 
			Если ИмяДляПеревода = "ДругиеКапитальныеРаботы" Тогда 
				Возврат НСтр("ru='Другие капитальные работы';uk='Інші капітальні роботи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПогашениеПолученныхЗаймов" Тогда 
				Возврат НСтр("ru='Погашение полученных на капитальные инвестиции займов';uk='Погашення отриманих на капітальні інвестиції позик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриобретениеНематериальныхАктивов" Тогда 
				Возврат НСтр("ru='Приобретение (изготовление) нематериальных активов';uk='Придбання (виготовлення) нематеріальних активів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриобретениеОсновныхСредств" Тогда 
				Возврат НСтр("ru='Приобретение (изготовление) основных средств';uk='Придбання (виготовлення) основних засобів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтроительствоОбъектов" Тогда 
				Возврат НСтр("ru='Строительство объектов';uk='Будівництво об'єктів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УлучшениеОсновныхСредств" Тогда 
				Возврат НСтр("ru='Улучшение основных средств';uk='Поліпшення основних засобів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыКадровыхСобытий" Тогда 
			Если ИмяДляПеревода = "НачальныеДанные" Тогда 
				Возврат НСтр("ru='Начальные данные';uk='Початкові дані'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Перемещение" Тогда 
				Возврат НСтр("ru='Перемещение';uk='Переміщення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прием" Тогда 
				Возврат НСтр("ru='Прием';uk='Прийом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Увольнение" Тогда 
				Возврат НСтр("ru='Увольнение';uk='Звільнення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыКодовДляНалоговойНакладной" Тогда 
			Если ИмяДляПеревода = "КодТовара" Тогда 
				Возврат НСтр("ru='Товар';uk='Товар'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КодТовараИмпортированного" Тогда 
				Возврат НСтр("ru='Импортированный товар';uk='Імпортований товар'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КодУслуги" Тогда 
				Возврат НСтр("ru='Услуга';uk='Послуга'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыКонтроляТоваровОрганизаций" Тогда 
			Если ИмяДляПеревода = "КонецДняКонецМесяцаИДатаПоследнегоДвижения" Тогда 
				Возврат НСтр("ru='На конец дня и оперативный';uk='На кінець дня і оперативний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КонецМесяцаИДатаПоследнегоДвижения" Тогда 
				Возврат НСтр("ru='На конец месяца и оперативный';uk='На кінець місяця і оперативний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыМестВыплатыЗарплаты" Тогда 
			Если ИмяДляПеревода = "БанковскийСчет" Тогда 
				Возврат НСтр("ru='Перечислением на счет в банке';uk='Перерахуванням на рахунок в банку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗарплатныйПроект" Тогда 
				Возврат НСтр("ru='Зачислением на карточку';uk='Зарахуванням на картку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Касса" Тогда 
				Возврат НСтр("ru='Через кассу';uk='Через касу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Раздатчик" Тогда 
				Возврат НСтр("ru='Через раздатчика';uk='Через роздавальника'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыНазначенияДатЗапрета" Тогда 
			Если ИмяДляПеревода = "ДляВсехИнформационныхБаз" Тогда 
				Возврат НСтр("ru='Для всех информационных баз';uk='Для всіх інформаційних баз'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДляВсехПользователей" Тогда 
				Возврат НСтр("ru='Для всех пользователей';uk='Для всіх користувачів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыНалоговыхГруппНА" Тогда 
			Если ИмяДляПеревода = "ДоНКУ" Тогда 
				Возврат НСтр("ru='до 01.04.2011 (устаревшие)';uk='до 01.04.2011 (застарілі)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НМА" Тогда 
				Возврат НСтр("ru='НМА';uk='НМА'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОС" Тогда 
				Возврат НСтр("ru='ОС';uk='ОЗ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыНалоговыхДеклараций" Тогда 
			Если ИмяДляПеревода = "Безработица" Тогда 
				Возврат НСтр("ru='Отчет в ФСС на случай безработицы';uk='Звіт у ФСС на випадок безробіття'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДекларацияОПрибыли" Тогда 
				Возврат НСтр("ru='(не используется) Декларация о прибыли (до 01.04.2011)';uk='(не викоритовується) Декларація про прибуток(до 01.04.2011)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДекларацияПоАкцизномуНалогу" Тогда 
				Возврат НСтр("ru='Декларация по акцизному налогу';uk='Декларація акцизного податку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДекларацияПоНалогуНаПрибыль2015" Тогда 
				Возврат НСтр("ru='Декларация по налогу на прибыль';uk='Декларація з податку на прибуток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДекларацияПоНалогуНаПрибыльНКУ" Тогда 
				Возврат НСтр("ru='(не используется) Декларация по налогу на прибыль (до 01.01.2015)';uk='(не використовується) Декларація з податку на прибуток (до 01.01.2015)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДекларацияПоНДС" Тогда 
				Возврат НСтр("ru='Декларация по НДС';uk='Декларація з ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕдиныйНалог" Тогда 
				Возврат НСтр("ru='Отчет по Единому налогу';uk='Звіт по Єдиному податку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕСВ" Тогда 
				Возврат НСтр("ru='Отчет по ЕСВ';uk='Звіт по ЄСВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НесчастныйСлучай" Тогда 
				Возврат НСтр("ru='Отчет в ФСС от несчастных случаев';uk='Звіт у ФСС від нещасних випадків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчетОбИспользованииРабочегоВремени" Тогда 
				Возврат НСтр("ru='Отчет об использовании рабочего времени';uk='Звіт про використання робочого часу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчетПоТруду" Тогда 
				Возврат НСтр("ru='Отчет по труду';uk='Звіт по праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Пенсионный" Тогда 
				Возврат НСтр("ru='Отчет в ПФ';uk='Звіт у ПФ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УтратаТрудоспобности" Тогда 
				Возврат НСтр("ru='Отчет в ФСС в связи с утратой трудоспобности';uk='Звіт у ФСС у зв'язку із втратою працездатності'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыНачисленийДляТиповыхОтчетов" Тогда 
			Если ИмяДляПеревода = "БольничныеЗаСчетПредприятия" Тогда 
				Возврат НСтр("ru='Оплата первых 5 дней временной нетрудоспособности за счет предприятия';uk='Оплата перших 5 днів тимчасової непрацездатності за рахунок підприємства'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВзносыПредприятийНаМедИПенсСтрахование" Тогда 
				Возврат НСтр("ru='Взносы предприятий на медицинское и пенсионное страхование работников';uk='Внески підприємств на медичне та пенсійне страхування працівників'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВознагражденияРазовогоХарактера" Тогда 
				Возврат НСтр("ru='Вознаграждения и поощрения разового характера';uk='Винагороди та заохочення разового характеру'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатыСоциальногоХарактера" Тогда 
				Возврат НСтр("ru='Выплаты социального характера';uk='Виплати соціального характеру'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыполнениеОбязанностейВременноОтсутствующегоРаботника" Тогда 
				Возврат НСтр("ru='Выполнение обязанностей временно отсутствующего работника';uk='Виконання обов'язків тимчасово відсутнього працівника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыполнениеОсобоВажнойРаботы" Тогда 
				Возврат НСтр("ru='Выполнение особо важной работы на определенный срок';uk='Виконання особливо важливої роботи на певний строк'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВысокиеДостиженияТруда" Тогда 
				Возврат НСтр("ru='Высокие достижения труда';uk='Високі досягнення праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВысокоеПрофессиональноеМастерство" Тогда 
				Возврат НСтр("ru='Высокое профессиональное мастерство';uk='Висока професійну майстерність'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГонорарАвторскоеВознаграждение" Тогда 
				Возврат НСтр("ru='Гонорар авторское вознаграждение';uk='Гонорар авторська винагорода'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДивидендыПроцентыВыплатыЗаПаями" Тогда 
				Возврат НСтр("ru='Дивиденды, проценты, выплаты за паями';uk='Дивіденди, відсотки, виплати за паями'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДопускКГосударственнойТайне" Тогда 
				Возврат НСтр("ru='Допуск к государственной тайне';uk='Допуск до державної таємниці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДругиеВидыНачисленийДопФОТ" Тогда 
				Возврат НСтр("ru='Другие виды начислений (фонд дополнительной заработной платы)';uk='Інші види нарахувань (фонд додаткової заробітної плати)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДругиеВидыНачисленийНеФОТ" Тогда 
				Возврат НСтр("ru='Другие виды начислений, не принадлежащие фонду оплаты труда';uk='Інші види нарахувань, що не належать до фонду оплати праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДругиеВидыНачисленийФОТ" Тогда 
				Возврат НСтр("ru='Другие виды начислений, принадлежащие фонду оплаты труда';uk='Інші види нарахувань, що належать фонду оплати праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДругиеВыплатыНеФОТ" Тогда 
				Возврат НСтр("ru='Другие выплаты, не принадлежащие фонду оплаты труда';uk='Інші виплати, що не належать фонду оплати праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДругиеНадбавкиИДоплаты" Тогда 
				Возврат НСтр("ru='Другие надбавки и доплаты';uk='Інші надбавки та доплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДругиеНачисленияЗаНеотработанноеВремя" Тогда 
				Возврат НСтр("ru='Другие начисления за неотработанное время';uk='Інші нарахування за невідпрацьований час'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДругиеПоощрительныеИКомпенсационныеВыплаты" Тогда 
				Возврат НСтр("ru='Другие поощрительные и компенсационные выплаты';uk='Інші заохочувальні та компенсаційні виплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗатратыНаБесплатныйПроезд" Тогда 
				Возврат НСтр("ru='Затраты на бесплатный проезд';uk='Витрати на безкоштовний проїзд'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗатратыНаКомандировки" Тогда 
				Возврат НСтр("ru='Затраты на командировки';uk='Витрати на відрядження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗнаниеИностранногоЯзыка" Тогда 
				Возврат НСтр("ru='Знание и использование в работе иностранного языка';uk='Знання та використання в роботі іноземної мови'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗначениеПеречисления1" Тогда 
				Возврат НСтр("ru='';uk=''" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИндексацияЗарплаты" Тогда 
				Возврат НСтр("ru='Индексация зарплаты';uk='Індексація зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИнтенсивностьТруда" Тогда 
				Возврат НСтр("ru='Интенсивность труда';uk='Інтенсивність праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КлассностьВодителямТранспортныхСредств" Тогда 
				Возврат НСтр("ru='Классность водителям транспортных средств';uk='Класність водіям транспортних засобів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомиссионныеОтРеализацииПродукции" Тогда 
				Возврат НСтр("ru='Комиссионные от реализации продукции';uk='Комісійні від реалізації продукції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомпенсацияЗаНарушениеСроковВыплатыЗП" Тогда 
				Возврат НСтр("ru='Компенсация работникам в связи с нарушением сроков выплаты ЗП';uk='Компенсація працівникам у зв'язку з порушенням строків виплати ЗП'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МатпомощьРазовогоХарактера" Тогда 
				Возврат НСтр("ru='Матпомощь разового характера';uk='Матеріальна допомога разового характеру'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаучнаяСтепень" Тогда 
				Возврат НСтр("ru='Научная степень';uk='Наукова ступінь'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НормативноеВремяПередвиженияВШахте" Тогда 
				Возврат НСтр("ru='Нормативное время передвижения в шахте';uk='Нормативний час пересування у шахті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаДнейОтдыха" Тогда 
				Возврат НСтр("ru='Оплата дней отдыха';uk='Оплата днів відпочинку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаЗаПрофобучение" Тогда 
				Возврат НСтр("ru='Оплата за профобучение';uk='Оплата за профнавчання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаРаботыСверхурочноВПраздникиНерабочиеДни" Тогда 
				Возврат НСтр("ru='Оплата работы в сверхурочное время, в праздничные и нерабочие дни';uk='Оплата роботи в надурочний час, у святкові і неробочі дні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаТрудаВКомандировке" Тогда 
				Возврат НСтр("ru='Оплата труда в командировке';uk='Оплата праці у відрядженні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отпускные" Тогда 
				Возврат НСтр("ru='Отпускные';uk='Відпускні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПомощьИДругиеВыплатыЗаСчетФСС" Тогда 
				Возврат НСтр("ru='Помощь и другие выплаты, производящиеся за счет средств ФСС';uk='Допомога та інші виплати, що проводяться за рахунок коштів ФСС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Премия" Тогда 
				Возврат НСтр("ru='Премия';uk='Премія'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрофсоюзныйВзнос" Тогда 
				Возврат НСтр("ru='Профсоюзный взнос';uk='Профспілковий внесок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроцентныеКомиссионныеВознаграждения" Тогда 
				Возврат НСтр("ru='Процентные или комиссионные вознаграждения';uk='Процентні або комісійні винагороди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаботаВНочноеВремя" Тогда 
				Возврат НСтр("ru='Работа в ночное время';uk='Робота в нічний час'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаботаВТяжелыхВредныхУсловиях" Тогда 
				Возврат НСтр("ru='Работа в тяжелых и вредных и особо тяжелых и особо вредных условиях';uk='Робота у важких і шкідливих та особливо важких і особливо шкідливих умовах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаботаНаТерриторияхРадиоактивногоЗагрязнения" Тогда 
				Возврат НСтр("ru='Работа на территориях радиоактивного загрязнения';uk='Робота на територіях радіоактивного забруднення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РангиЗвания" Тогда 
				Возврат НСтр("ru='Дипломатические ранги, персональные звания служебных лиц, ранги госслужащих, квалификационные классы судей';uk='Дипломатичні ранги, персональні звання службових осіб, ранги державних службовців, кваліфікаційні класи суддів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасширениеЗоныОбслуживания" Тогда 
				Возврат НСтр("ru='Расширение зоны обслуживания или увеличение объема работ';uk='Розширення зони обслуговування або збільшення обсягу робіт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РуководствоБригадой" Тогда 
				Возврат НСтр("ru='Руководство бригадой';uk='Керівництво бригадою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СистематическаяМатпомощь" Тогда 
				Возврат НСтр("ru='Систематическая матпомощь';uk='Систематична матдопомога'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СовмещениеПрофессий" Тогда 
				Возврат НСтр("ru='Совмещение профессий';uk='Суміщення професій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтоимостьПродукцииПриНатуральнойОплатеТруда" Тогда 
				Возврат НСтр("ru='Стоимость продукции при натуральной оплате труда';uk='Вартість продукції при натуральній оплаті праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтоимостьФорменнойОдежды" Тогда 
				Возврат НСтр("ru='Стоимость форменной одежды';uk='Вартість форменого одягу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТарифнаяСтавкаОклад" Тогда 
				Возврат НСтр("ru='Тарифная ставка оклад';uk='Тарифна ставка, оклад'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыНефинансовыхПоказателей" Тогда 
			Если ИмяДляПеревода = "Денежный" Тогда 
				Возврат НСтр("ru='Денежный';uk='Грошовий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Количественный" Тогда 
				Возврат НСтр("ru='Количественный';uk='Кількісний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Коэффициенты" Тогда 
				Возврат НСтр("ru='Коэффициенты';uk='Коефіцієнти'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыНМА" Тогда 
			Если ИмяДляПеревода = "ПатентыИИныеПрава" Тогда 
				Возврат НСтр("ru='Патенты и иные права';uk='Патенти та інші права'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрограммноеОбеспечение" Тогда 
				Возврат НСтр("ru='Программное обеспечение';uk='Програмне забезпечення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеНематериальныеАктивы" Тогда 
				Возврат НСтр("ru='Прочие нематериальные активы';uk='Інші нематеріальні активи'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОбязательногоСтрахованияСотрудников" Тогда 
			Если ИмяДляПеревода = "ДоплатаКПенсииЛетчикам" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Доплата к пенсии летчикам';uk='ѳ(не український) Доплата до пенсії льотчикам'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоплатаКПенсииШахтерам" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Доплата к пенсии шахтерам';uk='ѳ(не український) Доплата до пенсії шахтарям'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРЗаЗанятыхНаПодземныхИВредныхРаботах" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) ПФР, за занятых на работах с вредными условиями труда';uk='ѳ(не український) ПФР, зайнятих на роботах з шкідливими умовами праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) ПФР, за занятых на работах с тяжелыми условиями труда';uk='ѳ(не український) ПФР, зайнятих на роботах з важкими умовами праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРНакопительная" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) ПФР - накопительная часть пенсии за 2010 - 2013 годы';uk='ѳ(не український) ПФР - накопичувальна частина пенсії за 2010 - 2013 роки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРПоСуммарномуТарифу" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) ПФР - по суммарному тарифу с 1 января 2014 года';uk='ѳ(не український) ПФР - за сумарним тарифом з 1 січня 2014 року'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРСПревышения" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) ПФР - с базы сверх предельной величины, с 1 января 2016 года';uk='ѳ(не український) ПФР - з бази понад граничної величини, з 1 січня 2016 року'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРСтраховая" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) ПФР - страховая часть пенсии за 2010 - 2013 годы';uk='ѳ(не український) ПФР - страхова частина пенсії за 2010 - 2013 роки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТФОМС" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) ТФОМС';uk='ѳ(не український) ТФОМС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФСС" Тогда 
				Возврат НСтр("ru='ПФУ (ФСС)';uk='ПФУ (ФСС)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФССНесчастныеСлучаи" Тогда 
				Возврат НСтр("ru='(до октября 2018 г.) ФСС, страхование от несчастных случаев';uk='(до жовтня 2018 р.) ФСС, страхування від нещасних випадків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФФОМС" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) ФФОМС';uk='ѳ(не український) ФФОМС'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОграниченияПособия" Тогда 
			Если ИмяДляПеревода = "БезОграничений" Тогда 
				Возврат НСтр("ru='Отсутствует';uk='Відсутній'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МаксимальныйРазмерЕжемесячнойСтраховойВыплаты" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Максимальным размером ежемесячной страховой выплаты';uk='ѳ(не український) Максимальним розміром щомісячної страхової виплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбщееОграничение" Тогда 
				Возврат НСтр("ru='Предельной величиной базы для начисления страховых взносов';uk='Граничною величиною бази для нарахування страхових внесків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОграничениеВРазмереДвухММОТ" Тогда 
				Возврат НСтр("ru='Ограничение в размере двух ММОТ';uk='Обмеження в розмірі двох ММОП'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОграничениеВРазмереММОТ" Тогда 
				Возврат НСтр("ru='В размере ММОТ';uk='У розмірі ММОП'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийВзаимозачетаЗадолженности" Тогда 
			Если ИмяДляПеревода = "Бартер" Тогда 
				Возврат НСтр("ru='Зачет встречных обязательств';uk='Залік зустрічних зобов'язань'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Клиента" Тогда 
				Возврат НСтр("ru='Взаимозачет по операциям одного клиента';uk='Взаємозалік за операціями одного клієнта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КлиентаМеждуОрганизациями" Тогда 
				Возврат НСтр("ru='Взаимозачет с участием двух организаций для одного клиента';uk='Взаємозалік з участю двох організацій для одного клієнта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МеждуКлиентами" Тогда 
				Возврат НСтр("ru='Взаимозачет организации с двумя клиентами';uk='Взаємозалік організації з двома клієнтами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МеждуПоставщиками" Тогда 
				Возврат НСтр("ru='Взаимозачет организации с двумя поставщиками';uk='Взаємозалік організації з двома постачальниками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Поставщика" Тогда 
				Возврат НСтр("ru='Взаимозачет по операциям одного поставщика';uk='Взаємозалік за операціями одного постачальника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоставщикаМеждуОрганизациями" Тогда 
				Возврат НСтр("ru='Взаимозачет с участием двух организаций для одного поставщика';uk='Взаємозалік з участю двох організацій для одного постачальника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Произвольный" Тогда 
				Возврат НСтр("ru='Произвольный взаимозачет';uk='Довільний взаємозалік'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийКорректировкиНазначения" Тогда 
			Если ИмяДляПеревода = "ПроизвольнаяКорректировкаНазначений" Тогда 
				Возврат НСтр("ru='Произвольная корректировка назначений';uk='Довільне коригування призначень'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Резервировать" Тогда 
				Возврат НСтр("ru='Резервирование';uk='Резервування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РезервироватьИКорректировать" Тогда 
				Возврат НСтр("ru='Резервирование и корректировка';uk='Резервування та коригування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СнятьРезерв" Тогда 
				Возврат НСтр("ru='Снятие резерва';uk='Зняття резерву'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СнятьРезервПоМногимНазначениям" Тогда 
				Возврат НСтр("ru='Снятие резерва по многим назначениям';uk='Зняття резерву за багатьма призначеннями'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийКорректировкиОрдераНаТовары" Тогда 
			Если ИмяДляПеревода = "ОставитьВЗонеОтгрузки" Тогда 
				Возврат НСтр("ru='(не используется) Оставить в зоне отгрузки';uk='(не використовується) Залишити в зоні відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтразитьИзлишек" Тогда 
				Возврат НСтр("ru='Отразить излишек';uk='Відобразити надлишок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтразитьИзлишекОставитьВЗонеОтгрузки" Тогда 
				Возврат НСтр("ru='(не используется)  Отразить излишек и оставить в зоне отгрузки';uk='(не використовується) Відобразити надлишок і залишити в зоні відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтразитьНедостачу" Тогда 
				Возврат НСтр("ru='Отразить недостачу';uk='Відобразити нестачу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеренестиВДругойОрдер" Тогда 
				Возврат НСтр("ru='Перенести в другой ордер';uk='Перенести в інший ордер'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийНалоговыхДокументов" Тогда 
			Если ИмяДляПеревода = "ИтоговаяРозницаОблагаемыеОперации" Тогда 
				Возврат НСтр("ru='Итоговая в рознице по операциям, облагаемым НДС';uk='Підсумкова в роздробі по операціях, оподатковуваних ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИтоговаяРозницаОсвобожденныеОперации" Тогда 
				Возврат НСтр("ru='Итоговая в рознице по операциям, освобожденным от НДС';uk='Підсумкова в роздробі за операціями, що звільнені від ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеНДСОперации" Тогда 
				Возврат НСтр("ru='Операции, не являющиеся объектом налогообложения';uk='Операції, що не є об'єктом оподатковування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОблагаемыеОперации" Тогда 
				Возврат НСтр("ru='Операции, облагаемые НДС';uk='Операції, оподатковувані ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсвобожденныеОперации" Тогда 
				Возврат НСтр("ru='Операции, освобожденные от НДС';uk='Операції, звільнені від ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродажаНижеОбычнойЦены" Тогда 
				Возврат НСтр("ru='Превышение базы над ценой поставки';uk='Перевищення бази над ціною поставки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаботыОтНерезидента" Тогда 
				Возврат НСтр("ru='Работы от нерезидента';uk='Роботи від нерезидента'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РозницаКонрагентуОблагаемыеОперации" Тогда 
				Возврат НСтр("ru='Реализация в розницу плательщику НДС по облагаемому НДС';uk='Реалізація в роздріб платнику ПДВ по оподатковуваному ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РозницаКонрагентуОсвобожденныеОперации" Тогда 
				Возврат НСтр("ru='Реализация в розницу плательщику НДС по освобожденному НДС';uk='Реалізація в роздріб платнику ПДВ по звільненому ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СводнаяУсловнаяПродажа" Тогда 
				Возврат НСтр("ru='Условная продажа при приобретении';uk='Умовний продаж при придбанні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УсловнаяПродажа" Тогда 
				Возврат НСтр("ru='Условная продажа при использовании';uk='Умовний продаж при використанні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УсловнаяПродажаНеоборотныхАктивов" Тогда 
				Возврат НСтр("ru='Условная продажа необоротных активов';uk='Умовний продаж необоротних активів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийОтбораРазмещенияТоваров" Тогда 
			Если ИмяДляПеревода = "Отбор" Тогда 
				Возврат НСтр("ru='Отбор';uk='Відбір'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Перемещение" Тогда 
				Возврат НСтр("ru='Перемещение';uk='Переміщення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Размещение" Тогда 
				Возврат НСтр("ru='Размещение';uk='Розміщення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПоЗарплате" Тогда 
			Если ИмяДляПеревода = "АлиментыПрочиеИсполнительныеЛисты" Тогда 
				Возврат НСтр("ru='Алименты и прочие исполнительные листы';uk='Аліменти та інші виконавчі листи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВоенныйСбор" Тогда 
				Возврат НСтр("ru='Военный сбор';uk='Військовий збір'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок" Тогда 
				Возврат НСтр("ru='Возврат излишне выплаченных суммы вследствие счетных ошибок';uk='Повернення зайво виплачених суми внаслідок лічильних помилок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозмещениеУщерба" Тогда 
				Возврат НСтр("ru='Возмещение ущерба';uk='Відшкодування шкоди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВознаграждениеПлатежногоАгента" Тогда 
				Возврат НСтр("ru='Вознаграждение платежного агента';uk='Винагорода платіжного агента'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатыБывшимСотрудникам" Тогда 
				Возврат НСтр("ru='Выплаты бывшим сотрудникам';uk='Виплати колишнім працівникам'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Депонирование" Тогда 
				Возврат НСтр("ru='Депонирование зарплаты';uk='Депонування зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Дивиденды" Тогда 
				Возврат НСтр("ru='Дивиденды';uk='Дивіденди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДивидендыСотрудников" Тогда 
				Возврат НСтр("ru='Дивиденды сотрудников';uk='Дивіденди співробітників'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДобровольныеВзносыВНПФ" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Добровольные взносы в НПФ';uk='ѳ(не український) Добровільні внески в НПФ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоговорАвторскогоЗаказа" Тогда 
				Возврат НСтр("ru='Договор авторского заказа';uk='Договір авторського замовлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоговорРаботыУслуги" Тогда 
				Возврат НСтр("ru='Договор (работы, услуги)';uk='Договір (роботи, послуги)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоходыКонтрагентов" Тогда 
				Возврат НСтр("ru='Доходы контрагентов';uk='Доходи контрагентів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДСВ" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Добровольные взносы на накопительную часть пенсии';uk='ѳ(не український) Добровільні внески на накопичувальну частину пенсії'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕжегодныйОтпуск" Тогда 
				Возврат НСтр("ru='Ежегодный отпуск';uk='Щорічна відпустка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕжегодныйОтпускОценочныеОбязательства" Тогда 
				Возврат НСтр("ru='Ежегодный отпуск за счет оценочных обязательств ';uk='Щорічна відпустка за рахунок оціночних зобов'язань '" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕжегодныйОтпускОценочныеОбязательстваИРезервы" Тогда 
				Возврат НСтр("ru='Ежегодный отпуск за счет оценочных обязательств и резервов';uk='Щорічна відпустка за рахунок оціночних зобов'язань і резервів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕжегодныйОтпускОценочныеОбязательстваИРезервыБУ" Тогда 
				Возврат НСтр("ru='Отпуск за счет обязательств и резервов (БУ)';uk='Відпустка за рахунок зобов'язань і резервів (БУ)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕжегодныйОтпускОценочныеОбязательстваИРезервыНУ" Тогда 
				Возврат НСтр("ru='Отпуск за счет обязательств и резервов (НУ)';uk='Відпустка за рахунок зобов'язань і резервів (НУ)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕжегодныйОтпускРезервы" Тогда 
				Возврат НСтр("ru='Ежегодный отпуск за счет резервов';uk='Щорічна відпустка за рахунок резервів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомпенсацияЕжегодногоОтпуска" Тогда 
				Возврат НСтр("ru='Компенсация ежегодного отпуска';uk='Компенсація щорічної відпустки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомпенсацияЕжегодногоОтпускаОценочныеОбязательства" Тогда 
				Возврат НСтр("ru='Компенсация ежегодного отпуска за счет оценочных обязательств';uk='Компенсація щорічної відпустки за рахунок оціночних зобов'язань'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомпенсацияЗаЗадержкуЗарплаты" Тогда 
				Возврат НСтр("ru='Компенсация за задержку зарплаты';uk='Компенсація за затримку зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МатериальнаяПомощь" Тогда 
				Возврат НСтр("ru='Материальная помощь';uk='Матеріальна допомога'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НатуральныйДоход" Тогда 
				Возврат НСтр("ru='Доходы в натуральной форме';uk='Доходи у натуральній формі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачислениеЕСВ" Тогда 
				Возврат НСтр("ru='Начисление ЕСВ на ФОТ';uk='Нарахування ЄСВ на ФОП'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачисленоДоход" Тогда 
				Возврат НСтр("ru='Начислено';uk='Нараховано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачисленоПроцентовПоЗайму" Тогда 
				Возврат НСтр("ru='Начислено процентов по займу';uk='Нараховано відсотків за позикою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачисленоСдельноДоход" Тогда 
				Возврат НСтр("ru='Начислено (сдельно)';uk='Нараховано (відрядно)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛ" Тогда 
				Возврат НСтр("ru='НДФЛ';uk='ПДФО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛДоначисленныйПоРезультатамПроверки" Тогда 
				Возврат НСтр("ru='НДФЛ, доначисленный по результатам проверки';uk='ПДФО, донарахований за результатами перевірки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛДоходыКонтрагентов" Тогда 
				Возврат НСтр("ru='НДФЛ с доходов контрагентов';uk='ПДФО з доходів контрагентів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛПередачаЗадолженностиВНалоговыйОрган" Тогда 
				Возврат НСтр("ru='НДФЛ передача задолженности в налоговый орган';uk='ПДФО передача заборгованості в податковий орган'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛПрочиеРасчетыСПерсоналом" Тогда 
				Возврат НСтр("ru='НДФЛ с доходов по прочим операциям с персоналом';uk='ПДФО з доходів за іншими операціями з персоналом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛРасчетыСБывшимиСотрудниками" Тогда 
				Возврат НСтр("ru='НДФЛ расчеты с бывшими сотрудниками';uk='ПДФО розрахунки з колишніми співробітниками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НФДЛДивиденды" Тогда 
				Возврат НСтр("ru='НДФЛ с дивидендов';uk='ПДФО з дивідендів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НФДЛДивидендыСотрудникам" Тогда 
				Возврат НСтр("ru='НДФЛ с дивидендов работникам';uk='ПДФО з дивідендів працівникам'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОценкаОбязательстваИФормированиеРезервов" Тогда 
				Возврат НСтр("ru='Оценка обязательства и формирование резервов';uk='Оцінка зобов'язання та формування резервів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПогашениеЗаймов" Тогда 
				Возврат НСтр("ru='Погашение займов';uk='Погашення позик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Профвзносы" Тогда 
				Возврат НСтр("ru='Профвзносы';uk='Профвнески'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроцентыПоЗайму" Тогда 
				Возврат НСтр("ru='Проценты по займу';uk='Відсотки по позиці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРасчетыСПерсоналом" Тогда 
				Возврат НСтр("ru='Прочие расчеты с персоналом';uk='Інші розрахунки з персоналом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеУдержания" Тогда 
				Возврат НСтр("ru='Прочие удержания';uk='Інші утримання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФР" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) ПФР';uk='ѳ(не український) ПФР'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРДополнительныйТарифЛЭ" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Взносы в ПФР (дополнительный тариф членов летных экипажей)';uk='ѳ(не український) Внески в ПФР (додатковий тариф членів льотних екіпажів)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРДополнительныйТарифШахтеры" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Взносы в ПФР (дополнительный тариф шахтеров)';uk='ѳ(не український) Внески в ПФР (додатковий тариф шахтарів)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРДоПредельнойВеличины" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) ПФР до предельной величины';uk='ѳ(не український) ПФР до граничної величини'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРЗаЗанятыхНаПодземныхИВредныхРаботах" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Взносы в ПФР (дополнительный тариф за занятых на работах с вредными условиями труда)';uk='ѳ(не український) Внески в ПФР (додатковий тариф за зайнятих на роботах з шкідливими умовами праці)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Взносы в ПФР (дополнительный тариф за занятых на работах с тяжелыми условиями труда)';uk='ѳ(не український) Внески в ПФР (додатковий тариф за зайнятих на роботах з важкими умовами праці)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРНакопительнаяЧасть" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Взносы в ПФР (накопительная часть)';uk='ѳ(не український) Внески в ПФР (накопичувальна частина)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРПоСуммарномуТарифу" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Взносы в ПФР (на ОПС)';uk='ѳ(не український) Внески в ПФР (ОПВ)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРСПревышения" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) ПФР - с базы сверх предельной величины';uk='ѳ(не український) ПФР - з бази понад граничної величини'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПФРСтраховаяЧасть" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Взносы в ПФР (страховая часть)';uk='ѳ(не український) Внески в ПФР (страхова частина)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходыПоСтрахованиюБюджет" Тогда 
				Возврат НСтр("ru='Расходы по страхованию незастрахованным лицам';uk='Витрати по страхуванню незастрахованим особам'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходыПоСтрахованиюРаботодатель" Тогда 
				Возврат НСтр("ru='Расходы по страхованию за счет работодателя';uk='Витрати на страхування за рахунок роботодавця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходыПоСтрахованиюФСС" Тогда 
				Возврат НСтр("ru='Расходы за счет социального страхования';uk='Витрати за рахунок соціального страхування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходыПоСтрахованиюФССНС" Тогда 
				Возврат НСтр("ru='Расходы по страхованию ФСС НС';uk='Витрати по страхуванню ФСС НВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеДепонента" Тогда 
				Возврат НСтр("ru='Списание депонированной зарплаты в доходы организации';uk='Списання депонованої зарплати на доходи організації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТФОМС" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) ТФОМС';uk='ѳ(не український) ТФОМС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдержаниеЗаОтпуск" Тогда 
				Возврат НСтр("ru='Удержание за отпуск';uk='Утримання за відпустку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдержаниеНеизрасходованныхПодотчетныхСумм" Тогда 
				Возврат НСтр("ru='Удержание неизрасходованных подотчетных сумм';uk='Утримання невитрачених підзвітних сум'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдержаниеПоПрочимОперациямСРаботниками" Тогда 
				Возврат НСтр("ru='Удержание по прочим операциям с работниками';uk='Утримання за іншими операціями з працівниками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФОМС" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) ФОМС';uk='ѳ(не український) ФОМС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФСС" Тогда 
				Возврат НСтр("ru='ФСС';uk='ФСС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФССНС" Тогда 
				Возврат НСтр("ru='ФССНС';uk='ФССНВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФФОМС" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) ФФОМС';uk='ѳ(не український) ФФОМС'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПриложений2КНалоговойНакладной" Тогда 
			Если ИмяДляПеревода = "Возврат" Тогда 
				Возврат НСтр("ru='Возврат';uk='Повернення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Корректировка" Тогда 
				Возврат НСтр("ru='Корректировка';uk='Коригування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаВозврата" Тогда 
				Возврат НСтр("ru='Корректировка возврата';uk='Коригування повернення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПринятияКУчетуОсновныхСредств" Тогда 
			Если ИмяДляПеревода = "Оборудование" Тогда 
				Возврат НСтр("ru='Оборудование';uk='Устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбъектыСтроительства" Тогда 
				Возврат НСтр("ru='Объекты строительства';uk='Об'єкти будівництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоРезультатамИнвентаризации" Тогда 
				Возврат НСтр("ru='По результатам инвентаризации';uk='За результатами інвентаризації'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента" Тогда 
			Если ИмяДляПеревода = "ВосстановлениеНалоговогоКредита" Тогда 
				Возврат НСтр("ru='Восстановление налогового кредита';uk='Відновлення податкового кредиту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсправлениеОшибки" Тогда 
				Возврат НСтр("ru='Исправление ошибки';uk='Виправлення помилки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалоговаяНакладная" Тогда 
				Возврат НСтр("ru='Налоговая накладная';uk='Податкова накладна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаботыОтНерезидентаПрошлогоПериода" Тогда 
				Возврат НСтр("ru='Работы от нерезидента';uk='Роботи від нерезидента'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетКорректировкиВозврат" Тогда 
				Возврат НСтр("ru='Расчет корректировки (возврат)';uk='Розрахунок коригування (повернення)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетКорректировкиКорректировка" Тогда 
				Возврат НСтр("ru='Расчет корректировки (изменение суммы компенсации)';uk='Розрахунок коригування (зміна суми компенсації)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварныйЧек" Тогда 
				Возврат НСтр("ru='Прочее (товарный чек и т. п.)';uk='Інше (товарний чек і т.п.)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийУстановкиЗначенийНефинансовыхПоказателей" Тогда 
			Если ИмяДляПеревода = "ВводЗначенийПоШаблону" Тогда 
				Возврат НСтр("ru='Ввод значений по шаблону';uk='Введення значень за шаблоном'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВводЗначенияПоказателя" Тогда 
				Возврат НСтр("ru='Ввод значения показателя';uk='Введення значення показника'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийЭД" Тогда 
			Если ИмяДляПеревода = "Исправление" Тогда 
				Возврат НСтр("ru='Исправление';uk='Виправлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Корректировка" Тогда 
				Возврат НСтр("ru='Корректировка';uk='Коригування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродажаКомиссия" Тогда 
				Возврат НСтр("ru='Продажа, комиссия';uk='Продаж, комісія'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОплатыЗарплатнойКарты" Тогда 
			Если ИмяДляПеревода = "ОплачиваетсяДержателем" Тогда 
				Возврат НСтр("ru='Оплачивается держателем';uk='Оплачується власником'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплачиваетсяПредприятием" Тогда 
				Возврат НСтр("ru='Оплачивается предприятием';uk='Оплачується підприємством'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплачиваетсяПредприятиемИДержателемВДолях" Тогда 
				Возврат НСтр("ru='Оплачивается предприятием и держателем в долях';uk='Оплачується підприємством і власником у частках'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОповещенийБюджетныхЗадач" Тогда 
			Если ИмяДляПеревода = "ЗадачаПодходитСрок" Тогда 
				Возврат НСтр("ru='Подходит срок исполнения задачи';uk='Підходить строк виконання задачі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗадачаПоступила" Тогда 
				Возврат НСтр("ru='Поступила новая задача';uk='Надійшла нова задача'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗадачаПросрочена" Тогда 
				Возврат НСтр("ru='Исполнение задачи просрочено';uk='Виконання задачі прострочене'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОсобыхНачисленийИУдержаний" Тогда 
			Если ИмяДляПеревода = "ВоенныйСбор" Тогда 
				Возврат НСтр("ru='Военный сбор';uk='Військовий збір'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Дивиденды" Тогда 
				Возврат НСтр("ru='Дивиденды';uk='Дивіденди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДивидендыСотрудников" Тогда 
				Возврат НСтр("ru='Дивиденды сотрудников';uk='Дивіденди співробітників'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоговорАвторскогоЗаказа" Тогда 
				Возврат НСтр("ru='Договор авторского заказа';uk='Договір авторського замовлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоговорРаботыУслуги" Тогда 
				Возврат НСтр("ru='Договор (работы, услуги)';uk='Договір (роботи, послуги)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДСВРаботодателя" Тогда 
				Возврат НСтр("ru='Страховые взносы на накопительную часть пенсии, перечисленные работодателем';uk='Страхові внески на накопичувальну частину пенсії, перераховані роботодавцем'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомпенсацияЗаЗадержкуЗарплаты" Тогда 
				Возврат НСтр("ru='Компенсация за задержку зарплаты';uk='Компенсація за затримку зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МатериальнаяВыгодаПоЗаймам" Тогда 
				Возврат НСтр("ru='Материальная выгода по займам (кредитам)';uk='Матеріальна вигода за позиками (кредитами)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачисленоПроцентовПоЗайму" Тогда 
				Возврат НСтр("ru='Начислено процентов по займу';uk='Нараховано відсотків за позикою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛ" Тогда 
				Возврат НСтр("ru='НДФЛ';uk='ПДФО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛДоначисленныйПоРезультатамПроверки" Тогда 
				Возврат НСтр("ru='НДФЛ, доначисленный по результатам проверки';uk='ПДФО, донарахований за результатами перевірки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛДоходыКонтрагентов" Тогда 
				Возврат НСтр("ru='НДФЛ с доходов контрагентов';uk='ПДФО з доходів контрагентів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛЗачтено" Тогда 
				Возврат НСтр("ru='Зачтено излишне удержанного НДФЛ';uk='Зараховано зайво утриманого ПДФО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛКЗачету" Тогда 
				Возврат НСтр("ru='НДФЛ к зачету в счет будущих платежей';uk='ПДФО до заліку в рахунок майбутніх платежів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛПередачаЗадолженностиВНалоговыйОрган" Тогда 
				Возврат НСтр("ru='НДФЛ передача задолженности в налоговый орган';uk='ПДФО передача заборгованості в податковий орган'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛПрочиеРасчетыСПерсоналом" Тогда 
				Возврат НСтр("ru='НДФЛ с доходов по прочим операциям с персоналом';uk='ПДФО з доходів за іншими операціями з персоналом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛРасчетыСБывшимиСотрудниками" Тогда 
				Возврат НСтр("ru='НДФЛ расчеты с бывшими сотрудниками';uk='ПДФО розрахунки з колишніми співробітниками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НФДЛДивиденды" Тогда 
				Возврат НСтр("ru='НДФЛ с дивидендов';uk='ПДФО з дивідендів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НФДЛДивидендыСотрудникам" Тогда 
				Возврат НСтр("ru='НДФЛ с дивидендов работникам';uk='ПДФО з дивідендів працівникам'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПогашениеЗаймаИзЗарплаты" Тогда 
				Возврат НСтр("ru='Погашение займа из зарплаты';uk='Погашення позики із зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПособиеНаПогребение" Тогда 
				Возврат НСтр("ru='Пособие на погребение';uk='Допомога на поховання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности" Тогда 
				Возврат НСтр("ru='Пособие при постановке на учет в ранние сроки беременности';uk='Допомога при постановці на облік у ранні терміни вагітності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПособиеПриРожденииРебенка" Тогда 
				Возврат НСтр("ru='Пособие при рождении ребенка';uk='Допомога при народженні дитини'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроцентыПоЗайму" Тогда 
				Возврат НСтр("ru='Проценты по займу';uk='Відсотки по позиці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтоимостьПодарковПризов" Тогда 
				Возврат НСтр("ru='Стоимость подарков и призов';uk='Вартість подарунків і призів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьМатериальнаяПомощь" Тогда 
				Возврат НСтр("ru='Удалить материальная помощь';uk='Видалити матеріальна допомога'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОтклоненийОтЦелевыхЗначенийПоказателей" Тогда 
			Если ИмяДляПеревода = "Абсолютное" Тогда 
				Возврат НСтр("ru='Абсолютное';uk='Абсолютна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Относительное" Тогда 
				Возврат НСтр("ru='Относительное (%)';uk='Відносне (%)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОтчетности" Тогда 
			Если ИмяДляПеревода = "ОтчетностьПоМСФО" Тогда 
				Возврат НСтр("ru='Отчетность по МСФО';uk='Звітність по МСФЗ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РегламентированнаяОтчетность" Тогда 
				Возврат НСтр("ru='Регламентированная отчетность';uk='Регламентована звітність'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПереводовДенежныхСредств" Тогда 
			Если ИмяДляПеревода = "ИнкассацияВБанк" Тогда 
				Возврат НСтр("ru='Инкассация в банк';uk='Інкасація в банк'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИнкассацияИзБанка" Тогда 
				Возврат НСтр("ru='Инкассация из банка';uk='Інкасація з банку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеремещениеВДругуюКассу" Тогда 
				Возврат НСтр("ru='Перемещение в другую кассу';uk='Переміщення в іншу касу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеНаДругойСчет" Тогда 
				Возврат НСтр("ru='Перечисление на другой счет';uk='Перерахування на інший рахунок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОтБанкаПоЭквайрингу" Тогда 
				Возврат НСтр("ru='Поступление от банка по эквайрингу';uk='Надходження від банку еквайрингу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриобретениеВалюты" Тогда 
				Возврат НСтр("ru='Приобретение иностранной валюты';uk='Придбання іноземної валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияВалюты" Тогда 
				Возврат НСтр("ru='Реализация иностранной валюты';uk='Реалізація іноземної валюти'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПеречисленийВБюджет" Тогда 
			Если ИмяДляПеревода = "ИнойПлатеж" Тогда 
				Возврат НСтр("ru='Иной платеж';uk='Інший платіж'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалоговыйПлатеж" Тогда 
				Возврат НСтр("ru='Налоговый платеж';uk='Податковий платіж'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТаможенныйПлатеж" Тогда 
				Возврат НСтр("ru='Таможенный платеж';uk='Митний платіж'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПериодовАктуальностиРасчета" Тогда 
			Если ИмяДляПеревода = "День" Тогда 
				Возврат НСтр("ru='День';uk='День'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Минута" Тогда 
				Возврат НСтр("ru='Минута';uk='Хвилина'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Час" Тогда 
				Возврат НСтр("ru='Час';uk='Година'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПлатежейВГосБюджет" Тогда 
			Если ИмяДляПеревода = "Налог" Тогда 
				Возврат НСтр("ru='Налог (взносы): начислено / уплачено';uk='Податок (внески): нараховано / сплачено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалогАкт" Тогда 
				Возврат НСтр("ru='Налог (взносы): доначислено / уплачено (по акту проверки)';uk='Податок (внески): донараховано / сплачено (за актом перевірки)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалогСам" Тогда 
				Возврат НСтр("ru='Налог (взносы): доначислено / уплачено (самостоятельно)';uk='Податок (внески): донараховано / сплачено (самостійно)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеПринято" Тогда 
				Возврат НСтр("ru='Не принято к зачету';uk='Не прийнято до зарахування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПениАкт" Тогда 
				Возврат НСтр("ru='Пени: начислено / уплачено (по акту проверки)';uk='Пені: нараховано / сплачено (за актом перевірки)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПениСам" Тогда 
				Возврат НСтр("ru='Пени: доначислено / уплачено (самостоятельно)';uk='Пені: донараховано / сплачено (самостійно)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолученоИзФонда" Тогда 
				Возврат НСтр("ru='Получено от исполнительного органа ФСС РФ';uk='Отримано від виконавчого органу ФСС РФ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Проценты" Тогда 
				Возврат НСтр("ru='Проценты: начислено / уплачено';uk='Відсотки: нараховано / сплачено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходыПоСтрахованию" Тогда 
				Возврат НСтр("ru='Расходы по страхованию';uk='Витрати по страхуванню'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Штраф" Тогда 
				Возврат НСтр("ru='Штраф: начислено / уплачено';uk='Штраф: нараховано / сплачено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПлатежейВСоциальныеФонды" Тогда 
			Если ИмяДляПеревода = "Взносы" Тогда 
				Возврат НСтр("ru='Взносы: начислено / уплачено / зачтено';uk='Внески: нараховано / сплачено / зараховано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Пени" Тогда 
				Возврат НСтр("ru='Пени: начислено / уплачено';uk='Пені: нараховано / сплачено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Штрафы" Тогда 
				Возврат НСтр("ru='Штрафы: начислено / уплачено';uk='Штрафи: нараховано / сплачено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПлатежейПогашенияЗаймаСотруднику" Тогда 
			Если ИмяДляПеревода = "АннуитетныеПлатежи" Тогда 
				Возврат НСтр("ru='Аннуитетные платежи';uk='Ануїтетні платежі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДифференцированныеПлатежи" Тогда 
				Возврат НСтр("ru='Дифференцированные платежи';uk='Диференційовані платежі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТолькоЗаем" Тогда 
				Возврат НСтр("ru='Только заем (проценты в конце срока)';uk='Тільки позику (відсотки в кінці терміну)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТолькоПроценты" Тогда 
				Возврат НСтр("ru='Только проценты (заем в конце срока)';uk='Тільки відсотки (позику в кінці терміну)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПодтверждающихДокументовОтпускаПоУходу" Тогда 
			Если ИмяДляПеревода = "ИнойДокументПодтверждающийРождениеРебенка" Тогда 
				Возврат НСтр("ru='Иной документ подтверждающий рождение ребенка';uk='Інший документ, що підтверджує народження дитини'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РешениеОбУстановленииОпеки" Тогда 
				Возврат НСтр("ru='Решение об установлении опеки';uk='Рішення про встановлення опіки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СвидетельствоОРождении" Тогда 
				Возврат НСтр("ru='Свидетельство о рождении';uk='Свідоцтво про народження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СвидетельствоОСмерти" Тогда 
				Возврат НСтр("ru='Свидетельство о смерти';uk='Свідоцтво про смерть'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПоискаСвязанныхПоказателей" Тогда 
			Если ИмяДляПеревода = "ВзаимосвязанныеПоказатели" Тогда 
				Возврат НСтр("ru='Взаимосвязанные показатели';uk='Взаємопов'язані показники'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВлияющиеПоказатели" Тогда 
				Возврат НСтр("ru='Влияющие показатели';uk='Впливаючі показники'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВсеПоказатели" Тогда 
				Возврат НСтр("ru='Все показатели';uk='Всі показники'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗависимыеПоказатели" Тогда 
				Возврат НСтр("ru='Зависимые показатели';uk='Залежні показники'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПоказателейОтчетности" Тогда 
			Если ИмяДляПеревода = "Международные" Тогда 
				Возврат НСтр("ru='Международные';uk='Міжнародні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МеждународныеИРегламентированные" Тогда 
				Возврат НСтр("ru='Международные и регламентированные';uk='Міжнародні та регламентовані'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Регламентированные" Тогда 
				Возврат НСтр("ru='Регламентированные';uk='Регламентовані'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПоклажедержателей" Тогда 
			Если ИмяДляПеревода = "СобственнаяОрганизация" Тогда 
				Возврат НСтр("ru='Собственная организация';uk='Власна організація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтороннийКонтрагент" Тогда 
				Возврат НСтр("ru='Сторонний контрагент';uk='Сторонній контрагент'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПоставки" Тогда 
			Если ИмяДляПеревода = "ВводОстатков" Тогда 
				Возврат НСтр("ru='Ввод остатков';uk='Введення залишків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Возврат" Тогда 
				Возврат НСтр("ru='Возврат';uk='Повернення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Переоценка" Тогда 
				Возврат НСтр("ru='Переоценка';uk='Переоцінка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Поставка" Тогда 
				Возврат НСтр("ru='Поставка';uk='Постачання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Розница" Тогда 
				Возврат НСтр("ru='Розница';uk='Роздріб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РозницаВозврат" Тогда 
				Возврат НСтр("ru='Розница (возврат)';uk='Роздріб (повернення)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПравилДляОбменаДанными" Тогда 
			Если ИмяДляПеревода = "ПравилаКонвертацииОбъектов" Тогда 
				Возврат НСтр("ru='Правила конвертации объектов';uk='Правила конвертації об'єктів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПравилаРегистрацииОбъектов" Тогда 
				Возврат НСтр("ru='Правила регистрации объектов';uk='Правила реєстрації об'єктів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПравилНачисленияБонусныхБаллов" Тогда 
			Если ИмяДляПеревода = "Начисление" Тогда 
				Возврат НСтр("ru='Начисление';uk='Нарахування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Списание" Тогда 
				Возврат НСтр("ru='Списание';uk='Списання'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПределовДоходовНДФЛ" Тогда 
			Если ИмяДляПеревода = "Годовой" Тогда 
				Возврат НСтр("ru='Годовой';uk='Річний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Разовый" Тогда 
				Возврат НСтр("ru='Разовый';uk='Разовий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПредставленияЧисел" Тогда 
			Если ИмяДляПеревода = "БезИзменений" Тогда 
				Возврат НСтр("ru='Без изменений';uk='Без змін'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВМиллионах" Тогда 
				Возврат НСтр("ru='В миллионах';uk='В мільйонах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВТысячах" Тогда 
				Возврат НСтр("ru='В тысячах';uk='У тисячах'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПризовПодарков" Тогда 
			Если ИмяДляПеревода = "Подарок" Тогда 
				Возврат НСтр("ru='Подарок';uk='Подарунок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Приз" Тогда 
				Возврат НСтр("ru='Приз, выигрыш в конкурсе';uk='Приз, виграш у конкурсі'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыПрофессиональнойПодготовки" Тогда 
			Если ИмяДляПеревода = "Переподготовка" Тогда 
				Возврат НСтр("ru='Переподготовка';uk='Перепідготовка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПовышениеКвалификации" Тогда 
				Возврат НСтр("ru='Повышение квалификации';uk='Підвищення кваліфікації'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыРаботСДосрочнойПенсией" Тогда 
			Если ИмяДляПеревода = "ПодземныеИВредныеРаботы" Тогда 
				Возврат НСтр("ru='Работы с вредными условиями труда, подпункт 1 пункта 1 статьи 27 закона «О трудовых пенсиях в РФ»';uk='Роботи з шкідливими умовами праці, підпункт 1 пункту 1 статті 27 закону «Про трудові пенсії в РФ»'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТяжелыеИПрочиеРаботы" Тогда 
				Возврат НСтр("ru='Работы с тяжелыми условиями труда, подпункты 2 - 18 пункта 1 статьи 27 закона «О трудовых пенсиях в РФ»';uk='Роботи з важкими умовами праці, підпункти 2 - 18 пункту 1 статті 27 закону «Про трудові пенсії в РФ»'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыРабочегоВремениСотрудников" Тогда 
			Если ИмяДляПеревода = "ДополнительноОплачиваемоеВПределахНормы" Тогда 
				Возврат НСтр("ru='Дополнительно оплачиваемое время в пределах нормы времени';uk='Додатково оплачуваний час у межах норми часу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтработанноеВПределахНормы" Тогда 
				Возврат НСтр("ru='Отработанное время в пределах нормы времени';uk='Відпрацьований час у межах норми часу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтработанноеСверхНормы" Тогда 
				Возврат НСтр("ru='Отработанное время сверх нормы времени';uk='Відпрацьований час поверх норми часу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЦелодневноеНеотработанное" Тогда 
				Возврат НСтр("ru='Целодневное неотработанное время и командировки';uk='Цілоденний невідпрацьований час і відрядження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧасовоеНеотработанное" Тогда 
				Возврат НСтр("ru='Часовое неотработанное время и командировки';uk='Годинний невідпрацьований час і відрядження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧасовоеОтработанноеВПределахНормы" Тогда 
				Возврат НСтр("ru='Часовое отработанное в пределах нормы';uk='Годинне відпрацьоване в межах норми'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыРасчетовПоСредствамФСС" Тогда 
			Если ИмяДляПеревода = "НеПринято" Тогда 
				Возврат НСтр("ru='Не принято к зачету';uk='Не прийнято до зарахування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолученоИзФонда" Тогда 
				Возврат НСтр("ru='Получено из фонда';uk='Отримано з фонду'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходыПоСтрахованию" Тогда 
				Возврат НСтр("ru='Расходы по страхованию';uk='Витрати по страхуванню'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСобытийОС" Тогда 
			Если ИмяДляПеревода = "ВводВЭксплуатацию" Тогда 
				Возврат НСтр("ru='Ввод в эксплуатацию';uk='Введення в експлуатацію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВнутреннееПеремещение" Тогда 
				Возврат НСтр("ru='Внутреннее перемещение';uk='Внутрішнє переміщення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Дооборудование" Тогда 
				Возврат НСтр("ru='Дооборудование';uk='Дообладнання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Достройка" Тогда 
				Возврат НСтр("ru='Достройка';uk='Добудова'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КапитальныйРемонт" Тогда 
				Возврат НСтр("ru='Капитальный ремонт';uk='Капітальний ремонт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Модернизация" Тогда 
				Возврат НСтр("ru='Модернизация';uk='Модернізація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачислениеАмортизации" Тогда 
				Возврат НСтр("ru='Начисление амортизации';uk='Нарахування амортизації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Передача" Тогда 
				Возврат НСтр("ru='Передача';uk='Передача'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Переоценка" Тогда 
				Возврат НСтр("ru='Переоценка';uk='Переоцінка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПодготовкаКПередаче" Тогда 
				Возврат НСтр("ru='Подготовка к передаче';uk='Підготовка до передачі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПринятиеКУчету" Тогда 
				Возврат НСтр("ru='Принятие к учету';uk='Прийняття до обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПринятиеКУчетуСВводомВЭксплуатацию" Тогда 
				Возврат НСтр("ru='Принятие к учету с вводом в эксплуатацию';uk='Прийняття до обліку з введенням в експлуатацію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Реконструкция" Тогда 
				Возврат НСтр("ru='Реконструкция';uk='Реконструкція'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ремонт" Тогда 
				Возврат НСтр("ru='Ремонт';uk='Ремонт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Списание" Тогда 
				Возврат НСтр("ru='Списание';uk='Списання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СреднийРемонт" Тогда 
				Возврат НСтр("ru='Средний ремонт';uk='Середній ремонт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТекущийРемонт" Тогда 
				Возврат НСтр("ru='Текущий ремонт';uk='Поточний ремонт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧастичнаяЛиквидация" Тогда 
				Возврат НСтр("ru='Частичная ликвидация';uk='Часткова ліквідація'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСоглашенийСКлиентамиДляОграниченияИзменения" Тогда 
			Если ИмяДляПеревода = "Индивидуальные" Тогда 
				Возврат НСтр("ru='Индивидуальные соглашения';uk='Індивідуальні оферти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Типовые" Тогда 
				Возврат НСтр("ru='Типовые соглашения';uk='Типові оферти'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСоглашенийСКлиентамиДляОграниченияЧтения" Тогда 
			Если ИмяДляПеревода = "Индивидуальные" Тогда 
				Возврат НСтр("ru='Индивидуальные соглашения';uk='Індивідуальні оферти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Типовые" Тогда 
				Возврат НСтр("ru='Типовые соглашения';uk='Типові оферти'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСостоянийНМА" Тогда 
			Если ИмяДляПеревода = "НеПринятКУчету" Тогда 
				Возврат НСтр("ru='Не принят к учету';uk='Не прийнято до обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Поступил" Тогда 
				Возврат НСтр("ru='Поступил';uk='Надійшов'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПринятКУчету" Тогда 
				Возврат НСтр("ru='Принят к учету';uk='Прийнятий до обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Списан" Тогда 
				Возврат НСтр("ru='Списан';uk='Списаний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСправокОДоходах" Тогда 
			Если ИмяДляПеревода = "ДоходыИНалоги" Тогда 
				Возврат НСтр("ru='Доходы и налоги';uk='Доходи та податки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Пенсия2015" Тогда 
				Возврат НСтр("ru='Для расчета пенсии';uk='Для розрахунку пенсії'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Произвольная" Тогда 
				Возврат НСтр("ru='Справка в свободной форме';uk='Довідка у вільній формі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Соцстрах2015" Тогда 
				Возврат НСтр("ru='Для выплат по соц. страхованию';uk='Для виплат за соц. страхуванням'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Субсидия2015" Тогда 
				Возврат НСтр("ru='Для оформления субсидии';uk='Для оформлення субсидії'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСтавокНДФЛ" Тогда 
			Если ИмяДляПеревода = "ВоенныйСбор" Тогда 
				Возврат НСтр("ru='Военный сбор';uk='Військовий збір'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Двойная" Тогда 
				Возврат НСтр("ru='Двойная';uk='Подвійна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеОблагается" Тогда 
				Возврат НСтр("ru='Не облагается';uk='Не оподатковується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Основная" Тогда 
				Возврат НСтр("ru='Основная';uk='Основна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтавкаШахтеров" Тогда 
				Возврат НСтр("ru='Ставка шахтеров';uk='Ставка шахтарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Увеличенная" Тогда 
				Возврат НСтр("ru='Увеличенная';uk='Збільшена'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Уменьшенная" Тогда 
				Возврат НСтр("ru='Уменьшенная';uk='Зменшена'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСтатейУправленческогоБаланса" Тогда 
			Если ИмяДляПеревода = "Актив" Тогда 
				Возврат НСтр("ru='Актив';uk='Актив'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Пассив" Тогда 
				Возврат НСтр("ru='Пассив';uk='Пасив'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСтоимости" Тогда 
			Если ИмяДляПеревода = "Отклонение" Тогда 
				Возврат НСтр("ru='Отклонение';uk='Відхилення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Плановая" Тогда 
				Возврат НСтр("ru='Выпуск по плановой стоимости';uk='Випуск по плановій вартості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Фактическая" Тогда 
				Возврат НСтр("ru='Выпуск по фактической стоимости';uk='Випуск по фактичній вартості'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСтраховыхВзносовИП" Тогда 
			Если ИмяДляПеревода = "СтраховыеВзносыСДоходов" Тогда 
				Возврат НСтр("ru='Страховые взносы, исчисленные с суммы дохода';uk='Страхові внески, обчислені із суми доходу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФиксированныеСтраховыеВзносы" Тогда 
				Возврат НСтр("ru='Фиксированные страховые взносы';uk='Фіксовані страхові внески'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСтрокДереваСпецификаций" Тогда 
			Если ИмяДляПеревода = "ВыходноеИзделие" Тогда 
				Возврат НСтр("ru='Выходное изделие';uk='Вихідний виріб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыходныеИзделия" Тогда 
				Возврат НСтр("ru='Выходные изделия';uk='Вихідні вироби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Материал" Тогда 
				Возврат НСтр("ru='Материал';uk='Матеріал'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МатериалыИУслуги" Тогда 
				Возврат НСтр("ru='Материалы и услуги';uk='Матеріали та послуги'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Номенклатура" Тогда 
				Возврат НСтр("ru='Номенклатура';uk='Номенклатура'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Трудозатрата" Тогда 
				Возврат НСтр("ru='Трудозатрата';uk='Трудовитрата'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Трудозатраты" Тогда 
				Возврат НСтр("ru='Трудозатраты';uk='Трудовитрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Этап" Тогда 
				Возврат НСтр("ru='Этап';uk='Етап'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыСчетовРеглУчета" Тогда 
			Если ИмяДляПеревода = "АвансыВыданные" Тогда 
				Возврат НСтр("ru='Авансы выданные';uk='Аванси, що видано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АвансыПолученные" Тогда 
				Возврат НСтр("ru='Авансы полученные';uk='Аванси отримані'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыручкаОтПродаж" Тогда 
				Возврат НСтр("ru='Выручка от продаж';uk='Виторг від продажів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыручкаОтПродажКомиссионера" Тогда 
				Возврат НСтр("ru='Выручка от продаж комиссионера';uk='Виторг від продажів комісіонера'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВычетыИзДоходов" Тогда 
				Возврат НСтр("ru='Вычеты из доходов';uk='Відрахування з доходів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВычетыИзДоходовКомиссионера" Тогда 
				Возврат НСтр("ru='Вычеты из доходов комиссионера';uk='Вирахування з доходів комісіонера'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Доходы" Тогда 
				Возврат НСтр("ru='Доходы';uk='Доходи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаСкладе" Тогда 
				Возврат НСтр("ru='Собственные товары на складе';uk='Власні товари на складі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаНаКомиссию" Тогда 
				Возврат НСтр("ru='Передача на комиссию';uk='Передача на комісію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеАктивыПассивы" Тогда 
				Возврат НСтр("ru='Прочие активы/пассивы';uk='Інші активи/пасиви'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеОперации" Тогда 
				Возврат НСтр("ru='Прочие операции';uk='Інші операції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Расходы" Тогда 
				Возврат НСтр("ru='Расходы';uk='Витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыПоВознаграждению" Тогда 
				Возврат НСтр("ru='Расчеты по вознаграждению';uk='Розрахунки з винагороди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыПоПодарочнымСертификатам" Тогда 
				Возврат НСтр("ru='Расчеты по подарочным сертификатам';uk='Розрахунки по подарункових сертифікатах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыСКлиентами" Тогда 
				Возврат НСтр("ru='Расчеты с клиентами';uk='Розрахунки з клієнтами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыСКлиентамиТара" Тогда 
				Возврат НСтр("ru='Расчеты с клиентами по таре';uk='Розрахунки з клієнтами по тарі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыСПоставщиками" Тогда 
				Возврат НСтр("ru='Расчеты с поставщиками';uk='Розрахунки з постачальниками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыСПоставщикамиТара" Тогда 
				Возврат НСтр("ru='Расчеты с поставщиками по таре';uk='Розрахунки з постачальниками по тарі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СебестоимостьПродаж" Тогда 
				Возврат НСтр("ru='Себестоимость продаж';uk='Собівартість продажів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СебестоимостьПродажКомиссионера" Тогда 
				Возврат НСтр("ru='Себестоимость продаж комиссионера';uk='Собівартість продажів комісіонера'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТМЦВЭксплуатации" Тогда 
				Возврат НСтр("ru='ТМЦ в эксплуатации';uk='ТМЦ в експлуатації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТМЦВЭксплуатацииАмортизация" Тогда 
				Возврат НСтр("ru='ТМЦ в эксплуатации (амортизация)';uk='ТМЦ в експлуатації (амортизація)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыТарифныхСеток" Тогда 
			Если ИмяДляПеревода = "Надбавка" Тогда 
				Возврат НСтр("ru='Надбавка';uk='Надбавка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Тариф" Тогда 
				Возврат НСтр("ru='Тариф';uk='Тариф'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыТарифныхСтавок" Тогда 
			Если ИмяДляПеревода = "ДневнаяТарифнаяСтавка" Тогда 
				Возврат НСтр("ru='Дневная тарифная ставка';uk='Денна тарифна ставка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МесячнаяТарифнаяСтавка" Тогда 
				Возврат НСтр("ru='Месячная тарифная ставка';uk='Місячна тарифна ставка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧасоваяТарифнаяСтавка" Тогда 
				Возврат НСтр("ru='Часовая тарифная ставка';uk='Годинна тарифна ставка'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыТМЦВЭксплуатации" Тогда 
			Если ИмяДляПеревода = "БиблиотечныеФонды" Тогда 
				Возврат НСтр("ru='Библиотечные фонды';uk='Бібліотечні фонди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МалоценныйБыстроизнашивающийсяПредмет" Тогда 
				Возврат НСтр("ru='Малоценный быстроизнашивающийся предмет';uk='Малоцінний швидкозношуваний предмет'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МалоценныйНеоборотныйАктив" Тогда 
				Возврат НСтр("ru='Малоценный необоротный актив';uk='Малоцінний необоротний актив'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыТранспортаСообщенийОбмена" Тогда 
			Если ИмяДляПеревода = "COM" Тогда 
				Возврат НСтр("ru='Прямое подключение';uk='Пряме підключення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "EMAIL" Тогда 
				Возврат НСтр("ru='Почтовые сообщения';uk='Поштові повідомлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "FILE" Тогда 
				Возврат НСтр("ru='Локальный или сетевой каталог';uk='Локальний або мережевий каталог'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "FTP" Тогда 
				Возврат НСтр("ru='FTP-ресурс';uk='Ftp-Ресурс'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "WS" Тогда 
				Возврат НСтр("ru='Интернет';uk='Інтернет'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыТрудовогоСтажа" Тогда 
			Если ИмяДляПеревода = "ВыслугаЛет" Тогда 
				Возврат НСтр("ru='Выслуга лет';uk='Вислуга років'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбщийТрудовойСтаж" Тогда 
				Возврат НСтр("ru='Общий трудовой стаж';uk='Загальний трудовий стаж'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсобыеУсловияТруда" Тогда 
				Возврат НСтр("ru='Особые условия труда';uk='Особливі умови праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТерриториальныеУсловия" Тогда 
				Возврат НСтр("ru='Территориальные условия';uk='Територіальні умови'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыУпаковочныхЛистов" Тогда 
			Если ИмяДляПеревода = "Входящий" Тогда 
				Возврат НСтр("ru='Входящий';uk='Вхідний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Исходящий" Тогда 
				Возврат НСтр("ru='Исходящий';uk='Вихідний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыУчетаВремениДляСредней" Тогда 
			Если ИмяДляПеревода = "ПоРабочимДням" Тогда 
				Возврат НСтр("ru='По рабочим дням';uk='По робочих днях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоРабочимЧасам" Тогда 
				Возврат НСтр("ru='По рабочим часам';uk='По робочим годинам'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыУчетаСебестоимости" Тогда 
			Если ИмяДляПеревода = "СтоимостьРегл" Тогда 
				Возврат НСтр("ru='Стоимость (регл. учет)';uk='Вартість (регл. облік)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтоимостьУпр" Тогда 
				Возврат НСтр("ru='Стоимость (упр. учет)';uk='Вартість (упр. облік)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтоимостьУпрБезНДС" Тогда 
				Возврат НСтр("ru='Стоимость без НДС (упр. учет)';uk='Вартість без ПДВ (упр. облік)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыФормулБюджетирования" Тогда 
			Если ИмяДляПеревода = "ВыполнениеПроцент" Тогда 
				Возврат НСтр("ru='Выполнение (%)';uk='Виконання (%)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Итог" Тогда 
				Возврат НСтр("ru='Итог';uk='Підсумок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Максимум" Тогда 
				Возврат НСтр("ru='Максимум';uk='Максимум'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Минимум" Тогда 
				Возврат НСтр("ru='Минимум';uk='Мінімум'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Округлить" Тогда 
				Возврат НСтр("ru='Округлить';uk='Округлити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отклонение" Тогда 
				Возврат НСтр("ru='Отклонение';uk='Відхилення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтклонениеПроцент" Тогда 
				Возврат НСтр("ru='Отклонение (%)';uk='Відхилення (%)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазностьДат" Тогда 
				Возврат НСтр("ru='Разность дат';uk='Різниця дат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Среднее" Тогда 
				Возврат НСтр("ru='Среднее';uk='Середнє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сумма" Тогда 
				Возврат НСтр("ru='Сумма';uk='Сума'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыЦелевыхЗначенийВариантовАнализа" Тогда 
			Если ИмяДляПеревода = "Диапазон" Тогда 
				Возврат НСтр("ru='Допустимый диапазон';uk='Припустимий діапазон'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Значение" Тогда 
				Возврат НСтр("ru='Значение';uk='Значення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыЦелевыхТрендовПоказателей" Тогда 
			Если ИмяДляПеревода = "Диапазон" Тогда 
				Возврат НСтр("ru='Удержание в пределах допустимого диапазона';uk='Утримання у межах допустимого діапазону'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Максимизация" Тогда 
				Возврат НСтр("ru='Максимизация значения';uk='Максимізація значення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Минимизация" Тогда 
				Возврат НСтр("ru='Минимизация значения';uk='Мінімізація значення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыЦенностей" Тогда 
			Если ИмяДляПеревода = "НМА" Тогда 
				Возврат НСтр("ru='НМА';uk='НМА'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбъектыНезавершенногоСтроительства" Тогда 
				Возврат НСтр("ru='Объекты незавершенного строительства';uk='Об'єкти незавершеного будівництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОС" Тогда 
				Возврат НСтр("ru='ОС';uk='ОЗ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРаботыИУслуги" Тогда 
				Возврат НСтр("ru='Прочие работы и услуги';uk='Інші роботи та послуги'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Товары" Тогда 
				Возврат НСтр("ru='Товары';uk='Товари'" ,КодЯзыка);			
			КонецЕсли;
						
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыЭлементовФинансовогоОтчета" Тогда 
			Если ИмяДляПеревода = "ВсеПоказателиБюджетов" Тогда 
				Возврат НСтр("ru='Все показатели бюджетов';uk='Всі показники бюджетів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВсеСтатьиБюджетов" Тогда 
				Возврат НСтр("ru='Все статьи бюджетов';uk='Всі статті бюджетів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Группа" Тогда 
				Возврат НСтр("ru='Группа';uk='Група'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаголовокОтчета" Тогда 
				Возврат НСтр("ru='Заголовок отчета';uk='Заголовок звіту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Измерение" Тогда 
				Возврат НСтр("ru='Измерение';uk='Вимірювання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИтогПоГруппе" Тогда 
				Возврат НСтр("ru='Итог по группе';uk='Підсумок по групі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Колонки" Тогда 
				Возврат НСтр("ru='Колонки';uk='Колонки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МонетарныйПоказатель" Тогда 
				Возврат НСтр("ru='Монетарный показатель';uk='Монетарний показник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НастройкаЯчеек" Тогда 
				Возврат НСтр("ru='Настроить ячейки';uk='Настроїти комірки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НемонетарныйПоказатель" Тогда 
				Возврат НСтр("ru='Немонетарный показатель';uk='Немонетарний показник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НередактируемыйТекст" Тогда 
				Возврат НСтр("ru='Нередактируемый текст';uk='Нередагований текст'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НефинансовыйПоказатель" Тогда 
				Возврат НСтр("ru='Нефинансовый показатель';uk='Нефінансовий показник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоказательБюджетов" Тогда 
				Возврат НСтр("ru='Показатель бюджетов';uk='Показник бюджетів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизводныйПоказатель" Тогда 
				Возврат НСтр("ru='Производный показатель';uk='Похідний показник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РедактируемоеЗначение" Тогда 
				Возврат НСтр("ru='Редактируемое значение';uk='Редаговане значення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РедактируемыйТекст" Тогда 
				Возврат НСтр("ru='Редактируемый текст';uk='Редагований текст'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтатьяБюджетов" Тогда 
				Возврат НСтр("ru='Статья бюджетов';uk='Стаття бюджетів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Строки" Тогда 
				Возврат НСтр("ru='Строки';uk='Рядки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТаблицаПоказателиВКолонках" Тогда 
				Возврат НСтр("ru='Таблица';uk='Таблиця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТаблицаПоказателиВСтроках" Тогда 
				Возврат НСтр("ru='Таблица';uk='Таблиця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТаблицаСложная" Тогда 
				Возврат НСтр("ru='Таблица';uk='Таблиця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФормулаПоГруппе" Тогда 
				Возврат НСтр("ru='Формула по группе';uk='Формула по групі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭлементТаблицы" Тогда 
				Возврат НСтр("ru='Строка / колонка';uk='Рядок / колонка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЯчейкаТаблицы" Тогда 
				Возврат НСтр("ru='Ячейка таблицы';uk='Комірка таблиці'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВыборГруппыСкладов" Тогда 
			Если ИмяДляПеревода = "Запретить" Тогда 
				Возврат НСтр("ru='Запретить';uk='Заборонити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазрешитьВЗаказах" Тогда 
				Возврат НСтр("ru='Разрешить в заказах';uk='Дозволити в замовленнях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазрешитьВЗаказахИНакладных" Тогда 
				Возврат НСтр("ru='Разрешить в заказах и накладных';uk='Дозволити в замовленнях і накладних'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГодностьКВоеннойСлужбе" Тогда 
			Если ИмяДляПеревода = "ВременноНеГоден" Тогда 
				Возврат НСтр("ru='Временно не годен к военной службе';uk='Тимчасово непридатний до військової служби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Годен" Тогда 
				Возврат НСтр("ru='Годен к военной службе';uk='Придатний до військової служби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГоденСОграничениями" Тогда 
				Возврат НСтр("ru='Ограниченно годен к военной службе';uk='Обмежено придатний до військової служби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеГоден" Тогда 
				Возврат НСтр("ru='Не годен к военной службе';uk='Не придатний до військової служби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОграниченноГоден" Тогда 
				Возврат НСтр("ru='Не годен в мирное время, ограниченно годен в военное время';uk='Непридатний у мирний час, обмежено придатний у воєнний час'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГрадацииКачества" Тогда 
			Если ИмяДляПеревода = "НеГоден" Тогда 
				Возврат НСтр("ru='Не годен';uk='Не придатний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Новый" Тогда 
				Возврат НСтр("ru='Новый';uk='Новий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОграниченноГоден" Тогда 
				Возврат НСтр("ru='Ограниченно годен';uk='Обмежено придатний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГруппировкиЗатратВЗаказеПереработчику" Тогда 
			Если ИмяДляПеревода = "БезГруппировки" Тогда 
				Возврат НСтр("ru='Без группировки';uk='Без групування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЗаказамНаПроизводство" Тогда 
				Возврат НСтр("ru='По заказам на производство';uk='По замовленнях на виробництво'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПродукции" Тогда 
				Возврат НСтр("ru='По продукции';uk='По продукції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСпецификациям" Тогда 
				Возврат НСтр("ru='По спецификациям продукции';uk='По специфікаціях продукції'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГруппыИнвалидности" Тогда 
			Если ИмяДляПеревода = "ВтораяГруппа" Тогда 
				Возврат НСтр("ru='Вторая (II)';uk='Друга (ІІ)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПерваяГруппа" Тогда 
				Возврат НСтр("ru='Первая (I)';uk='Перша (І)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТретьяГруппа" Тогда 
				Возврат НСтр("ru='Третья (III)';uk='Третя (ІІІ)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГруппыНалоговыхНазначений" Тогда 
			Если ИмяДляПеревода = "НалоговыеНазначенияАктивовИВзаиморасчетовПоНДС" Тогда 
				Возврат НСтр("ru='Активов и взаиморасчетов по НДС';uk='Активів і взаєморозрахунків по ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалоговыеНазначенияДоНКУ" Тогда 
				Возврат НСтр("ru='до 01.04.2011 (устаревшие)';uk='до 01.04.2011 (застарілі)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалоговыеНазначенияДоходовИЗатрат" Тогда 
				Возврат НСтр("ru='до 01.01.2015 (устаревшие): Доходов и затрат';uk='до 01.01.2015 (застарілі): Доходів і витрат'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГруппыНачисленияУдержанияВыплаты" Тогда 
			Если ИмяДляПеревода = "Выплачено" Тогда 
				Возврат НСтр("ru='Выплачено';uk='Виплачено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КонечноеСальдо" Тогда 
				Возврат НСтр("ru='Сальдо по итогам расчетов за месяц';uk='Сальдо за підсумками розрахунків за місяць'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КонечноеСальдоПериода" Тогда 
				Возврат НСтр("ru='Сальдо по итогам расчетов за период';uk='Сальдо за підсумками розрахунків за період'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Льготы" Тогда 
				Возврат НСтр("ru='Льготы';uk='Пільги'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачальноеСальдо" Тогда 
				Возврат НСтр("ru='Входящее сальдо месяца';uk='Вхідне сальдо місяця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачальноеСальдоПериода" Тогда 
				Возврат НСтр("ru='Входящее сальдо периода';uk='Вхідне сальдо періоду'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Начислено" Тогда 
				Возврат НСтр("ru='Начислено';uk='Нараховано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Справочно" Тогда 
				Возврат НСтр("ru='Справочно';uk='Довідково'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Удержано" Тогда 
				Возврат НСтр("ru='Удержано';uk='Утримано'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГруппыПлательщиковЕдиногоНалога" Тогда 
			Если ИмяДляПеревода = "ВтораяГруппа" Тогда 
				Возврат НСтр("ru='Вторая группа';uk='Друга група'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПерваяГруппа" Тогда 
				Возврат НСтр("ru='Первая группа';uk='Перша група'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПятаяГруппа" Тогда 
				Возврат НСтр("ru='Пятая группа';uk='П'ята група'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТретьяГруппа" Тогда 
				Возврат НСтр("ru='Третья группа';uk='Третя група'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧетвертаяГруппа" Тогда 
				Возврат НСтр("ru='Четвертая группа';uk='Четверта група'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ШестаяГруппа" Тогда 
				Возврат НСтр("ru='Шестая группа';uk='Шоста група'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГруппыУчетаКарточкиВоинскогоУчета" Тогда 
			Если ИмяДляПеревода = "Женщины" Тогда 
				Возврат НСтр("ru='Женщины';uk='Жінки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОфицерскийСостав" Тогда 
				Возврат НСтр("ru='Офицерский состав';uk='Офіцерський склад'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Призывники" Тогда 
				Возврат НСтр("ru='Призывники';uk='Призовники'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РедовойСержантскийСтаршинскийСостав" Тогда 
				Возврат НСтр("ru='Редовой, сержантский и старшинский состав';uk='Рядовий, сержантський і старшинський склад'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДействияПриОбмене" Тогда 
			Если ИмяДляПеревода = "ВыгрузкаДанных" Тогда 
				Возврат НСтр("ru='Отправка данных';uk='Відправлення даних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗагрузкаДанных" Тогда 
				Возврат НСтр("ru='Получение данных';uk='Одержання даних'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДействияСЕжегоднымиОтпусками" Тогда 
			Если ИмяДляПеревода = "Отменить" Тогда 
				Возврат НСтр("ru='Отменить';uk='Скасувати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Утвердить" Тогда 
				Возврат НСтр("ru='Утвердить';uk='Затвердити'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДействияСНачислениямиИУдержаниями" Тогда 
			Если ИмяДляПеревода = "Отменить" Тогда 
				Возврат НСтр("ru='Отменить';uk='Скасувати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Утвердить" Тогда 
				Возврат НСтр("ru='Утвердить';uk='Затвердити'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку" Тогда 
			Если ИмяДляПеревода = "НеОтгружать" Тогда 
				Возврат НСтр("ru='Не отгружать';uk='Не відвантажувати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отгрузить" Тогда 
				Возврат НСтр("ru='Отгрузить';uk='Відвантажити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отобрать" Тогда 
				Возврат НСтр("ru='Отобрать';uk='Відібрати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДействияСПозициямиШтатногоРасписания" Тогда 
			Если ИмяДляПеревода = "ЗакрытьПозицию" Тогда 
				Возврат НСтр("ru='Закрыть позицию';uk='Закрити позицію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СоздатьНовуюПозицию" Тогда 
				Возврат НСтр("ru='Создать новую позицию';uk='Створити нову позицію'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДействияСУдержаниями" Тогда 
			Если ИмяДляПеревода = "Изменить" Тогда 
				Возврат НСтр("ru='Изменить';uk='Змінити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Начать" Тогда 
				Возврат НСтр("ru='Начать';uk='Почати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прекратить" Тогда 
				Возврат НСтр("ru='Прекратить';uk='Припинити'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДействияСФайламиПоДвойномуЩелчку" Тогда 
			Если ИмяДляПеревода = "ОткрыватьКарточку" Тогда 
				Возврат НСтр("ru='Открывать карточку';uk='Відкривати картку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОткрыватьФайл" Тогда 
				Возврат НСтр("ru='Открывать файл';uk='Відкривати файл'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДниНедели" Тогда 
			Если ИмяДляПеревода = "Воскресенье" Тогда 
				Возврат НСтр("ru='Воскресенье';uk='Неділя'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Вторник" Тогда 
				Возврат НСтр("ru='Вторник';uk='Вівторок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Понедельник" Тогда 
				Возврат НСтр("ru='Понедельник';uk='Понеділок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Пятница" Тогда 
				Возврат НСтр("ru='Пятница';uk='П'ятниця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Среда" Тогда 
				Возврат НСтр("ru='Среда';uk='Середа'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Суббота" Тогда 
				Возврат НСтр("ru='Суббота';uk='Субота'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Четверг" Тогда 
				Возврат НСтр("ru='Четверг';uk='Четвер'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов" Тогда 
			Если ИмяДляПеревода = "Артикул" Тогда 
				Возврат НСтр("ru='Артикул';uk='Артикул'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Код" Тогда 
				Возврат НСтр("ru='Код';uk='Код'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВыводить" Тогда 
				Возврат НСтр("ru='Не выводить';uk='Не виводити'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДополнительныеЗначенияДоступа" Тогда 
			Если ИмяДляПеревода = "ДоступЗапрещен" Тогда 
				Возврат НСтр("ru='Доступ запрещен';uk='Доступ заборонений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоступРазрешен" Тогда 
				Возврат НСтр("ru='Доступ разрешен';uk='Доступ дозволений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДополнительныеРежимыЭлементовОтчетов" Тогда 
			Если ИмяДляПеревода = "ВидОтчета" Тогда 
				Возврат НСтр("ru='Вид отчета';uk='Вид звіту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВсеПоказателиВСложнойТаблице" Тогда 
				Возврат НСтр("ru='Все показатели в сложной таблице';uk='Всі показники в складній таблиці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВсеСтатьиВСложнойТаблице" Тогда 
				Возврат НСтр("ru='Все статьи в сложной таблице';uk='Всі статті у складній таблиці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоказатьКодСтрокиПримечание" Тогда 
				Возврат НСтр("ru='Показать код строки примечание';uk='Показати код рядка примітка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СвязанныйЭлемент" Тогда 
				Возврат НСтр("ru='Связанный элемент';uk='Зв'язаний елемент'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтатьяБюджетовВРежимеВвода" Тогда 
				Возврат НСтр("ru='Статья бюджетов в режиме ввода';uk='Стаття бюджетів в режимі вводу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтатьяВПоказателеБюджетов" Тогда 
				Возврат НСтр("ru='Статья в показателе бюджетов';uk='Стаття в показнику бюджетів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭлементТаблицыВРежимеВвода" Тогда 
				Возврат НСтр("ru='Элемент таблицы в режиме ввода';uk='Елемент таблиці в режимі вводу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭлементТаблицыВСложнойТаблице" Тогда 
				Возврат НСтр("ru='Элемент таблицы в сложной таблице';uk='Елемент таблиці у складній таблиці'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДоступностьТовараДляКлиента" Тогда 
			Если ИмяДляПеревода = "Достаточно" Тогда 
				Возврат НСтр("ru='Достаточно';uk='Достатньо'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Мало" Тогда 
				Возврат НСтр("ru='Мало';uk='Мало'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Много" Тогда 
				Возврат НСтр("ru='Много';uk='Багато'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Неизвестно" Тогда 
				Возврат НСтр("ru='Неизвестно';uk='Невідомо'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НетВНаличии" Тогда 
				Возврат НСтр("ru='Нет в наличии';uk='Немає в наявності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УточняйтеНаличие" Тогда 
				Возврат НСтр("ru='Уточняйте наличие';uk='Наявність уточнюйте'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ДоступныеПериодыОтчета" Тогда 
			Если ИмяДляПеревода = "Год" Тогда 
				Возврат НСтр("ru='Год';uk='Рік'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Декада" Тогда 
				Возврат НСтр("ru='Декада';uk='Декада'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "День" Тогда 
				Возврат НСтр("ru='День';uk='День'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Квартал" Тогда 
				Возврат НСтр("ru='Квартал';uk='Квартал'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Месяц" Тогда 
				Возврат НСтр("ru='Месяц';uk='Місяць'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Неделя" Тогда 
				Возврат НСтр("ru='Неделя';uk='Тиждень'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Полугодие" Тогда 
				Возврат НСтр("ru='Полугодие';uk='Півріччя'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизвольныйПериод" Тогда 
				Возврат НСтр("ru='Произвольный';uk='Довільний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЕдиницыВремениУчетаСпецстажа" Тогда 
			Если ИмяДляПеревода = "КалендарныеДни" Тогда 
				Возврат НСтр("ru='Календарные дни';uk='Календарні дні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Смены" Тогда 
				Возврат НСтр("ru='Смены';uk='Зміни'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Часы" Тогда 
				Возврат НСтр("ru='Часы';uk='Г-ни'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЕдиницыИзмеренияВремени" Тогда 
			Если ИмяДляПеревода = "Год" Тогда 
				Возврат НСтр("ru='г';uk='г'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "День" Тогда 
				Возврат НСтр("ru='дн';uk='дн'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Месяц" Тогда 
				Возврат НСтр("ru='мес';uk='міс'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Минута" Тогда 
				Возврат НСтр("ru='мин';uk='хв'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Секунда" Тогда 
				Возврат НСтр("ru='сек';uk='сек'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сутки" Тогда 
				Возврат НСтр("ru='сут';uk='доб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Час" Тогда 
				Возврат НСтр("ru='ч';uk='год'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЗначениеРесурсаРегистровСостоянийСотрудника" Тогда 
			Если ИмяДляПеревода = "НеУстановлено" Тогда 
				Возврат НСтр("ru='Не установлено';uk='Не встановлено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Установлено" Тогда 
				Возврат НСтр("ru='Установлено';uk='Встановлено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УстановленоЗначениеПоУмолчанию" Тогда 
				Возврат НСтр("ru='Установлено значение по умолчанию';uk='Встановлено значення по умовчанню'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЗоныВниманияВариантовАнализа" Тогда 
			Если ИмяДляПеревода = "Важно" Тогда 
				Возврат НСтр("ru='Важно';uk='Важливо'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КритическоеСостояние" Тогда 
				Возврат НСтр("ru='Критическое состояние';uk='Критичний стан'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КСведению" Тогда 
				Возврат НСтр("ru='К сведению';uk='До відома'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РассчитанныеСОшибками" Тогда 
				Возврат НСтр("ru='Рассчитанные с ошибками';uk='Розраховані з помилками'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ИнициаторОтменыЗаказовПоставщикам" Тогда 
			Если ИмяДляПеревода = "НашеПредприятие" Тогда 
				Возврат НСтр("ru='Наше предприятие';uk='Наше підприємство'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Поставщик" Тогда 
				Возврат НСтр("ru='Поставщик';uk='Постачальник'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ИспользованиеЗаданийТорговымПредставителям" Тогда 
			Если ИмяДляПеревода = "ИспользуютсяДляУправленияТорговымиПредставителями" Тогда 
				Возврат НСтр("ru='Используются для управления торговыми представителями';uk='Використовуються для управління торговими представниками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИспользуютсяТорговымиПредставителямиДляПланирования" Тогда 
				Возврат НСтр("ru='Используются торговыми представителями для планирования';uk='Використовуються торговими представниками для планування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИспользуются" Тогда 
				Возврат НСтр("ru='Не используются';uk='Не використовуються'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ИспользованиеКонтактнойИнформацииМобильнымПриложением" Тогда 
			Если ИмяДляПеревода = "ИспользуетсяДляЧтения" Тогда 
				Возврат НСтр("ru='Используется для чтения';uk='Використовується для читання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИспользуетсяДляЧтенияИЗаписи" Тогда 
				Возврат НСтр("ru='Используется для чтения и записи';uk='Використовується для читання та запису'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИспользуется" Тогда 
				Возврат НСтр("ru='Не используется';uk='Не використовується'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ИспользованиеНоменклатурыВНСИПроизводства" Тогда 
			Если ИмяДляПеревода = "Аналог" Тогда 
				Возврат НСтр("ru='Аналог';uk='Аналог'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Изделие" Тогда 
				Возврат НСтр("ru='Изделие';uk='Виріб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Материал" Тогда 
				Возврат НСтр("ru='Материал (услуга)';uk='Матеріал (послуга)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ИспользованиеСкладскихРабочихУчастков" Тогда 
			Если ИмяДляПеревода = "Использовать" Тогда 
				Возврат НСтр("ru='Использовать';uk='Використовувати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИспользовать" Тогда 
				Возврат НСтр("ru='Не использовать';uk='Не використовувати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОпределяетсяНастройкамиПомещения" Тогда 
				Возврат НСтр("ru='Использование определяется в помещениях';uk='Використання визначається в приміщеннях'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ИспользованиеСоглашенийСКлиентами" Тогда 
			Если ИмяДляПеревода = "НеИспользовать" Тогда 
				Возврат НСтр("ru='Не использовать';uk='Не використовувати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТиповыеИИндивидуальныеСоглашения" Тогда 
				Возврат НСтр("ru='Типовые и индивидуальные соглашения';uk='Типові та індивідуальні оферти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТолькоИндивидуальныеСоглашения" Тогда 
				Возврат НСтр("ru='Только индивидуальные соглашения';uk='Тільки індивідуальні оферти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТолькоТиповыеСоглашения" Тогда 
				Возврат НСтр("ru='Только типовые соглашения';uk='Тільки типові оферти'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ИспользованиеЭтаповОплаты" Тогда 
			Если ИмяДляПеревода = "ГрафикиОплаты" Тогда 
				Возврат НСтр("ru='Графики оплаты';uk='Графіки оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасширеннаяНастройка" Тогда 
				Возврат НСтр("ru='Расширенная настройка';uk='Розширена настройка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УпрощеннаяСхема" Тогда 
				Возврат НСтр("ru='Упрощенная схема';uk='Спрощена схема'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ИсточникиДанныхДляРасчетаСреднегоЗаработка" Тогда 
			Если ИмяДляПеревода = "Исправления" Тогда 
				Возврат НСтр("ru='Исправления';uk='Виправлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Начисления" Тогда 
				Возврат НСтр("ru='Начисления';uk='Нарахування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереносДанных" Тогда 
				Возврат НСтр("ru='Перенос данных';uk='Перенесення даних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СведенияДоНачалаЭксплуатации" Тогда 
				Возврат НСтр("ru='Сведения до начала эксплуатации';uk='Відомості до початку експлуатації'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ИсточникиИнформацииОЦенахДляПечати" Тогда 
			Если ИмяДляПеревода = "ПоВидуЦен" Тогда 
				Возврат НСтр("ru='По виду цен';uk='За видом цін'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСебестоимости" Тогда 
				Возврат НСтр("ru='По себестоимости';uk='За собівартістю'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ИсточникиПодразделенийАналитическихРегистров" Тогда 
			Если ИмяДляПеревода = "АналитикаУчетаДенежныхСредств" Тогда 
				Возврат НСтр("ru='Аналитика учета денежных средств';uk='Аналітика обліку грошових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АналитикаУчетаДенежныхСредствОтправителя" Тогда 
				Возврат НСтр("ru='Аналитика учета денежных средств отправителя';uk='Аналітика обліку грошових коштів відправника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АналитикаУчетаДенежныхСредствПолучателя" Тогда 
				Возврат НСтр("ru='Аналитика учета денежных средств получателя';uk='Аналітика обліку грошових коштів одержувача'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АналитикаУчетаДоходовРасходов" Тогда 
				Возврат НСтр("ru='Аналитика учета доходов/расходов';uk='Аналітика обліку доходів/витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АналитикаУчетаНоменклатуры" Тогда 
				Возврат НСтр("ru='Аналитика учета номенклатуры';uk='Аналітика обліку номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АналитикаУчетаПрочихАктивовПассивов" Тогда 
				Возврат НСтр("ru='Аналитика учета прочих активов/пассивов';uk='Аналітика обліку інших активів/пасивів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоговорКонтрагента" Тогда 
				Возврат НСтр("ru='Договор контрагента';uk='Договір контрагента'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДокументОплаты" Тогда 
				Возврат НСтр("ru='Документ оплаты';uk='Документ оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Заказ" Тогда 
				Возврат НСтр("ru='Объект расчетов';uk='Об'єкт розрахунків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбъектРасчетовСКонтрагентом" Тогда 
				Возврат НСтр("ru='Объект расчетов с контрагентом';uk='Об'єкт розрахунків з контрагентом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПодразделениеРегистратора" Тогда 
				Возврат НСтр("ru='Подразделение регистратора';uk='Підрозділ реєстратора'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ХозяйственнаяОперация" Тогда 
				Возврат НСтр("ru='Хозяйственная операция';uk='Господарська операція'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ИсточникиПравилДляОбменаДанными" Тогда 
			Если ИмяДляПеревода = "МакетКонфигурации" Тогда 
				Возврат НСтр("ru='Макет конфигурации';uk='Макет конфігурації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Файл" Тогда 
				Возврат НСтр("ru='Файл';uk='Файл'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КатегорииДолжностейДляВоинскогоУчета" Тогда 
			Если ИмяДляПеревода = "ДругиеСлужащие" Тогда 
				Возврат НСтр("ru='Другие служащие';uk='Інші службовці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Рабочие" Тогда 
				Возврат НСтр("ru='Рабочие';uk='Робочі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Руководители" Тогда 
				Возврат НСтр("ru='Руководители';uk='Керівники'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Специалисты" Тогда 
				Возврат НСтр("ru='Специалисты';uk='Фахівці'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КатегорииДолжностейДляСтатистическогоУчета" Тогда 
			Если ИмяДляПеревода = "ДругиеСлужащие" Тогда 
				Возврат НСтр("ru='Другие служащие';uk='Інші службовці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Рабочие" Тогда 
				Возврат НСтр("ru='Рабочие';uk='Робочі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Руководители" Тогда 
				Возврат НСтр("ru='Руководители';uk='Керівники'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Специалисты" Тогда 
				Возврат НСтр("ru='Специалисты';uk='Фахівці'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КатегорииДолжностейДляУчетаЗабронированных" Тогда 
			Если ИмяДляПеревода = "Водители" Тогда 
				Возврат НСтр("ru='Водители';uk='Водії'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДругиеСлужащие" Тогда 
				Возврат НСтр("ru='Другие служащие (делопроизводители, секретари и др. )';uk='Інші службовці (діловоди, секретарі та ін )'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеСпециалисты" Тогда 
				Возврат НСтр("ru='Специалисты, работающие в прочих видах экономической деятельности';uk='Фахівці, що працюють в інших видах економічної діяльності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РабочиеИмеющиеТарифныйРазряд" Тогда 
				Возврат НСтр("ru='Рабочие имеющие тарифный разряд';uk='Робітники мають тарифний розряд'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РабочиеЛокомотивныхБригад" Тогда 
				Возврат НСтр("ru='Рабочие локомотивных бригад';uk='Робітники локомотивних бригад'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РабочиеНеИмеющиеТарифныхРазрядов" Тогда 
				Возврат НСтр("ru='Рабочие не имеющие тарифных разрядов';uk='Робітники не мають тарифних розрядів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РабочиеСХ" Тогда 
				Возврат НСтр("ru='Рабочие сельскохозяйственного производства';uk='Робочі сільськогосподарського виробництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Руководители" Тогда 
				Возврат НСтр("ru='Руководители';uk='Керівники'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СпециалистыЗдравоохранение" Тогда 
				Возврат НСтр("ru='Специалисты по ВЭД Здравоохранение и предоставление социальных услуг';uk='Спеціалісти з ЗЕД охорона Здоров'я і надання соціальних послуг'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СпециалистыОбрабатывающиеПроизводства" Тогда 
				Возврат НСтр("ru='Специалисты по ВЭД Обрабатывающие производства';uk='Спеціалісти з ЗЕД Обробні виробництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СпециалистыОбразования" Тогда 
				Возврат НСтр("ru='Специалисты по ВЭД Образование, включая студентов, курсантов и пр.';uk='Спеціалісти з ЗЕД Освіта, включаючи студентів, курсантів та ін.'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СпециалистыПолезныеИскопаемые" Тогда 
				Возврат НСтр("ru='Специалисты по ВЭД Добыча полезных ископаемых';uk='Спеціалісти з ЗЕД Видобуток корисних копалин'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СпециалистыПроизводствоЭлектроэнергии" Тогда 
				Возврат НСтр("ru='Специалисты по ВЭД Производство и распределение электро-энергии, газа и воды';uk='Спеціалісти з ЗЕД Виробництво та розподілення електро-енергії, газу та води'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СпециалистыСтроительство" Тогда 
				Возврат НСтр("ru='Специалисты по ВЭД Строительство';uk='Спеціалісти з ЗЕД Будівництво'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СпециалистыСХ" Тогда 
				Возврат НСтр("ru='Специалисты сельского хозяйства';uk='Спеціалісти сільського господарства'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СпециалистыТранспорт" Тогда 
				Возврат НСтр("ru='Специалисты по ВЭД Транспорт и связь';uk='Спеціалісти з ЗЕД Транспорт і зв'язок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Трактористы" Тогда 
				Возврат НСтр("ru='Трактористы';uk='Трактористи'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КатегорииЗапасаВоеннообязанных" Тогда 
			Если ИмяДляПеревода = "ВтораяКатегория" Тогда 
				Возврат НСтр("ru='2';uk='2'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПерваяКатегория" Тогда 
				Возврат НСтр("ru='1';uk='1'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КатегорииНачисленийИНеоплаченногоВремени" Тогда 
			Если ИмяДляПеревода = "БолезньБезОплаты" Тогда 
				Возврат НСтр("ru='Болезнь без оплаты';uk='Хвороба без оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыходноеПособие" Тогда 
				Возврат НСтр("ru='Выходное пособие';uk='Вихідна допомога'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыходноеПособиеМесячноеДенежноеСодержание" Тогда 
				Возврат НСтр("ru='Выходное пособие (месячное денежное содержание)';uk='Вихідна допомога (місячне грошове утримання)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДенежноеСодержаниеКомпенсацияОтпуска" Тогда 
				Возврат НСтр("ru='Денежное содержание компенсация отпуска';uk='Грошове утримання компенсація відпустки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДенежноеСодержаниеНаПериодКомандировки" Тогда 
				Возврат НСтр("ru='Денежное содержание на период командировки';uk='Грошове утримання на період відрядження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДенежноеСодержаниеНаПериодОтпуска" Тогда 
				Возврат НСтр("ru='Денежное содержание на период отпуска';uk='Грошове утримання на період відпустки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоплатаДоДенежногоСодержанияЗаДниБолезни" Тогда 
				Возврат НСтр("ru='Доплата до денежного содержания за дни болезни';uk='Доплата до грошового утримання за дні хвороби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоплатаДоМЗП" Тогда 
				Возврат НСтр("ru='Доплата до МЗП';uk='Доплата до МЗП'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоплатаДоСреднегоЗаработка" Тогда 
				Возврат НСтр("ru='Доплата до среднего заработка';uk='Доплата до середнього заробітку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоплатаДоСреднегоЗаработкаЗаДниБолезни" Тогда 
				Возврат НСтр("ru='Доплата до среднего заработка за дни болезни';uk='Доплата до середнього заробітку за дні хвороби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоплатаЗаСовмещение" Тогда 
				Возврат НСтр("ru='Доплата за совмещение';uk='Доплата за суміщення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоходВНатуральнойФорме" Тогда 
				Возврат НСтр("ru='Доход в натуральной форме';uk='Дохід у натуральній формі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕдиновременнаяВыплатаКОтпуску" Тогда 
				Возврат НСтр("ru='Единовременная выплата к отпуску';uk='Одноразова виплата до відпустки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕдиновременнаяВыплатаКОтпускуГосслужащего" Тогда 
				Возврат НСтр("ru='Единовременная выплата к отпуску госслужащего';uk='Одноразова виплата до відпустки держслужбовця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаработокНаВремяТрудоустройства" Тогда 
				Возврат НСтр("ru='Заработок на время трудоустройства';uk='Заробіток на час працевлаштування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Индексация" Тогда 
				Возврат НСтр("ru='Индексация зарплаты';uk='Індексація зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомпенсационныеВыплаты" Тогда 
				Возврат НСтр("ru='Компенсационные выплаты';uk='Компенсаційні виплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомпенсацияОтпуска" Тогда 
				Возврат НСтр("ru='Компенсация отпуска';uk='Компенсація відпустки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Льгота" Тогда 
				Возврат НСтр("ru='Льгота';uk='Пільга'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МатериальнаяПомощь" Тогда 
				Возврат НСтр("ru='Материальная помощь';uk='Матеріальна допомога'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МатериальнаяПомощьПриОтпуске" Тогда 
				Возврат НСтр("ru='Материальная помощь к отпуску';uk='Матеріальна допомога до відпустки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МатериальнаяПомощьПриОтпускеГосслужащего" Тогда 
				Возврат НСтр("ru='Материальная помощь к отпуску госслужащего';uk='Матеріальна допомога до відпустки держслужбовця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НадбавкаЗаВредность" Тогда 
				Возврат НСтр("ru='Надбавка за вредность';uk='Надбавка за шкідливість'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеявкаПоНевыясненнымПричинам" Тогда 
				Возврат НСтр("ru='Неявка по невыясненным причинам';uk='Неявка з нез'ясованих причин'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаБольничногоЛиста" Тогда 
				Возврат НСтр("ru='Оплата больничного листа';uk='Оплата лікарняного листа'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаБольничногоЛистаЗаСчетРаботодателя" Тогда 
				Возврат НСтр("ru='Оплата больничного листа за счет работодателя';uk='Оплата лікарняного листа за рахунок роботодавця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаБольничногоНесчастныйСлучайНаПроизводстве" Тогда 
				Возврат НСтр("ru='Оплата больничного листа, несчастный случай на производстве';uk='Оплата лікарняного листа, нещасний випадок на виробництві'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаБольничногоПрофзаболевание" Тогда 
				Возврат НСтр("ru='Оплата больничного листа, профзаболевание';uk='Оплата лікарняного листа, профзахворювання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаДнейУходаЗаДетьмиИнвалидами" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Оплата дней ухода за детьми-инвалидами';uk='ѳ(не український) Оплата днів догляду за дітьми-інвалідами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаКомандировки" Тогда 
				Возврат НСтр("ru='Оплата командировки';uk='Оплата відрядження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаОтпуска" Тогда 
				Возврат НСтр("ru='Оплата отпуска';uk='Оплата відпустки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПоСреднемуЗаработку" Тогда 
				Возврат НСтр("ru='Оплата времени сохраняемого среднего заработка';uk='Оплата часу середнього заробітку, що зберігається'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПредыдущимиДокументами" Тогда 
				Возврат НСтр("ru='Оплата предыдущими документами';uk='Оплата попередніми документами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПростояПоВинеРаботодателя" Тогда 
				Возврат НСтр("ru='Оплата простоя по вине работодателя';uk='Оплата простою з вини роботодавця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПростояПоНезависящимОтРаботодателяПричинам" Тогда 
				Возврат НСтр("ru='Оплата простоя по независящим от работодателя причинам';uk='Оплата простою з незалежних від роботодавця причин'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаТрудаВНатуральнойФорме" Тогда 
				Возврат НСтр("ru='Оплата труда в натуральной форме';uk='Оплата праці в натуральній формі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отгул" Тогда 
				Возврат НСтр("ru='Отгул';uk='Відгул'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускБезОплаты" Тогда 
				Возврат НСтр("ru='Отпуск без оплаты';uk='Відпустка без оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускНаСанаторноКурортноеЛечение" Тогда 
				Возврат НСтр("ru='Отпуск (за счет ФСС) на период санаторно-курортного лечения';uk='Відпустка (за рахунок ФСС) на період санаторно-курортного лікування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускПоБеременностиИРодам" Тогда 
				Возврат НСтр("ru='Отпуск по беременности и родам';uk='Відпустка у зв'язку з вагітністю та пологами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускПоБеременностиИРодамБезОплаты" Тогда 
				Возврат НСтр("ru='Отпуск по беременности и родам без оплаты';uk='Відпустка по вагітності та пологах без оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПовременнаяОплатаТруда" Тогда 
				Возврат НСтр("ru='Повременная оплата труда и надбавки';uk='Почасова оплата праці і надбавки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПособиеПоУходуЗаРебенкомДоПолутораЛет" Тогда 
				Возврат НСтр("ru='Отпуск по уходу за ребенком до шести лет';uk='Відпустка по догляду за дитиною до шести років'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПособиеПоУходуЗаРебенкомДоТрехЛет" Тогда 
				Возврат НСтр("ru='Отпуск по уходу за ребенком до трех лет';uk='Відпустка по догляду за дитиною до трьох років'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Премия" Тогда 
				Возврат НСтр("ru='Премия';uk='Премія'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прогул" Тогда 
				Возврат НСтр("ru='Прогул';uk='Прогул'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПростойПоВинеРаботника" Тогда 
				Возврат НСтр("ru='Простой по вине работника';uk='Простій з вини працівника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочие начисления и выплаты';uk='Інші нарахування і виплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РайонныйКоэффициент" Тогда 
				Возврат НСтр("ru='Районный коэффициент';uk='Районний коефіцієнт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СдельнаяОплатаТруда" Тогда 
				Возврат НСтр("ru='Сдельная оплата труда';uk='Відрядна оплата праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СевернаяНадбавка" Тогда 
				Возврат НСтр("ru='Северная надбавка';uk='Північна надбавка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СохраняемоеДенежноеСодержание" Тогда 
				Возврат НСтр("ru='Сохраняемое денежное содержание';uk='Зберігається грошове утримання'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КатегорииПроблемПооперационногоРасписания" Тогда 
			Если ИмяДляПеревода = "НедоступенРабочийЦентр" Тогда 
				Возврат НСтр("ru='Недоступен рабочий центр';uk='Недоступний робочий центр'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеЗаданоВремяВыполненияОперации" Тогда 
				Возврат НСтр("ru='Не задано время выполнения операции';uk='Не задано час виконання операції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеОпределеныРабочиеЦентры" Тогда 
				Возврат НСтр("ru='Не определены рабочие центры';uk='Не визначені робочі центри'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтсутствуютОперацииДляПланирования" Тогда 
				Возврат НСтр("ru='Отсутствуют операции для планирования';uk='Відсутні операції для планування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасписаниеЗаблокировано" Тогда 
				Возврат НСтр("ru='Расписание находится в состоянии расчета';uk='Розклад знаходиться в стані розрахунку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КатегорииСведенийОФизическихЛицах" Тогда 
			Если ИмяДляПеревода = "Должность" Тогда 
				Возврат НСтр("ru='Должность';uk='Посада'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Инвалидность" Тогда 
				Возврат НСтр("ru='Инвалидность';uk='Інвалідність'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КонтактнаяИнформация" Тогда 
				Возврат НСтр("ru='Контактная информация';uk='Контактна інформація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Образование" Тогда 
				Возврат НСтр("ru='Образование';uk='Освіта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Организация" Тогда 
				Возврат НСтр("ru='Организация';uk='Організація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подразделение" Тогда 
				Возврат НСтр("ru='Подразделение';uk='Підрозділ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СемейноеПоложение" Тогда 
				Возврат НСтр("ru='Семейное положение';uk='Сімейний стан'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СоставСемьи" Тогда 
				Возврат НСтр("ru='Состав семьи';uk='Склад родини'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КатегорииСотрудниковОбменаСБанками" Тогда 
			Если ИмяДляПеревода = "Пенсионеры" Тогда 
				Возврат НСтр("ru='Пенсионеры';uk='Пенсіонери'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочие" Тогда 
				Возврат НСтр("ru='Прочие';uk='Інші'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Студенты" Тогда 
				Возврат НСтр("ru='Студенты';uk='Студенти'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КатегорииСтажа" Тогда 
			Если ИмяДляПеревода = "ВыслугаЛет" Тогда 
				Возврат НСтр("ru='Выслуга лет';uk='Вислуга років'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыслугаЛетНаВоеннойСлужбе" Тогда 
				Возврат НСтр("ru='Выслуга лет на военной службе';uk='Вислуга років на військовій службі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыслугаЛетНаГосударственнойСлужбе" Тогда 
				Возврат НСтр("ru='Выслуга лет на государственной (муниципальной) службе';uk='Вислуга років на державній (муніципальнії) службі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Медицинский" Тогда 
				Возврат НСтр("ru='Медицинский';uk='Медичний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Непрерывный" Тогда 
				Возврат НСтр("ru='Непрерывный';uk='Безперервний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Общий" Тогда 
				Возврат НСтр("ru='Общий';uk='Загальний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбщийНаучноПедагогический" Тогда 
				Возврат НСтр("ru='Общий научно-педагогический';uk='Загальний науково-педагогічний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Педагогический" Тогда 
				Возврат НСтр("ru='Педагогический';uk='Педагогічний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасширенныйСтраховой" Тогда 
				Возврат НСтр("ru='Расширенный страховой';uk='Розширений страховий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Северный" Тогда 
				Возврат НСтр("ru='Северный';uk='Північний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Страховой" Тогда 
				Возврат НСтр("ru='Страховой';uk='Страховий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КатегорииСтатистическогоНаблюдения" Тогда 
			Если ИмяДляПеревода = "ВыплатаСоциальногоХарактера" Тогда 
				Возврат НСтр("ru='Выплата социального характера';uk='Виплата соціального характеру'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаработнаяПлатаРаботников" Тогда 
				Возврат НСтр("ru='Заработная плата работников';uk='Заробітна плата працівників'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КатегорииУдержаний" Тогда 
			Если ИмяДляПеревода = "ВознаграждениеПлатежногоАгента" Тогда 
				Возврат НСтр("ru='Вознаграждение платежного агента';uk='Винагорода платіжного агента'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДенежноеСодержаниеУдержаниеЗаНеотработанныеДниОтпуска" Тогда 
				Возврат НСтр("ru='Удержание за неотработанные дни отпуска (сохраняемое денежное содержание)';uk='Утримання за невідпрацьовані дні відпустки (зберігається грошове утримання)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДобровольныеВзносыВНПФ" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Добровольные взносы в НПФ';uk='ѳ(не український) Добровільні внески в НПФ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДСВ" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Дополнительные страховые взносы на накопительную часть пенсии';uk='ѳ(не український) Додаткові страхові внески на накопичувальну частину пенсії'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсполнительныйЛист" Тогда 
				Возврат НСтр("ru='Исполнительный лист';uk='Виконавчий лист'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбязательстваПоУченическомуДоговору" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Обязательства по ученическому договору';uk='ѳ(не український) Зобов'язання за учнівського договору'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрофсоюзныеВзносы" Тогда 
				Возврат НСтр("ru='Профсоюзные взносы';uk='Профспілкові внески'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочееУдержаниеВПользуТретьихЛиц" Тогда 
				Возврат НСтр("ru='Прочее удержание в пользу третьих лиц';uk='Інше утримання на користь третіх осіб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдержаниеВСчетРасчетовПоПрочимОперациям" Тогда 
				Возврат НСтр("ru='Удержание в счет расчетов по прочим операциям';uk='Утримання в рахунок розрахунків за іншими операціями'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдержаниеЗаНеотработанныеДниОтпуска" Тогда 
				Возврат НСтр("ru='Удержание за неотработанные дни отпуска';uk='Утримання за невідпрацьовані дні відпустки'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КлассификаторВоинскихЗваний" Тогда 
			Если ИмяДляПеревода = "Адмирал" Тогда 
				Возврат НСтр("ru='Адмирал';uk='Адмірал'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВицеАдмирал" Тогда 
				Возврат НСтр("ru='Вице-адмирал';uk='Віце-адмірал'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГенералАрмии" Тогда 
				Возврат НСтр("ru='Генерал армии Украины';uk='Генерал армії України'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГенералЛейтенант" Тогда 
				Возврат НСтр("ru='Генерал-лейтенант';uk='Генерал-лейтенант'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГенералМайор" Тогда 
				Возврат НСтр("ru='Генерал-майор';uk='Генерал-майор'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГенералПолковник" Тогда 
				Возврат НСтр("ru='Генерал-полковник';uk='Генерал-полковник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГлавныйКорабельныйСтаршина" Тогда 
				Возврат НСтр("ru='Главный корабельный старшина';uk='Головний корабельний старшина'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГлавныйСтаршина" Тогда 
				Возврат НСтр("ru='Главный старшина';uk='Головний старшина'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Капитан" Тогда 
				Возврат НСтр("ru='Капитан';uk='Капітан'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Капитан1Ранга" Тогда 
				Возврат НСтр("ru='Капитан 1 ранга';uk='Капітан 1 рангу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Капитан2Ранга" Тогда 
				Возврат НСтр("ru='Капитан 2 ранга';uk='Капітан 2 рангу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Капитан3Ранга" Тогда 
				Возврат НСтр("ru='Капитан 3 ранга';uk='Капітан 3 рангу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КапитанЛейтенант" Тогда 
				Возврат НСтр("ru='Капитан-лейтенант';uk='Капітан-лейтенант'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КонтрАдмирал" Тогда 
				Возврат НСтр("ru='Контр-адмирал';uk='Контр-адмірал'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Лейтенант" Тогда 
				Возврат НСтр("ru='Лейтенант';uk='Лейтенант'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Майор" Тогда 
				Возврат НСтр("ru='Майор';uk='Майор'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Матрос" Тогда 
				Возврат НСтр("ru='Матрос';uk='Матрос'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Мичман" Тогда 
				Возврат НСтр("ru='Мичман';uk='Мічман'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МладшийЛейтенант" Тогда 
				Возврат НСтр("ru='Младший лейтенант';uk='Молодший лейтенант'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МладшийСержант" Тогда 
				Возврат НСтр("ru='Младший сержант';uk='Молодший сержант'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подполковник" Тогда 
				Возврат НСтр("ru='Подполковник';uk='Підполковник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Полковник" Тогда 
				Возврат НСтр("ru='Полковник';uk='Полковник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прапорщик" Тогда 
				Возврат НСтр("ru='Прапорщик';uk='Прапорщик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сержант" Тогда 
				Возврат НСтр("ru='Сержант';uk='Сержант'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Солдат" Тогда 
				Возврат НСтр("ru='Солдат';uk='Солдат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтаршийЛейтенант" Тогда 
				Возврат НСтр("ru='Старший лейтенант';uk='Старший лейтенант'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтаршийМатрос" Тогда 
				Возврат НСтр("ru='Старший матрос';uk='Старший матрос'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтаршийМичман" Тогда 
				Возврат НСтр("ru='Старший мичман';uk='Старший мічман'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтаршийПрапорщик" Тогда 
				Возврат НСтр("ru='Старший прапорщик';uk='Старший прапорщик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтаршийСержант" Тогда 
				Возврат НСтр("ru='Старший сержант';uk='Старший сержант'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтаршийСолдат" Тогда 
				Возврат НСтр("ru='Старший солдат';uk='Старший солдат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Старшина" Тогда 
				Возврат НСтр("ru='Старшина';uk='Старшина'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Старшина1Статьи" Тогда 
				Возврат НСтр("ru='Старшина1 статьи';uk='Старшина1 статті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Старшина2Статьи" Тогда 
				Возврат НСтр("ru='Старшина2 статьи';uk='Старшина2 статті'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КлассыСчетовРасходов" Тогда 
			Если ИмяДляПеревода = "Класс8" Тогда 
				Возврат НСтр("ru='Класс 8 (элементы затрат)';uk='Клас 8 (елементи витрат)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Класс8и9" Тогда 
				Возврат НСтр("ru='Классы 8 и 9 (элементы и затраты деятельности)';uk='Класи 8 і 9 (елементи й витрати діяльності)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Класс9" Тогда 
				Возврат НСтр("ru='Класс 9 (затраты деятельности)';uk='Клас 9 (витрати діяльності)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки" Тогда 
			Если ИмяДляПеревода = "Вредный1" Тогда 
				Возврат НСтр("ru='Подкласс 3.1 класса условий труда ""вредный""';uk='Підклас 3.1 класу умов праці ""шкідливий""'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Вредный2" Тогда 
				Возврат НСтр("ru='Подкласс 3.2 класса условий труда ""вредный""';uk='Підклас 3.2 класу умов праці ""шкідливий""'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Вредный3" Тогда 
				Возврат НСтр("ru='Подкласс 3.3 класса условий труда ""вредный""';uk='Підклас 3.3 класу умов праці ""шкідливий""'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Вредный4" Тогда 
				Возврат НСтр("ru='Подкласс 3.4 класса условий труда ""вредный""';uk='Підклас 3.4 класу умов праці ""шкідливий""'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Допустимый" Тогда 
				Возврат НСтр("ru='Допустимый, подкласс условий труда 2';uk='Допустимий, підклас умов праці 2'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Опасный" Тогда 
				Возврат НСтр("ru='Опасный, подкласс условий труда 4';uk='Небезпечний, підклас умов праці 4'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оптимальный" Тогда 
				Возврат НСтр("ru='Оптимальный, подкласс условий труда 1';uk='Оптимальний, підклас умов праці 1'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КодировкаФайловОбменаПоЗарплатномуПроекту" Тогда 
			Если ИмяДляПеревода = "UTF8" Тогда 
				Возврат НСтр("ru='UTF-8';uk='UTF-8'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Windows1251" Тогда 
				Возврат НСтр("ru='windows-1251';uk='windows-1251'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КомпанияЧастноеЛицо" Тогда 
			Если ИмяДляПеревода = "Компания" Тогда 
				Возврат НСтр("ru='Компания';uk='Компанія'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧастноеЛицо" Тогда 
				Возврат НСтр("ru='Частное лицо';uk='Приватна особа'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КомпенсацияУдержаниеОтпускаПриУвольнении" Тогда 
			Если ИмяДляПеревода = "КомпенсироватьНеИспользованные" Тогда 
				Возврат НСтр("ru='Компенсировать неиспользованный отпуск';uk='Компенсувати невикористану відпустку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИспользовать" Тогда 
				Возврат НСтр("ru='Не использовать';uk='Не використовувати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдержатьЗаИспользованныеАвансом" Тогда 
				Возврат НСтр("ru='Удержать за использованный авансом отпуск';uk='Утримати за використану авансом відпустку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж" Тогда 
			Если ИмяДляПеревода = "Количество" Тогда 
				Возврат НСтр("ru='Количество';uk='Кількість'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КоличествоОдинаковых" Тогда 
				Возврат НСтр("ru='Количество одинаковых';uk='Кількість однакових'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КоличествоРазличных" Тогда 
				Возврат НСтр("ru='Количество различных';uk='Кількість різних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сумма" Тогда 
				Возврат НСтр("ru='Сумма';uk='Сума'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЛогическиеХранилищаСертификатов" Тогда 
			Если ИмяДляПеревода = "AddressBook" Тогда 
				Возврат НСтр("ru='Другие пользователи';uk='Інші користувачі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "CA" Тогда 
				Возврат НСтр("ru='Промежуточные центры сертификации';uk='Проміжні центри сертифікації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "MY" Тогда 
				Возврат НСтр("ru='Личные';uk='Особисті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ROOT" Тогда 
				Возврат НСтр("ru='Корневые центры сертификации';uk='Кореневі центри сертифікації'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.МетодыНачисленияАмортизации" Тогда 
			Если ИмяДляПеревода = "Линейный" Тогда 
				Возврат НСтр("ru='Линейный';uk='Лінійний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Нелинейный" Тогда 
				Возврат НСтр("ru='Нелинейный';uk='Нелінійний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.МетодыНачисленияРезервовОтпусков" Тогда 
			Если ИмяДляПеревода = "МетодОбязательств" Тогда 
				Возврат НСтр("ru='Метод обязательств (МСФО)';uk='Метод зобов'язань (МСФЗ)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НормативныйМетод" Тогда 
				Возврат НСтр("ru='Нормативный метод';uk='Нормативний метод'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.МетодыОбеспеченияПотребностей" Тогда 
			Если ИмяДляПеревода = "ЗаказПодЗаказ" Тогда 
				Возврат НСтр("ru='Заказ под заказ';uk='Замовлення під замовлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоддержаниеЗапасаМинМакс" Тогда 
				Возврат НСтр("ru='Поддержание запаса (min - max)';uk='Підтримка запасу (min - max)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоддержаниеЗапасаНаСрокПоНорме" Тогда 
				Возврат НСтр("ru='Поддержание запаса (расчет по норме)';uk='Підтримка запасу (розрахунок за нормою)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоддержаниеЗапасаНаСрокПоСтатистике" Тогда 
				Возврат НСтр("ru='Поддержание запаса (расчет по статистике)';uk='Підтримка запасу (розрахунок за статистикою)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.МетодыОценкиСтоимостиТоваров" Тогда 
			Если ИмяДляПеревода = "СредняяЗаМесяц" Тогда 
				Возврат НСтр("ru='Средняя за месяц';uk='Середня за місяць'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФИФОВзвешеннаяОценка" Тогда 
				Возврат НСтр("ru='ФИФО (взвешенная оценка)';uk='ФІФО (зважена оцінка)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФИФОСкользящаяОценка" Тогда 
				Возврат НСтр("ru='ФИФО (скользящая оценка)';uk='ФІФО (змінна оцінка)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.МетодыРасчетаВариантовАнализаЦелевыхПоказателей" Тогда 
			Если ИмяДляПеревода = "Сумма" Тогда 
				Возврат НСтр("ru='Сумма';uk='Сума'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаНарастающимИтогом" Тогда 
				Возврат НСтр("ru='Сумма нарастающим итогом';uk='Сума наростаючим підсумком'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.МетодыУправленияЗапасами" Тогда 
			Если ИмяДляПеревода = "ЗаказПодЗаказ" Тогда 
				Возврат НСтр("ru='Заказ под заказ';uk='Замовлення під замовлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбъемноКалендарноеПланирование" Тогда 
				Возврат НСтр("ru='Объемно-календарное планирование';uk='Об'ємно-календарне планування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТочкаПерезаказаФиксированныйИнтервал" Тогда 
				Возврат НСтр("ru='Точка перезаказа (фикс. интервал)';uk='Точка перезамовлення (фікс. інтервал)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТочкаПерезаказаФиксированныйРазмер" Тогда 
				Возврат НСтр("ru='Точка перезаказа (фикс. размер)';uk='Точка перезамовлення (фікс. розмір)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.МоментыОпределенияНалоговойБазы" Тогда 
			Если ИмяДляПеревода = "ПоОплате" Тогда 
				Возврат НСтр("ru='По оплате';uk='По оплаті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоОтгрузке" Тогда 
				Возврат НСтр("ru='По отгрузке';uk='По відвантаженню'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПервомуСобытию" Тогда 
				Возврат НСтр("ru='По первому событию';uk='За першою подією'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.НазначениеПравилРаспределенияРасходов" Тогда 
			Если ИмяДляПеревода = "РаспределениеМатериаловИРабот" Тогда 
				Возврат НСтр("ru='Распределение материалов и работ';uk='Розподіл матеріалів і робіт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаспределениеСтатейРасходовПоПодразделениям" Тогда 
				Возврат НСтр("ru='Распределение статей расходов по подразделениям';uk='Розподіл статей витрат по підрозділах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаспределениеСтатейРасходовПоЭтапамПроизводства" Тогда 
				Возврат НСтр("ru='Распределение статей расходов по этапам производства';uk='Розподіл статей витрат по етапах виробництва'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.НазначенияПоказателейРасчетаЗарплаты" Тогда 
			Если ИмяДляПеревода = "ДляОрганизации" Тогда 
				Возврат НСтр("ru='Для организации';uk='Для організації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДляПодразделения" Тогда 
				Возврат НСтр("ru='Для подразделения';uk='Для підрозділу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДляСотрудника" Тогда 
				Возврат НСтр("ru='Для сотрудника';uk='Для співробітника'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.НазначенияШаблоновЭтикетокИЦенников" Тогда 
			Если ИмяДляПеревода = "ЦенникДляТоваров" Тогда 
				Возврат НСтр("ru='Ценник для товаров';uk='Цінник для товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭтикеткаДляДоставки" Тогда 
				Возврат НСтр("ru='Этикетка для доставки';uk='Етикетка для доставки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭтикеткаДляСкладскихЯчеек" Тогда 
				Возврат НСтр("ru='Этикетка для складских ячеек';uk='Етикетка для складських комірок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭтикеткаДляТоваров" Тогда 
				Возврат НСтр("ru='Этикетка для товаров';uk='Етикетка для товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭтикеткаСерииНоменклатуры" Тогда 
				Возврат НСтр("ru='Этикетка серии номенклатуры';uk='Етикетка серії номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭтикеткаУпаковочныхЛистов" Тогда 
				Возврат НСтр("ru='Этикетка упаковочных листов';uk='Етикетка пакувальних аркушів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.НаправленияЭД" Тогда 
			Если ИмяДляПеревода = "Входящий" Тогда 
				Возврат НСтр("ru='Входящий';uk='Вхідний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Интеркампани" Тогда 
				Возврат НСтр("ru='Между организациями';uk='Між організаціями'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Исходящий" Тогда 
				Возврат НСтр("ru='Исходящий';uk='Вихідний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.НастройкиАдресногоХранения" Тогда 
			Если ИмяДляПеревода = "НеИспользовать" Тогда 
				Возврат НСтр("ru='Не использовать';uk='Не використовувати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОпределяетсяНастройкамиПомещения" Тогда 
				Возврат НСтр("ru='Использование определяется в помещениях';uk='Використання визначається в приміщеннях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЯчейкиОстатки" Тогда 
				Возврат НСтр("ru='Использовать для хранения остатков номенклатуры';uk='Використовувати для зберігання залишків номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЯчейкиСправочно" Тогда 
				Возврат НСтр("ru='Использовать для справочного размещения номенклатуры';uk='Використовувати для довідкового розміщення номенклатури'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.НастройкиИспользованияСерийНоменклатуры" Тогда 
			Если ИмяДляПеревода = "ПартияТоваровПоНомеру" Тогда 
				Возврат НСтр("ru='Партия товаров, имеющих одинаковый номер серии';uk='Партія товарів, що мають однаковий номер серії'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПартияТоваровПоНомеруИСрокуГодности" Тогда 
				Возврат НСтр("ru='Партия товаров, имеющих одинаковый номер серии и срок годности';uk='Партія товарів, що мають однаковий номер серії та строк придатності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПартияТоваровПоСрокуГодности" Тогда 
				Возврат НСтр("ru='Партия товаров, имеющих одинаковый срок годности';uk='Партія товарів, що мають однаковий строк придатності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭкземплярТовара" Тогда 
				Возврат НСтр("ru='Экземпляр товара, имеющий уникальный серийный номер';uk='Екземпляр товару, що має унікальний серійний номер'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.Нумераторы" Тогда 
			Если ИмяДляПеревода = "ПлатежноеПоручение" Тогда 
				Возврат НСтр("ru='Платежное поручение';uk='Платіжне доручення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриходныйКассовыйОрдер" Тогда 
				Возврат НСтр("ru='Приходный кассовый ордер';uk='Прибутковий касовий ордер'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходныйКассовыйОрдер" Тогда 
				Возврат НСтр("ru='Расходный кассовый ордер';uk='Видатковий касовий ордер'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОбеспечениеЗаказовПриПоддержанииЗапаса" Тогда 
			Если ИмяДляПеревода = "ЗаСчетЗапасов" Тогда 
				Возврат НСтр("ru='Обеспечивать за счет запасов';uk='Забезпечувати за рахунок запасів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НезависимоОтЗапасов" Тогда 
				Возврат НСтр("ru='Обеспечивать независимо от поддержания запасов';uk='Забезпечувати незалежно від підтримання запасів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОбработчикиДрайверовПодключаемогоОборудования" Тогда 
			Если ИмяДляПеревода = "Обработчик1СWebСервисОборудование" Тогда 
				Возврат НСтр("ru='1С:Web-сервис оборудование';uk='1С:Web-сервіс обладнання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обработчик1СДисплейПокупателя" Тогда 
				Возврат НСтр("ru='1С:Дисплей покупателя';uk='1С:Дисплей покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обработчик1СПринтерЧеков" Тогда 
				Возврат НСтр("ru='1С:Принтер чеков';uk='1С:Принтер чеків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обработчик1ССканерыШтрихкода" Тогда 
				Возврат НСтр("ru='1С:Сканеры штрихкода (COM)';uk='1С:Сканери штрихкоду (COM)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обработчик1ССканерыШтрихкодаNative" Тогда 
				Возврат НСтр("ru='1С:Сканеры штрихкода (NativeApi)';uk='1С:Сканери штрихкоду (NativeApi)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обработчик1ССчитывателиМагнитныхКарт" Тогда 
				Возврат НСтр("ru='1С:Считыватели магнитных карт';uk='1С:Зчитувачі магнітних карт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обработчик1ССчитывателиМагнитныхКартNative" Тогда 
				Возврат НСтр("ru='1С:Считыватели магнитных карт (NativeApi)';uk='1С:Зчитувачі магнітних карт (NativeApi)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обработчик1СФискальныйРегистраторЭмулятор" Тогда 
				Возврат НСтр("ru='1С:Фискальный регистратор (эмулятор)';uk='1С:Фіскальний реєстратор (емулятор)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикACOMВесыСПечатьюЭтикеток" Тогда 
				Возврат НСтр("ru='ACOM:Весы с печатью этикеток';uk='ACOM:Ваги з друком етикеток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикCASВесыСПечатьюЭтикеток" Тогда 
				Возврат НСтр("ru='CAS:Весы с печатью этикеток';uk='CAS:Ваги з друком етикеток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикCASЭлектронныеВесы" Тогда 
				Возврат НСтр("ru='CAS:Электронные весы';uk='CAS:Електронні ваги'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикScaleCASВесыСПечатьюЭтикеток" Тогда 
				Возврат НСтр("ru='СКЕЙЛ:Весы c печатью этикеток CL5000J';uk='СКЕЙЛ:Ваги з друком етикеток CL5000J'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикАртСофтФискальныйРегистратор" Тогда 
				Возврат НСтр("ru='АртСофт: Fiscal Printer';uk='АртСофт: Fiscal Printer'" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ОбработчикCashalotФискальныйРегистратор" Тогда 
				Возврат НСтр("ru='Cashalot: Программный РРО';uk='Cashalot: Програмний РРО'" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ОбработчикАтолДисплеиПокупателя" Тогда 
				Возврат НСтр("ru='АТОЛ:Дисплеи покупателя';uk='АТОЛ:Дисплеї покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикАтолСканерыШтрихкода" Тогда 
				Возврат НСтр("ru='АТОЛ:Сканеры штрихкода';uk='АТОЛ:Сканери штрих-коду'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикАтолСчитывателиМагнитныхКарт" Тогда 
				Возврат НСтр("ru='АТОЛ:Считыватели магнитных карт';uk='АТОЛ:Зчитувачі магнітних карт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикАтолТерминалыСбораДанных" Тогда 
				Возврат НСтр("ru='АТОЛ:Терминалы сбора данных';uk='АТОЛ:Термінали збору даних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикАтолТерминалыСбораДанныхMobileLogistics" Тогда 
				Возврат НСтр("ru='АТОЛ:Терминалы сбора данных MobileLogistics 8.Х';uk='АТОЛ:Термінали збору даних MobileLogistics 8.Х'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикАтолЭлектронныеВесы" Тогда 
				Возврат НСтр("ru='АТОЛ:Электронные весы';uk='АТОЛ:Електронні ваги'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикАтолЭлектронныеВесы8X" Тогда 
				Возврат НСтр("ru='АТОЛ:Электронные весы 8.Х';uk='АТОЛ:Електронні ваги 8.Х'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикГексагонПринтераЭтикеток" Тогда 
				Возврат НСтр("ru='Гексагон:Принтера этикеток Zebra и Proton';uk='Гексагон:Принтер етикеток Zebra і Proton'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикГексагонСканерыШтрихкода" Тогда 
				Возврат НСтр("ru='Гексагон:Сканеры штрихкода Proton';uk='Гексагон:Сканери штрих-коду Proton'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикГексагонТерминалыСбораДанных" Тогда 
				Возврат НСтр("ru='Гексагон:Терминалы сбора данных Goods';uk='Гексагон:Термінали збору даних Goods'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикККСДисплеиПокупателя" Тогда 
				Возврат НСтр("ru='ККС:Дисплеи покупателя';uk='ККС:Дисплеї покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикКлеверенсТерминалыСбораДанных" Тогда 
				Возврат НСтр("ru='Клеверенс:Терминалы сбора данных';uk='Клеверенс:Термінали збору даних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикКристаллСервисДисплеиПокупателяVikiVision" Тогда 
				Возврат НСтр("ru='Кристалл Сервис:Дисплей покупателя VikiVision';uk='Кристал Сервіс:Дисплей покупця VikiVision'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикПриватбанкЭквайринговыеТерминалы" Тогда 
				Возврат НСтр("ru='Приватбанк:Эквайринговые терминалы Ingenico ECRCommX';uk='Приватбанк:Еквайрингові термінали Ingenico ECRCommX'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикВебЧекЭквайринговыеТерминалы" Тогда 
				Возврат НСтр("ru='ВебЧек:Эквайринговые терминалы';uk='ВебЧек:Еквайрингові термінали'" ,КодЯзыка);					
			ИначеЕсли ИмяДляПеревода = "ОбработчикСканкодДисплеиПокупателя" Тогда 
				Возврат НСтр("ru='Сканкод:Дисплеи покупателя';uk='Сканкод:Дисплеї покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикСканкодСканерыШтрихкода" Тогда 
				Возврат НСтр("ru='Сканкод:Сканеры штрихкода';uk='Сканкод:Сканери штрих-коду'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикСканкодТерминалыСбораДанных" Тогда 
				Возврат НСтр("ru='Сканкод:Терминалы сбора данных';uk='Сканкод:Термінали збору даних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикСканкодТерминалыСбораДанныхNative" Тогда 
				Возврат НСтр("ru='Сканкод:Драйвер для ТСД CipherLAB 8x00 (NativeApi)';uk='Сканкод:Драйвер для ТСД CipherLAB 8x00 (NativeApi)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикСканситиПринтераЭтикеток" Тогда 
				Возврат НСтр("ru='Скансити:Принтер печати этикеток TSC';uk='Скансити:Принтер друку етикеток TSC'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикСканситиТерминалыСбораДанных" Тогда 
				Возврат НСтр("ru='Скансити:Терминалы сбора данных';uk='Скансити:Термінали збору даних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикШтрихМВесыСПечатьюЭтикеток" Тогда 
				Возврат НСтр("ru='Штрих-М:Весы с печатью этикеток';uk='Штрих-М:Ваги з друком етикеток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикШтрихМДисплеиПокупателя" Тогда 
				Возврат НСтр("ru='Штрих-М:Дисплеи покупателя';uk='Штрих-М:Дисплеї покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикШтрихМТерминалыСбораДанных" Тогда 
				Возврат НСтр("ru='Штрих-М:Терминалы сбора данных';uk='Штрих-М:Термінали збору даних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработчикШтрихМЭлектронныеВесы" Тогда 
				Возврат НСтр("ru='Штрих-М:Электронные весы';uk='Штрих-М:Електронні ваги'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОбъектыКалькуляции" Тогда 
			Если ИмяДляПеревода = "ЗаказНаПроизводство" Тогда 
				Возврат НСтр("ru='Позиция заказа на производство';uk='Позиція замовлення на виробництво'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Изделие" Тогда 
				Возврат НСтр("ru='Изделие';uk='Виріб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РесурснаяСпецификация" Тогда 
				Возврат НСтр("ru='Ресурсная спецификация';uk='Ресурсна специфікація'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОжидаемоеДействиеЭД" Тогда 
			Если ИмяДляПеревода = "НеТребуется" Тогда 
				Возврат НСтр("ru='Не требуется';uk='Не потрібно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОткрытьСоглашение" Тогда 
				Возврат НСтр("ru='Открыть соглашение';uk='Відкрити оферту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отправить" Тогда 
				Возврат НСтр("ru='Отправить';uk='Відправити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подписать" Тогда 
				Возврат НСтр("ru='Подписать';uk='Підписати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПодписатьОтправить" Тогда 
				Возврат НСтр("ru='Подписать и отправить';uk='Підписати та відправити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Принять" Тогда 
				Возврат НСтр("ru='Принять аннулирование';uk='Прийняти анулювання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сформировать" Тогда 
				Возврат НСтр("ru='Сформировать';uk='Сформувати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Утвердить" Тогда 
				Возврат НСтр("ru='Утвердить';uk='Затвердити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УтвердитьОтправить" Тогда 
				Возврат НСтр("ru='Утвердить и отправить';uk='Затвердити та відправити'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОперацииАдминистрированияПрофилейБезопасности" Тогда 
			Если ИмяДляПеревода = "Назначение" Тогда 
				Возврат НСтр("ru='Назначение';uk='Призначення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обновление" Тогда 
				Возврат НСтр("ru='Обновление';uk='Оновлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Создание" Тогда 
				Возврат НСтр("ru='Создание';uk='Створення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Удаление" Тогда 
				Возврат НСтр("ru='Удаление';uk='Вилучення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалениеНазначения" Тогда 
				Возврат НСтр("ru='Удаление назначения';uk='Вилучення призначення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОперацииЗакрытияМесяца" Тогда 
			Если ИмяДляПеревода = "КорректировкаНалоговогоНазначенияКапитальныхИнвестиций" Тогда 
				Возврат НСтр("ru='Корректировка налогового назначения капитальных инвестиций';uk='Коригування податкового призначення капітальних інвестицій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереоценкаВалютныхСредств" Тогда 
				Возврат НСтр("ru='Переоценка валютных средств';uk='Переоцінка валютних коштів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОперацииИзмененияАссортимента" Тогда 
			Если ИмяДляПеревода = "ИзменениеВАссортименте" Тогда 
				Возврат НСтр("ru='Изменение в ассортименте';uk='Зміна в асортименті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УправлениеКоллекцией" Тогда 
				Возврат НСтр("ru='Управление коллекцией';uk='Управління колекцією'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОперацииНормативовРаспределения" Тогда 
			Если ИмяДляПеревода = "БлокировкаНорматива" Тогда 
				Возврат НСтр("ru='Блокировка норматива';uk='Блокування нормативу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УстановкаНорматива" Тогда 
				Возврат НСтр("ru='Установка норматива';uk='Встановлення нормативу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОперацииПриЗакрытииКассовойСмены" Тогда 
			Если ИмяДляПеревода = "АрхивацияЧековККМ" Тогда 
				Возврат НСтр("ru='Архивация чеков';uk='Архівування чеків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Нет" Тогда 
				Возврат НСтр("ru='Нет';uk='Ні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалениеЧековККМ" Тогда 
				Возврат НСтр("ru='Удаление чеков';uk='Вилучення чеків'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОписаниеМонотоварности" Тогда 
			Если ИмяДляПеревода = "ПоНоменклатуре" Тогда 
				Возврат НСтр("ru='По номенклатуре';uk='По номенклатурі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСерии" Тогда 
				Возврат НСтр("ru='По серии';uk='По серії'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоХарактеристике" Тогда 
				Возврат НСтр("ru='По характеристике';uk='За характеристикою'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОснованияДляДоначисленияСтраховыхВзносов" Тогда 
			Если ИмяДляПеревода = "ВыезднаяПроверка" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Выездная проверка';uk='ѳ(не український) Виїзна перевірка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДляИсправленияОшибок" Тогда 
				Возврат НСтр("ru='Самостоятельное исправление';uk='Самостійне виправлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КамеральнаяПроверка" Тогда 
				Возврат НСтр("ru='Проверка фискальными органами';uk='Перевірка фіскальними органами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаНеПризнаннаяОшибкой" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Корректировка не признанная ошибкой';uk='ѳ(не український) Коригування не визнана помилкою'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОснованияДляПолученияМатериаловВПроизводстве" Тогда 
			Если ИмяДляПеревода = "ПоЗаказуНаВнутреннееПотребление" Тогда 
				Возврат НСтр("ru='По заказу на передачу в производство';uk='По замовленню на передачу у виробництво'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЗаказуНаПроизводство" Тогда 
				Возврат НСтр("ru='По заказу на производство';uk='По замовленню на виробництво'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОснованияЛьготПоПособию" Тогда 
			Если ИмяДляПеревода = "ВетераныВойны" Тогда 
				Возврат НСтр("ru='Ветераны войны';uk='Ветерани війни'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Донор" Тогда 
				Возврат НСтр("ru='Донор, имеющий право на льготу';uk='Донор, що має право на пільгу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЖертвыНацистскихПреследований" Тогда 
				Возврат НСтр("ru='Жертвы нацистских преследований';uk='Жертви нацистських переслідувань'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РодительРебенкаЧернобыльца" Тогда 
				Возврат НСтр("ru='Родитель больного ребенка, пострадавшего от аварии на ЧАЭС';uk='Батько хворої дитини, що постраждала від аварії на ЧАЕС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УчастникРеволюцииДостоинства" Тогда 
				Возврат НСтр("ru='Пострадавший участник революции достоинства';uk='Постраждалий учасник революції гідності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Чернобыль" Тогда 
				Возврат НСтр("ru='Чернобыльская АЭС';uk='Чорнобильська АЕС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РезидентДияСити" Тогда 
				Возврат НСтр("ru='Резидент Дія Сіті';uk='Резидент Дія Сіті'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОтветственныеЛицаОрганизаций" Тогда 
			Если ИмяДляПеревода = "ГлавныйБухгалтер" Тогда 
				Возврат НСтр("ru='Главный бухгалтер';uk='Головний бухгалтер'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Кассир" Тогда 
				Возврат НСтр("ru='Кассир';uk='Касир'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтветственныйЗаБухгалтерскиеРегистры" Тогда 
				Возврат НСтр("ru='Ответственный за бухгалтерские регистры';uk='Відповідальний за бухгалтерські регістри'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтветственныйЗаВУР" Тогда 
				Возврат НСтр("ru='Ответственный за ВУ';uk='Відповідальний за ВО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтветственныйЗаСоставлениеДокументов" Тогда 
				Возврат НСтр("ru='Ответственный за составление документов';uk='Відповідальний за складання документів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Руководитель" Тогда 
				Возврат НСтр("ru='Руководитель';uk='Керівник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РуководительКадровойСлужбы" Тогда 
				Возврат НСтр("ru='Руководитель кадровой службы';uk='Керівник кадрової служби'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОтношениеКВоинскойОбязанности" Тогда 
			Если ИмяДляПеревода = "Военнообязанный" Тогда 
				Возврат НСтр("ru='Военнообязанный';uk='Військовозобов'язаний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВоеннообязанный" Тогда 
				Возврат НСтр("ru='Не военнообязанный';uk='Не військовозобов'язаний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Призывник" Тогда 
				Возврат НСтр("ru='Призывник';uk='Призовник'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОтношениеКВоинскомуУчету" Тогда 
			Если ИмяДляПеревода = "Встает" Тогда 
				Возврат НСтр("ru='Встает на воинский учет';uk='Встає на військовий облік'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСостоит" Тогда 
				Возврат НСтр("ru='Не состоит на воинском учете (но должен)';uk='Не знаходиться на військовому обліку (але повинен)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПризванНаВоинскуюСлужбу" Тогда 
				Возврат НСтр("ru='Призван на воинскую службу';uk='Призваний на військову службу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СлужбаПоКонтракту" Тогда 
				Возврат НСтр("ru='Служба по контракту';uk='Служба за контрактом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СнятПоВозрасту" Тогда 
				Возврат НСтр("ru='Снят с воинского учета по возрасту';uk='Знятий із військового обліку за віком'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СнятПоСостояниюЗдоровья" Тогда 
				Возврат НСтр("ru='Снят с воинского учета по состоянию здоровья';uk='Знятий із військового обліку за станом здоров'я'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Состоит" Тогда 
				Возврат НСтр("ru='Состоит на воинском учете';uk='Перебуває на військовому обліку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОтображениеОтрицательныхСуммВПлатежномКалендаре" Тогда 
			Если ИмяДляПеревода = "ВСкобках" Тогда 
				Возврат НСтр("ru='В скобках';uk='В дужках'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВыделять" Тогда 
				Возврат НСтр("ru='Не выделять';uk='Не виділяти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СМинусом" Тогда 
				Возврат НСтр("ru='С минусом';uk='З мінусом'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ОтображениеСуммВПлатежномКалендаре" Тогда 
			Если ИмяДляПеревода = "ВТысячах" Тогда 
				Возврат НСтр("ru='В тысячах';uk='У тисячах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОкруглятьДоЦелых" Тогда 
				Возврат НСтр("ru='Округлять до целых';uk='Округляти до цілих'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТочноеЗначение" Тогда 
				Возврат НСтр("ru='Точное значение';uk='Точне значення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПереченьПособийСоциальногоСтрахования" Тогда 
			Если ИмяДляПеревода = "БеременностьРоды" Тогда 
				Возврат НСтр("ru='По беременности и родам';uk='По вагітності та пологах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВСвязиСоСмертью" Тогда 
				Возврат НСтр("ru='Социальное пособие на погребение';uk='Соціальна допомога на поховання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДополнительныеВыходныеДниПоУходуЗаДетьмиИнвалидами" Тогда 
				Возврат НСтр("ru='Оплата дополнительных выходных дней по уходу за детьми-инвалидами';uk='Оплата додаткових вихідних днів по догляду за дітьми-інвалідами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДополнительныйОтпускПослеНесчастныхСлучаев" Тогда 
				Возврат НСтр("ru='Оплата дополнительного отпуска для санаторно-курортного лечения застрахованным';uk='Оплата додаткової відпустки для санаторно-курортного лікування застрахованим'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Нетрудоспособность" Тогда 
				Возврат НСтр("ru='По временной нетрудоспособности';uk='По тимчасовій непрацездатності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НетрудоспособностьНесчастныйСлучай" Тогда 
				Возврат НСтр("ru='По временной нетрудоспособности в связи с несчастным случаем на производстве';uk='По тимчасовій непрацездатності у зв'язку з нещасним випадком на виробництві'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НетрудоспособностьПрофзаболевание" Тогда 
				Возврат НСтр("ru='По временной нетрудоспособности в связи с профзаболеванием';uk='По тимчасовій непрацездатності у зв'язку з профзахворюванням'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУходуЗаРебенком" Тогда 
				Возврат НСтр("ru='По уходу за ребенком';uk='По догляду за дитиною'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриПостановкеНаУчетВРанниеСрокиБеременности" Тогда 
				Возврат НСтр("ru='Единовременное пособие женщинам, вставшим на учет в медицинских учреждениях в ранние сроки беременности';uk='Одноразова допомога жінкам, які стали на облік в медичних установах в ранні терміни вагітності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриРожденииРебенка" Тогда 
				Возврат НСтр("ru='При рождении ребенка';uk='При народженні дитини'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтраховыеВзносыПоДопВыходнымПоУходуЗаДетьмиИнвалидами" Тогда 
				Возврат НСтр("ru='Страховые взносы с оплаты дополнительных выходных дней по уходу за детьми-инвалидами';uk='Страхові внески з оплати додаткових вихідних днів по догляду за дітьми-інвалідами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПериодичностиРасписанийРассылокОтчетов" Тогда 
			Если ИмяДляПеревода = "Ежедневно" Тогда 
				Возврат НСтр("ru='Ежедневно';uk='Щодня'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ежемесячно" Тогда 
				Возврат НСтр("ru='Ежемесячно';uk='Щомісяця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Еженедельно" Тогда 
				Возврат НСтр("ru='Еженедельно';uk='Щотижня'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Произвольное" Тогда 
				Возврат НСтр("ru='Произвольное';uk='Довільне'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.Периодичность" Тогда 
			Если ИмяДляПеревода = "Год" Тогда 
				Возврат НСтр("ru='Год';uk='Рік'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Декада" Тогда 
				Возврат НСтр("ru='Декада';uk='Декада'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "День" Тогда 
				Возврат НСтр("ru='День';uk='День'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Квартал" Тогда 
				Возврат НСтр("ru='Квартал';uk='Квартал'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Месяц" Тогда 
				Возврат НСтр("ru='Месяц';uk='Місяць'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Неделя" Тогда 
				Возврат НСтр("ru='Неделя';uk='Тиждень'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Полугодие" Тогда 
				Возврат НСтр("ru='Полугодие';uk='Півріччя'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПериодОчисткиФайлов" Тогда 
			Если ИмяДляПеревода = "ПоПравилу" Тогда 
				Возврат НСтр("ru='По правилу';uk='За правилом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтаршеГода" Тогда 
				Возврат НСтр("ru='Старше года';uk='Старше року'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтаршеМесяца" Тогда 
				Возврат НСтр("ru='Старше месяца';uk='Старше місяця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтаршеШестиМесяцев" Тогда 
				Возврат НСтр("ru='Старше шести месяцев';uk='Старше шести місяців'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПериодыВводаДанныхОВремени" Тогда 
			Если ИмяДляПеревода = "ВтораяПоловинаТекущегоМесяца" Тогда 
				Возврат НСтр("ru='Вторая половина  месяца';uk='Друга половина місяця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПерваяПоловинаТекущегоМесяца" Тогда 
				Возврат НСтр("ru='Первая половина  месяца';uk='Перша половина місяця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрошлыйПериод" Тогда 
				Возврат НСтр("ru='Произвольный период';uk='Довільний період'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТекущийМесяц" Тогда 
				Возврат НСтр("ru='Текущий месяц';uk='Поточний місяць'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПериодыРасчетаБазовыхНачислений" Тогда 
			Если ИмяДляПеревода = "НесколькоПредыдущихМесяцев" Тогда 
				Возврат НСтр("ru='Несколько предыдущих месяцев';uk='Кілька попередніх місяців'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредыдущийГод" Тогда 
				Возврат НСтр("ru='Предыдущий год';uk='Попередній рік'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредыдущийКвартал" Тогда 
				Возврат НСтр("ru='Предыдущий квартал';uk='Попередній квартал'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредыдущийМесяц" Тогда 
				Возврат НСтр("ru='Предыдущий месяц';uk='Попередній місяць'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТекущийГод" Тогда 
				Возврат НСтр("ru='Текущий год';uk='Поточний рік'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТекущийКвартал" Тогда 
				Возврат НСтр("ru='Текущий квартал';uk='Поточний квартал'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТекущийМесяц" Тогда 
				Возврат НСтр("ru='Текущий месяц';uk='Поточний місяць'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПоказателиАналитическихРегистров" Тогда 
			Если ИмяДляПеревода = "Себестоимость" Тогда 
				Возврат НСтр("ru='Себестоимость';uk='Собівартість'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СебестоимостьБезНДС" Тогда 
				Возврат НСтр("ru='Себестоимость без НДС';uk='Собівартість без ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СебестоимостьРегл" Тогда 
				Возврат НСтр("ru='Себестоимость регл.';uk='Собівартість регл.'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Стоимость" Тогда 
				Возврат НСтр("ru='Стоимость';uk='Вартість'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтоимостьБезНДС" Тогда 
				Возврат НСтр("ru='Стоимость без НДС';uk='Вартість без ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтоимостьРегл" Тогда 
				Возврат НСтр("ru='Стоимость регл.';uk='Вартість регл.'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сумма" Тогда 
				Возврат НСтр("ru='Сумма';uk='Сума'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаБезНДС" Тогда 
				Возврат НСтр("ru='Сумма без НДС';uk='Сума без ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаВВалюте" Тогда 
				Возврат НСтр("ru='Сумма в валюте';uk='Сума у валюті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаВВалютеВзаиморасчетов" Тогда 
				Возврат НСтр("ru='Сумма в валюте взаиморасчетов';uk='Сума у валюті взаєморозрахунків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаВВалютеВзаиморасчетовДебета" Тогда 
				Возврат НСтр("ru='Сумма в валюте взаиморасчетов Дебета';uk='Сума у валюті взаєморозрахунків Дебету'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаВВалютеВзаиморасчетовКредита" Тогда 
				Возврат НСтр("ru='Сумма в валюте взаиморасчетов Кредита';uk='Сума взаєморозрахунків у валюті Кредиту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаВВалютеДокумента" Тогда 
				Возврат НСтр("ru='Сумма в валюте документа';uk='Сума у валюті документа'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаВВалютеПлатежа" Тогда 
				Возврат НСтр("ru='Сумма в валюте платежа';uk='Сума у валюті платежу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаВКорВалюте" Тогда 
				Возврат НСтр("ru='Сумма в кор. валюте';uk='Сума в кор. валюті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаДопРасходов" Тогда 
				Возврат НСтр("ru='Сумма доп. расходов';uk='Сума дод. витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаДопРасходовБезНДС" Тогда 
				Возврат НСтр("ru='Сумма доп. расходов без НДС';uk='Сума дод. витрат без ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаКВыплате" Тогда 
				Возврат НСтр("ru='Сумма к выплате';uk='До виплати сума'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаКВыплатеВРамкахЛимита" Тогда 
				Возврат НСтр("ru='Сумма к выплате в рамках лимита';uk='Сума до виплати в рамках ліміту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаКВыплатеСверхЛимита" Тогда 
				Возврат НСтр("ru='Сумма к выплате сверх лимита';uk='Сума до виплати понад ліміт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаКорректировки" Тогда 
				Возврат НСтр("ru='Сумма корректировки';uk='Сума коригування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаНДС" Тогда 
				Возврат НСтр("ru='Сумма НДС';uk='Сума ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаНДСДопРасходов" Тогда 
				Возврат НСтр("ru='Сумма НДС доп. расходов';uk='Сума ПДВ дод. витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаОплаты" Тогда 
				Возврат НСтр("ru='Сумма оплаты';uk='Сума оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаПостоплаты" Тогда 
				Возврат НСтр("ru='Сумма постоплаты';uk='Сума післяплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаПредоплаты" Тогда 
				Возврат НСтр("ru='Сумма предоплаты';uk='Сума передоплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаРегл" Тогда 
				Возврат НСтр("ru='Сумма регл.';uk='Сума регл.'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПолФизическогоЛица" Тогда 
			Если ИмяДляПеревода = "Женский" Тогда 
				Возврат НСтр("ru='Женский';uk='Жіноча'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Мужской" Тогда 
				Возврат НСтр("ru='Мужской';uk='Чоловіча'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПоляШаблоновМагнитныхКарт" Тогда 
			Если ИмяДляПеревода = "Код" Тогда 
				Возврат НСтр("ru='Код';uk='Код'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорогиШкалыСтавокНалогов" Тогда 
			Если ИмяДляПеревода = "Порог1" Тогда 
				Возврат НСтр("ru='Порог1';uk='Поріг1'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог2" Тогда 
				Возврат НСтр("ru='Порог2';uk='Поріг2'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог3" Тогда 
				Возврат НСтр("ru='Порог3';uk='Поріг3'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог4" Тогда 
				Возврат НСтр("ru='Порог4';uk='Поріг4'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог5" Тогда 
				Возврат НСтр("ru='Порог5';uk='Поріг5'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог6" Тогда 
				Возврат НСтр("ru='Порог6';uk='Поріг6'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог7" Тогда 
				Возврат НСтр("ru='Порог7';uk='Поріг7'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог8" Тогда 
				Возврат НСтр("ru='Порог8';uk='Поріг8'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Порог9" Тогда 
				Возврат НСтр("ru='Порог9';uk='Поріг9'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядкиОкругления" Тогда 
			Если ИмяДляПеревода = "Окр0_01" Тогда 
				Возврат НСтр("ru='0.01';uk='0.01'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр0_05" Тогда 
				Возврат НСтр("ru='0.05';uk='0.05'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр0_1" Тогда 
				Возврат НСтр("ru='0.1';uk='0.1'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр0_5" Тогда 
				Возврат НСтр("ru='0.5';uk='0.5'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр1" Тогда 
				Возврат НСтр("ru='1';uk='1'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр10" Тогда 
				Возврат НСтр("ru='10';uk='10'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр100" Тогда 
				Возврат НСтр("ru='100';uk='100'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр5" Тогда 
				Возврат НСтр("ru='5';uk='5'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр50" Тогда 
				Возврат НСтр("ru='50';uk='50'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядкиОкругленияОтчетности" Тогда 
			Если ИмяДляПеревода = "Окр1" Тогда 
				Возврат НСтр("ru='1';uk='1'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр1000" Тогда 
				Возврат НСтр("ru='1 000';uk='1 000'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Окр1000000" Тогда 
				Возврат НСтр("ru='1 000 000';uk='1 000 000'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокВыполненияЭтаповПодготовкиБюджетов" Тогда 
			Если ИмяДляПеревода = "Параллельно" Тогда 
				Возврат НСтр("ru='Параллельно';uk='Паралельно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Последовательно" Тогда 
				Возврат НСтр("ru='Последовательно';uk='Послідовно'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокЗаполненияНалогов" Тогда 
			Если ИмяДляПеревода = "БезНалогов" Тогда 
				Возврат НСтр("ru='Без налогов';uk='Без податків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Взносы" Тогда 
				Возврат НСтр("ru='Взносы';uk='Внески'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛ" Тогда 
				Возврат НСтр("ru='НДФЛ';uk='ПДФО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛИВзносы" Тогда 
				Возврат НСтр("ru='НДФЛ и взносы';uk='ПДФО і внески'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокОбработкиСкладскогоЗадания" Тогда 
			Если ИмяДляПеревода = "ТоварЯчейка" Тогда 
				Возврат НСтр("ru='Отсканировать товар, подойти к ячейке';uk='Відсканувати товар, підійти до комірки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЯчейкаТовар" Тогда 
				Возврат НСтр("ru='Подойти к ячейке, отсканировать товар';uk='Підійти до комірки, відсканувати товар'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокОплатыПоСоглашениям" Тогда 
			Если ИмяДляПеревода = "РасчетыВВалютеОплатаВВалюте" Тогда 
				Возврат НСтр("ru='Расчеты в валюте, оплата в валюте';uk='Розрахунки у валюті, оплата у валюті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыВВалютеОплатаВГривнах" Тогда 
				Возврат НСтр("ru='Расчеты в валюте, оплата в гривнах';uk='Розрахунки у валюті, оплата в гривнях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыВГривнахОплатаВГривнах" Тогда 
				Возврат НСтр("ru='Расчеты в гривнах, оплата в гривнах';uk='Розрахунки в гривнях, оплата в гривнях'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка" Тогда 
			Если ИмяДляПеревода = "ПоКолдоговору" Тогда 
				Возврат НСтр("ru='В соответствии с коллективным договором';uk='Згідно колективного договору'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоТрудовомуЗаконодательству" Тогда 
				Возврат НСтр("ru='В соответствии с законодательством';uk='У відповідності до законодавства'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокОтветовНаЗапросыУведомленийОПрочтении" Тогда 
			Если ИмяДляПеревода = "ВсегдаОтправлятьУведомление" Тогда 
				Возврат НСтр("ru='Всегда отправлять уведомление';uk='Завжди надсилати повідомлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗапрашиватьПередТемКакОтправитьУведомление" Тогда 
				Возврат НСтр("ru='Запрашивать перед тем как отправить уведомление';uk='Запитувати перед тим, як відправити повідомлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НикогдаНеОтправлятьУведомление" Тогда 
				Возврат НСтр("ru='Никогда не отправлять уведомление';uk='Ніколи не надсилати повідомлення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокОформленияНакладныхРасходныхОрдеров" Тогда 
			Если ИмяДляПеревода = "СначалаНакладные" Тогда 
				Возврат НСтр("ru='Сначала заказы и накладные, затем ордера';uk='Спочатку замовлення та накладні, потім ордера'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СначалаОрдера" Тогда 
				Возврат НСтр("ru='Сначала заказы, затем ордера и накладные';uk='Спочатку замовлення, потім ордера і накладні'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокРасчетаСреднегоЗаработкаОбщий" Тогда 
			Если ИмяДляПеревода = "Постановление100Отпускные" Тогда 
				Возврат НСтр("ru='Постановление100 (для отпускных)';uk='Постановление100 (для відпускних)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Постановление2010" Тогда 
				Возврат НСтр("ru='Постановление100 (для прочих)';uk='Постановление100 (для інших)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокРасчетаСреднегоЗаработкаФСС" Тогда 
			Если ИмяДляПеревода = "Постановление2010" Тогда 
				Возврат НСтр("ru='По правилам для событий, произошедших после 4 июля 2015 года';uk='За правилами для подій, що сталися після 4 липня 2015 року'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Постановление2011" Тогда 
				Возврат НСтр("ru='По правилам для событий, произошедших до 4 июля 2015 года';uk='За правилами для подій, що сталися до 4 липня 2015 року'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокРасчетаСтоимостиЕдиницыВремениОплатыТруда" Тогда 
			Если ИмяДляПеревода = "ПоНормеВремениГрафикаСотрудника" Тогда 
				Возврат НСтр("ru='По норме времени графика сотрудника';uk='За нормою часу графіка співробітника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоНормеВремениПроизводственногоКалендаря" Тогда 
				Возврат НСтр("ru='По норме времени производственного календаря';uk='За нормою часу виробничого календаря'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСреднегодовомуЗначению" Тогда 
				Возврат НСтр("ru='По среднемесячному количеству часов (дней)';uk='По середньомісячному кількості годин (днів)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоНорме21День168Часов" Тогда 
				Возврат НСтр("ru='По норме 21 день 168 часов';uk='За нормою 21 день 168 годин'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокРасчетов" Тогда 
			Если ИмяДляПеревода = "ПоДоговорамКонтрагентов" Тогда 
				Возврат НСтр("ru='По договорам';uk='По договорах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЗаказамНакладным" Тогда 
				Возврат НСтр("ru='По заказам';uk='По замовленнях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоНакладным" Тогда 
				Возврат НСтр("ru='По накладным';uk='За накладними'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов" Тогда 
			Если ИмяДляПеревода = "НачислятьАмортизацию" Тогда 
				Возврат НСтр("ru='Начислять амортизацию';uk='Нараховувати амортизацію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеНачислятьАмортизацию" Тогда 
				Возврат НСтр("ru='Не начислять амортизацию';uk='Не нараховувати амортизацію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписыватьПриПринятииКУчету" Тогда 
				Возврат НСтр("ru='Списывать при принятии к учету';uk='Списувати при прийнятті до обліку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокФормированияИндивидуальныхСведенийУчетаВремени" Тогда 
			Если ИмяДляПеревода = "НеФормировать" Тогда 
				Возврат НСтр("ru='Не формировать';uk='Не формувати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФормироватьПоЗарегистрированнымВидамВремени" Тогда 
				Возврат НСтр("ru='Формировать по зарегистрированным видам времени';uk='Формувати за зареєстрованим видами часу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФормироватьПолностью" Тогда 
				Возврат НСтр("ru='Формировать полностью';uk='Формувати повністю'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПорядокФормированияСправкиОДоходахФизическогоЛица" Тогда 
			Если ИмяДляПеревода = "ВРазрезеКодовОКАТО" Тогда 
				Возврат НСтр("ru='В разрезе кодов ОКАТО/КПП и ставок налога';uk='В розрізі кодів ОКАТО/КПП і ставок податку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сводно" Тогда 
				Возврат НСтр("ru='Сводно';uk='Зведено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПравилаОкругленияПриРасчетеЗарплаты" Тогда 
			Если ИмяДляПеревода = "Авто" Тогда 
				Возврат НСтр("ru='Авто';uk='Авто'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВБольшуюСторону" Тогда 
				Возврат НСтр("ru='В сторону увеличения';uk='У бік збільшення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВМеньшуюСторону" Тогда 
				Возврат НСтр("ru='В сторону уменьшения';uk='У бік зменшення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПравилаРаспределенияНаСебестоимостьТоваров" Тогда 
			Если ИмяДляПеревода = "ПропорциональноВесу" Тогда 
				Возврат НСтр("ru='Пропорционально весу';uk='Пропорційно вазі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПропорциональноКоличеству" Тогда 
				Возврат НСтр("ru='Пропорционально количеству';uk='Пропорційно кількості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПропорциональноОбъему" Тогда 
				Возврат НСтр("ru='Пропорционально объему';uk='Пропорційно об'єму'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПропорциональноСебестоимости" Тогда 
				Возврат НСтр("ru='Пропорционально себестоимости';uk='Пропорційно собівартості'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПравилаРаспределенияПоНаправлениямДеятельности" Тогда 
			Если ИмяДляПеревода = "ПропорциональноВаловойПрибыли" Тогда 
				Возврат НСтр("ru='Пропорционально валовой прибыли';uk='Пропорційно валовому прибутку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПропорциональноДоходам" Тогда 
				Возврат НСтр("ru='Пропорционально доходам';uk='Пропорційно доходам'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПропорциональноКоэффициентам" Тогда 
				Возврат НСтр("ru='Пропорционально коэффициентам';uk='Пропорційно коефіцієнтам'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПропорциональноРасходам" Тогда 
				Возврат НСтр("ru='Пропорционально расходам';uk='Пропорційно витратам'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПредставлениеПериода" Тогда 
			Если ИмяДляПеревода = "КонечнаяДата" Тогда 
				Возврат НСтр("ru='Конечная дата';uk='Кінцева дата'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Наименование" Тогда 
				Возврат НСтр("ru='Наименование';uk='Найменування'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПредставлениеТарифовИНадбавок" Тогда 
			Если ИмяДляПеревода = "МесячныйРазмерВГривнах" Тогда 
				Возврат НСтр("ru='Месячный размер в гривнах';uk='Місячний розмір у гривнях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МесячныйРазмерВГривнахИТарифыКоэффициенты" Тогда 
				Возврат НСтр("ru='Месячный размер и тариф, %, коэфф';uk='Місячний розмір і тариф, %, коеф'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТарифыКоэффициенты" Тогда 
				Возврат НСтр("ru='Тариф, %, коэфф. и т.д.';uk='Тариф, %, коеф. і т. д.'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПрибылиИУбытки" Тогда 
			Если ИмяДляПеревода = "НалогНаПрибыль" Тогда 
				Возврат НСтр("ru='Налог на прибыль и аналогичные платежи';uk='Податок на прибуток та аналогічні платежі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалоговыеСанкции" Тогда 
				Возврат НСтр("ru='Причитающиеся налоговые санкции';uk='Належні податкові санкції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрибыльУбытокОтПродаж" Тогда 
				Возврат НСтр("ru='Прибыль (убыток) от продаж';uk='Прибуток (збиток) від продажу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СальдоПрочихДоходовИРасходов" Тогда 
				Возврат НСтр("ru='Сальдо прочих доходов и расходов';uk='Сальдо інших доходів і витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧрезвычайныеДоходыРасходы" Тогда 
				Возврат НСтр("ru='Чрезвычайные доходы (расходы)';uk='Надзвичайні доходи (витрати)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.Приоритеты" Тогда 
			Если ИмяДляПеревода = "Высокий" Тогда 
				Возврат НСтр("ru='Высокий';uk='Високий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Низкий" Тогда 
				Возврат НСтр("ru='Низкий';uk='Низький'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Средний" Тогда 
				Возврат НСтр("ru='Средний';uk='Середній'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПриоритетыОбъектовОбмена" Тогда 
			Если ИмяДляПеревода = "ПриоритетОбъектаОбменаВыше" Тогда 
				Возврат НСтр("ru='Приоритет объекта обмена выше';uk='Пріоритет об'єкта обміну вище'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриоритетОбъектаОбменаНиже" Тогда 
				Возврат НСтр("ru='Приоритет объекта обмена ниже';uk='Пріоритет об'єкта обміну нижче'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриоритетОбъектаОбменаСовпадает" Тогда 
				Возврат НСтр("ru='Приоритет объекта обмена совпадает';uk='Пріоритет об'єкта обміну збігається'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПричиныБлокировокПооперационногоРасписания" Тогда 
			Если ИмяДляПеревода = "ИзмененСпособУправления" Тогда 
				Возврат НСтр("ru='Изменен способ управления';uk='Змінено спосіб управління'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетРасписания" Тогда 
				Возврат НСтр("ru='Расчет расписания';uk='Розрахунок розкладу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПричиныНетрудоспособности" Тогда 
			Если ИмяДляПеревода = "ЗаболеваниеЧернобыльцев" Тогда 
				Возврат НСтр("ru='Заболевание чернобыльцев';uk='Захворювання чорнобильців'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Карантин" Тогда 
				Возврат НСтр("ru='Карантин';uk='Карантин'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НепроизводственныеТравмы" Тогда 
				Возврат НСтр("ru='Непроизводственные травмы';uk='Невиробничі травми'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбщееЗаболевание" Тогда 
				Возврат НСтр("ru='Заболевание или травма (кроме травм на производстве)';uk='Захворювання або травма (окрім травм на виробництві)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоБеременностиИРодам" Тогда 
				Возврат НСтр("ru='Отпуск по беременности и родам';uk='Відпустка у зв'язку з вагітністю та пологами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПособиеПриДолечивании" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Долечивание в санаторно-курортных учреждениях';uk='ѳ(не український) Доліковування в санаторно-курортних закладах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУходуЗаВзрослым" Тогда 
				Возврат НСтр("ru='Уход за больным взрослым членом семьи';uk='Догляд за хворим дорослим членом сім'ї'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУходуЗаРебенком" Тогда 
				Возврат НСтр("ru='Уход за больным ребенком';uk='Догляд за хворою дитиною'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Протезирование" Тогда 
				Возврат НСтр("ru='Протезирование в стационаре';uk='Протезування в стаціонарі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Профзаболевание" Тогда 
				Возврат НСтр("ru='Профзаболевание';uk='Профзахворювання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СанаторноКурортноеЛечение" Тогда 
				Возврат НСтр("ru='Санаторно-курортное лечение';uk='Санаторно-курортне лікування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТравмаНаПроизводстве" Тогда 
				Возврат НСтр("ru='Травма на производстве';uk='Травма на виробництві'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПричиныОтключенияДополнительныхОтчетовИОбработокВМоделиСервиса" Тогда 
			Если ИмяДляПеревода = "БлокировкаАдминистраторомСервиса" Тогда 
				Возврат НСтр("ru='Блокировка администратором сервиса';uk='Блокування адміністратором сервісу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "БлокировкаВладельцем" Тогда 
				Возврат НСтр("ru='Блокировка владельцем';uk='Блокування власником'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбновлениеВерсииКонфигурации" Тогда 
				Возврат НСтр("ru='Обновление версии конфигурации';uk='Оновлення версії конфігурації'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПричиныСовмещения" Тогда 
			Если ИмяДляПеревода = "ИсполнениеОбязанностей" Тогда 
				Возврат НСтр("ru='Исполнение обязанностей';uk='Виконання обов'язків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СовмещениеПрофессийДолжностей" Тогда 
				Возврат НСтр("ru='Совмещение профессий (должностей)';uk='Суміщення професій (посад)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УвеличениеОбъемаРабот" Тогда 
				Возврат НСтр("ru='Увеличение объема работ';uk='Збільшення обсягу робіт'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПровайдерыSMS" Тогда 
			Если ИмяДляПеревода = "TURBO" Тогда 
				Возврат НСтр("ru='TurboSMS';uk='TurboSMS'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АльфаSMS" Тогда 
				Возврат НСтр("ru='Альфа SMS';uk='Альфа SMS'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПрофилиОфицеров" Тогда 
			Если ИмяДляПеревода = "Ветеринарный" Тогда 
				Возврат НСтр("ru='Ветеринарный';uk='Ветеринарний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Инженерный" Тогда 
				Возврат НСтр("ru='Инженерный';uk='Інженерний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Командный" Тогда 
				Возврат НСтр("ru='Командный';uk='Командний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Медицинский" Тогда 
				Возврат НСтр("ru='Медицинский';uk='Медичний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Технический" Тогда 
				Возврат НСтр("ru='Технический';uk='Технічний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Юридический" Тогда 
				Возврат НСтр("ru='Юридический';uk='Юридичний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оперативный" Тогда 
				Возврат НСтр("ru='Оперативный';uk='Оперативний'" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Административный" Тогда 
				Возврат НСтр("ru='Административный';uk='Адміністративний'" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Оперативно-технический" Тогда 
				Возврат НСтр("ru='Оперативно-технический';uk='Оперативно-технічний'" ,КодЯзыка);
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РазделыИсточниковДанныхБюджетирования" Тогда 
			Если ИмяДляПеревода = "МеждународныйУчет" Тогда 
				Возврат НСтр("ru='Международный учет';uk='Міжнародний облік'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОперативныйУчет" Тогда 
				Возврат НСтр("ru='Оперативный учет';uk='Оперативний облік'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизвольныеДанные" Тогда 
				Возврат НСтр("ru='Произвольные данные';uk='Довільні дані'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РегламентированныйУчет" Тогда 
				Возврат НСтр("ru='Регламентированный учет';uk='Регламентований облік'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РазделыКорректировокНДСПартий" Тогда 
			Если ИмяДляПеревода = "КапитальныеИнвестиции" Тогда 
				Возврат НСтр("ru='Капитальные инвестиции';uk='Капітальні інвестиції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбщепроизводственныеЗатраты" Тогда 
				Возврат НСтр("ru='Общепроизводственные затраты';uk='Загальновиробничі витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Продукция" Тогда 
				Возврат НСтр("ru='Себестоимость готовой продукции';uk='Собівартість готової продукції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизводственныеЗатраты" Тогда 
				Возврат НСтр("ru='Производственные затраты';uk='Виробничі витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходыНаСебестоимостьТоваров" Тогда 
				Возврат НСтр("ru='Расходы на себестоимость товаров';uk='Витрати на собівартість товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТЗР" Тогда 
				Возврат НСтр("ru='ТЗР';uk='ТЗВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварыНаСкладах" Тогда 
				Возврат НСтр("ru='Товары на складах';uk='Товари на складах'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РазделыОтчетовПоЗарплате" Тогда 
			Если ИмяДляПеревода = "Выплаты" Тогда 
				Возврат НСтр("ru='Выплаты';uk='Виплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоходыВНеденежнойФорме" Тогда 
				Возврат НСтр("ru='Доходы в неденежной форме';uk='Доходи в негрошовій формі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Начисления" Тогда 
				Возврат НСтр("ru='Начисления';uk='Нарахування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПогашениеЗадолженности" Тогда 
				Возврат НСтр("ru='Погашение задолженности';uk='Погашення заборгованості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Удержания" Тогда 
				Возврат НСтр("ru='Удержания';uk='Утримання'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РазделыУчетаСебестоимостиТоваров" Тогда 
			Если ИмяДляПеревода = "МатериалыПринятыеВПереработку" Тогда 
				Возврат НСтр("ru='Материалы, принятые в переработку';uk='Матеріали, прийняті в переробку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизводственныеЗатраты" Тогда 
				Возврат НСтр("ru='Производственные затраты';uk='Виробничі витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварыВПути" Тогда 
				Возврат НСтр("ru='Товары в пути';uk='Товари в дорозі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварыНаСкладах" Тогда 
				Возврат НСтр("ru='Товары на складах';uk='Товари на складах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварыПереданныеНаКомиссию" Тогда 
				Возврат НСтр("ru='Товары переданные на комиссию';uk='Товари, передані на комісію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварыПереданныеПереработчику" Тогда 
				Возврат НСтр("ru='Товары переданные переработчику';uk='Товари передані переробнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварыПринятыеНаКомиссию" Тогда 
				Возврат НСтр("ru='Товары, принятые на комиссию';uk='Товари, прийняті на комісію'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РазмерыБумаги" Тогда 
			Если ИмяДляПеревода = "A3" Тогда 
				Возврат НСтр("ru='A3';uk='A3'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "A4" Тогда 
				Возврат НСтр("ru='A4';uk='A4'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "A5" Тогда 
				Возврат НСтр("ru='A5';uk='A5'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "B4" Тогда 
				Возврат НСтр("ru='B4';uk='B4'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "B5" Тогда 
				Возврат НСтр("ru='B5';uk='B5'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "B6" Тогда 
				Возврат НСтр("ru='B6';uk='B6'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "C4" Тогда 
				Возврат НСтр("ru='C4';uk='C4'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "C5" Тогда 
				Возврат НСтр("ru='C5';uk='C5'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "C6" Тогда 
				Возврат НСтр("ru='C6';uk='C6'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "USExecutive" Тогда 
				Возврат НСтр("ru='US Executive';uk='US Executive'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "USLegal" Тогда 
				Возврат НСтр("ru='US Legal';uk='US Legal'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "USLetter" Тогда 
				Возврат НСтр("ru='US Letter';uk='US Letter'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеЗадано" Тогда 
				Возврат НСтр("ru='Не задано';uk='Не задано'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РазрешенияСканированногоИзображения" Тогда 
			Если ИмяДляПеревода = "dpi1200" Тогда 
				Возврат НСтр("ru='1200 dpi';uk='1200 dpi'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "dpi200" Тогда 
				Возврат НСтр("ru='200 dpi';uk='200 dpi'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "dpi300" Тогда 
				Возврат НСтр("ru='300 dpi';uk='300 dpi'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "dpi600" Тогда 
				Возврат НСтр("ru='600 dpi';uk='600 dpi'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РазрешенияЭкрана" Тогда 
			Если ИмяДляПеревода = "Разрешение240х320" Тогда 
				Возврат НСтр("ru='240х320';uk='240х320'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Разрешение320х320" Тогда 
				Возврат НСтр("ru='320х320';uk='320х320'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Разрешение480х640" Тогда 
				Возврат НСтр("ru='480х640';uk='480х640'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РаспределениеЗаявокПоБанковскимСчетам" Тогда 
			Если ИмяДляПеревода = "ПоВсемКонтрактам" Тогда 
				Возврат НСтр("ru='По всем контрактам (по статье калькуляции)';uk='За всіма контрактами (по статті калькуляції)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУказаннымКонтрактам" Тогда 
				Возврат НСтр("ru='По указанным контрактам';uk='За зазначеними контрактами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимНачисленияЗарплаты" Тогда 
			Если ИмяДляПеревода = "ОкончательныйРасчет" Тогда 
				Возврат НСтр("ru='Окончательный расчет';uk='Остаточний розрахунок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетПервойПоловиныМесяца" Тогда 
				Возврат НСтр("ru='Расчет первой половины месяца';uk='Розрахунок першої половини місяця'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимШкалыЗначенийДиаграмм" Тогда 
			Если ИмяДляПеревода = "Авто" Тогда 
				Возврат НСтр("ru='Автоматический';uk='Автоматичний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоМинимальномуЗначению" Тогда 
				Возврат НСтр("ru='По минимальному значению';uk='По мінімальному значенню'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимыВыгрузкиОбъектовОбмена" Тогда 
			Если ИмяДляПеревода = "ВыгружатьВручную" Тогда 
				Возврат НСтр("ru='Выгружать вручную';uk='Вивантажувати вручну'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыгружатьВсегда" Тогда 
				Возврат НСтр("ru='Выгружать всегда';uk='Вивантажувати завжди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыгружатьПоУсловию" Тогда 
				Возврат НСтр("ru='Выгружать по условию';uk='Вивантажувати за умовою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыгружатьПриНеобходимости" Тогда 
				Возврат НСтр("ru='Выгружать при необходимости';uk='Вивантажувати при необхідності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВыгружать" Тогда 
				Возврат НСтр("ru='Не выгружать';uk='Не вивантажувати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимыИспользованияИнформационнойБазы" Тогда 
			Если ИмяДляПеревода = "Демонстрационный" Тогда 
				Возврат НСтр("ru='Демонстрационный';uk='Демонстраційний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Рабочий" Тогда 
				Возврат НСтр("ru='Рабочий';uk='Робочий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимыОтображенияДереваНовыхЭлементов" Тогда 
			Если ИмяДляПеревода = "ВыборВидаЯчейкиСложнойТаблицы" Тогда 
				Возврат НСтр("ru='Выбор вида ячейки сложной таблицы';uk='Вибір виду комірки складної таблиці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаполнениеСтатьиБюджетов" Тогда 
				Возврат НСтр("ru='Заполнение статьи бюджетов';uk='Заповнення статті бюджетів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НастройкаАвторасчетаСложнойТаблицы" Тогда 
				Возврат НСтр("ru='Настройка авторасчета сложной таблицы';uk='Настройка авторазарахунку складної таблиці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НастройкаВидаБюджета" Тогда 
				Возврат НСтр("ru='Настройка вида бюджета';uk='Настройка виду бюджету'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НастройкаВидаОтчета" Тогда 
				Возврат НСтр("ru='Настройка вида отчета';uk='Настройка виду звіту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НастройкаВидаОтчетаТолькоПоказатели" Тогда 
				Возврат НСтр("ru='Настройка вида отчета только показатели';uk='Настройка виду звіту тільки показники'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизводныйПоказательВидаБюджета" Тогда 
				Возврат НСтр("ru='Производный показатель вида бюджета';uk='Похідний показник виду бюджету'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизводныйПоказательСложнойТаблицы" Тогда 
				Возврат НСтр("ru='Производный показатель сложной таблицы';uk='Похідний показник складної таблиці'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимыРаботыФормыСотрудника" Тогда 
			Если ИмяДляПеревода = "Сотрудник" Тогда 
				Возврат НСтр("ru='Сотрудник';uk='Співробітник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СотрудникОформленныйПоДоговоруГПХ" Тогда 
				Возврат НСтр("ru='Сотрудник оформленный по договору ГПХ';uk='Співробітник оформлений за договором ЦПХ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СотрудникОформленныйПоТрудовомуДоговору" Тогда 
				Возврат НСтр("ru='Сотрудник оформленный по трудовому договору';uk='Співробітник оформлений за трудовим договором'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СотрудникОформленныйПоТрудовомуДоговоруИДоговоруГПХ" Тогда 
				Возврат НСтр("ru='Сотрудник оформленный по трудовому договору и договору ГПХ';uk='Співробітник оформлений за трудовим договором і договором ЦПХ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФизическоеЛицо" Тогда 
				Возврат НСтр("ru='Физическое лицо';uk='Фізична особа'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимыРедактированияДоступностиВидовРЦ" Тогда 
			Если ИмяДляПеревода = "ВводГрафикаРаботыРЦДляФормированияРасписанияРаботыРЦ" Тогда 
				Возврат НСтр("ru='Ввод графика работы РЦ для формирования расписания работы РЦ';uk='Введення графіка роботи РЦ для формування розкладу роботи РЦ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВводДоступностиДляФормированияГрафикаПроизводства" Тогда 
				Возврат НСтр("ru='Ввод доступности для формирования графика производства';uk='Введення доступності для формування графіка виробництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТолькоПросмотр" Тогда 
				Возврат НСтр("ru='Только просмотр';uk='Тільки перегляд'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимыСовместимостиРазрешенийДополнительныхОтчетовИОбработок" Тогда 
			Если ИмяДляПеревода = "Версия_2_1_3" Тогда 
				Возврат НСтр("ru='Версия 2.1.3';uk='Версія 2.1. 3'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Версия_2_2_2" Тогда 
				Возврат НСтр("ru='Версия 2.2.2';uk='Версія 2.2. 2'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимыФормированияБюджетныхОтчетов" Тогда 
			Если ИмяДляПеревода = "Документ" Тогда 
				Возврат НСтр("ru='Документ';uk='Документ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Заполнение" Тогда 
				Возврат НСтр("ru='Заполнение';uk='Заповнення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отчет" Тогда 
				Возврат НСтр("ru='Отчет';uk='Звіт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПечатьБюджета" Тогда 
				Возврат НСтр("ru='ПечатьБюджета';uk='ПечатьБюджета'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимыФормированияПечатныхФорм" Тогда 
			Если ИмяДляПеревода = "НаРусскомЯзыке" Тогда 
				Возврат НСтр("ru='На русском языке';uk='Російською мовою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаУкраинскомЯзыке" Тогда 
				Возврат НСтр("ru='На украинском языке';uk='Українською мовою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаЯзыкеИнформационнойБазы" Тогда 
				Возврат НСтр("ru='На языке информационной базы';uk='Мовою інформаційної бази'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РежимыФормированияРасходныхОрдеров" Тогда 
			Если ИмяДляПеревода = "Автоматически" Тогда 
				Возврат НСтр("ru='Автоматически';uk='Автоматично'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Кладовщиком" Тогда 
				Возврат НСтр("ru='Кладовщиком';uk='Комірником'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Менеджером" Тогда 
				Возврат НСтр("ru='Менеджером';uk='Менеджером'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РезультатыВыполненияОбмена" Тогда 
			Если ИмяДляПеревода = "Выполнено" Тогда 
				Возврат НСтр("ru='Выполнено';uk='Виконано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыполненоСПредупреждениями" Тогда 
				Возврат НСтр("ru='Выполнено с предупреждениями';uk='Виконано з попередженнями'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отменено" Тогда 
				Возврат НСтр("ru='Отменено';uk='Скасовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ошибка" Тогда 
				Возврат НСтр("ru='Ошибка';uk='Помилка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ошибка_ТранспортСообщения" Тогда 
				Возврат НСтр("ru='Ошибка транспорта сообщения';uk='Помилка транспорту повідомлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Предупреждение_СообщениеОбменаБылоРанееПринято" Тогда 
				Возврат НСтр("ru='Сообщение обмена было ранее принято';uk='Повідомлення обміну було раніше прийняте'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РезультатыЗачисленияЗарплаты" Тогда 
			Если ИмяДляПеревода = "Зачислено" Тогда 
				Возврат НСтр("ru='Зачислено';uk='Зараховано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеЗачислено" Тогда 
				Возврат НСтр("ru='Не зачислено';uk='Не зараховано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаФИО" Тогда 
				Возврат НСтр("ru='Ошибка ФИО';uk='Помилка ПІБ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетЗакрыт" Тогда 
				Возврат НСтр("ru='Счет закрыт';uk='Рахунок закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетОтсутствует" Тогда 
				Возврат НСтр("ru='Счет отсутствует';uk='Рахунок відсутній'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РезультатыОбработкиЗапросовНаИспользованиеВнешнихРесурсовВМоделиСервиса" Тогда 
			Если ИмяДляПеревода = "ЗапросОдобрен" Тогда 
				Возврат НСтр("ru='Запрос одобрен';uk='Запит схвалений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗапросОтклонен" Тогда 
				Возврат НСтр("ru='Запрос отклонен';uk='Запит відхилений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РезультатыОткрытияЛицевыхСчетовСотрудников" Тогда 
			Если ИмяДляПеревода = "ОшибкаЗаполненияДанных" Тогда 
				Возврат НСтр("ru='Ошибка заполнения данных';uk='Помилка заповнення даних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетНеОткрыт" Тогда 
				Возврат НСтр("ru='Счет не открыт';uk='Рахунок не відкрито'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетОткрыт" Тогда 
				Возврат НСтр("ru='Счет открыт';uk='Рахунок відкрито'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РезультатыСогласования" Тогда 
			Если ИмяДляПеревода = "НеСогласовано" Тогда 
				Возврат НСтр("ru='Не согласовано';uk='Не погоджено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Согласовано" Тогда 
				Возврат НСтр("ru='Согласовано';uk='Погоджено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РезультатыУдовлетворенияПервичногоСпроса" Тогда 
			Если ИмяДляПеревода = "НеУдовлетворен" Тогда 
				Возврат НСтр("ru='Не удовлетворен';uk='Не задоволений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отменен" Тогда 
				Возврат НСтр("ru='Отменен';uk='Скасовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Удовлетворен" Тогда 
				Возврат НСтр("ru='Удовлетворен';uk='Задоволений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧастичноУдовлетворен" Тогда 
				Возврат НСтр("ru='Частично удовлетворен';uk='Частково задоволений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РолиАссортимента" Тогда 
			Если ИмяДляПеревода = "ДополнительныйАссортимент" Тогда 
				Возврат НСтр("ru='Дополнительный ассортимент';uk='Додатковий асортимент'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПостоянныйАссортимент" Тогда 
				Возврат НСтр("ru='Постоянный ассортимент';uk='Постійний асортимент'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПробныйАссортимент" Тогда 
				Возврат НСтр("ru='Пробный ассортимент';uk='Пробний асортимент'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РолиСотрудников" Тогда 
			Если ИмяДляПеревода = "Договорник" Тогда 
				Возврат НСтр("ru='Договорник';uk='Договірник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Работник" Тогда 
				Возврат НСтр("ru='Работник';uk='Працівник'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РолиФизическихЛиц" Тогда 
			Если ИмяДляПеревода = "Акционер" Тогда 
				Возврат НСтр("ru='Акционер';uk='Акціонер'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "БывшийСотрудник" Тогда 
				Возврат НСтр("ru='Бывший сотрудник';uk='Попередній співробітник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Кандидат" Тогда 
				Возврат НСтр("ru='Кандидат';uk='Кандидат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочийПолучательДоходов" Тогда 
				Возврат НСтр("ru='Прочий получатель доходов';uk='Інший отримувач доходів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаздатчикЗарплаты" Тогда 
				Возврат НСтр("ru='Раздатчик зарплаты';uk='Роздавальник зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сотрудник" Тогда 
				Возврат НСтр("ru='Сотрудник';uk='Співробітник'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СводныеСостоянияЭД" Тогда 
			Если ИмяДляПеревода = "ВсеВыполнено" Тогда 
				Возврат НСтр("ru='Все выполнено';uk='Все виконано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДействийНеТребуется" Тогда 
				Возврат НСтр("ru='Действий не требуется';uk='Дій не вимагається'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отклонен" Тогда 
				Возврат НСтр("ru='Отклонен';uk='Відхилено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПригласитьКОбмену" Тогда 
				Возврат НСтр("ru='Пригласить к обмену';uk='Запросити до обміну'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуютсяДействия" Тогда 
				Возврат НСтр("ru='Требуются действия';uk='Потрібні дії'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СистемыНалогообложения" Тогда 
			Если ИмяДляПеревода = "ЕдиныйНалог" Тогда 
				Возврат НСтр("ru='Единый налог';uk='Єдиний податок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕдиныйНалогИНДС" Тогда 
				Возврат НСтр("ru='Единый налог и НДС';uk='Єдиний податок і ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалогНаПрибыль" Тогда 
				Возврат НСтр("ru='Налог на прибыль';uk='Податок на прибуток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалогНаПрибыльИНДС" Тогда 
				Возврат НСтр("ru='Налог на прибыль и НДС';uk='Податок на прибуток і ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Неплательщик" Тогда 
				Возврат НСтр("ru='Неплательщик';uk='Неплатник'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СкладскиеОперации" Тогда 
			Если ИмяДляПеревода = "ВводОстатков" Тогда 
				Возврат НСтр("ru='Ввод остатков';uk='Введення залишків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратИзПроизводстваНаСклад" Тогда 
				Возврат НСтр("ru='Возврат из производства на склад';uk='Повернення з виробництва на склад'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратНепринятыхТоваров" Тогда 
				Возврат НСтр("ru='Возврат непринятых получателем товаров';uk='Повернення прийнятих одержувачем товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратНепринятыхТоваровУстарел" Тогда 
				Возврат НСтр("ru='Возврат непринятых получателем товаров (не используется)';uk='Повернення неприйнятих отримувачем товарів (не використовується)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыпускПродукцииВПодразделение" Тогда 
				Возврат НСтр("ru='Выпуск продукции в подразделение';uk='Випуск продукції в підрозділ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КонтрольОтгрузки" Тогда 
				Возврат НСтр("ru='Контроль отгрузки';uk='Контроль відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтборИзЯчеек" Тогда 
				Возврат НСтр("ru='Отбор из ячеек';uk='Відбір з комірок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтгрузкаВРозницу" Тогда 
				Возврат НСтр("ru='Отгрузка в розницу';uk='Відвантаження в роздріб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтгрузкаКлиенту" Тогда 
				Возврат НСтр("ru='Отгрузка клиенту';uk='Відвантаження клієнту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтгрузкаКомплектовДляРазборки" Тогда 
				Возврат НСтр("ru='Отгрузка комплектов для разборки';uk='Відвантаження комплектів для розбирання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтгрузкаКомплектующихДляСборки" Тогда 
				Возврат НСтр("ru='Отгрузка комплектующих для сборки';uk='Відвантаження комплектуючих для збирання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтгрузкаНаВнутренниеНужды" Тогда 
				Возврат НСтр("ru='Отгрузка на внутренние нужды';uk='Відвантаження на внутрішні потреби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтгрузкаПоВозвратуПоставщику" Тогда 
				Возврат НСтр("ru='Отгрузка по возврату поставщику';uk='Відвантаження за поверненням постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтгрузкаПоПеремещению" Тогда 
				Возврат НСтр("ru='Отгрузка по перемещению';uk='Відвантаження за переміщенням'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтгрузкаПоПеремещениюВПроизводстве" Тогда 
				Возврат НСтр("ru='Отгрузка по перемещению в производстве';uk='Відвантаження по переміщенню у виробництві'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеВыходныхИзделийВМаршрутныхЛистах" Тогда 
				Возврат НСтр("ru='Производство';uk='Виробництво'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеИзлишков" Тогда 
				Возврат НСтр("ru='Отражение излишков';uk='Відображення надлишків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеНедостач" Тогда 
				Возврат НСтр("ru='Отражение недостач';uk='Відображення нестач'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеПорчи" Тогда 
				Возврат НСтр("ru='Отражение порчи';uk='Відображення псування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеРезультатовПересчетов" Тогда 
				Возврат НСтр("ru='Отражение результатов пересчетов';uk='Відображення результатів обчислень'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаВПроизводствоОтгрузка" Тогда 
				Возврат НСтр("ru='Передача в производство (отгрузка)';uk='Передача у виробництво (відвантаження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаВПроизводствоПриемка" Тогда 
				Возврат НСтр("ru='Передача в производство (приемка)';uk='Передача у виробництво (приймання)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеремещениеМеждуПомещениями" Тогда 
				Возврат НСтр("ru='Перемещение между помещениями';uk='Переміщення між приміщеннями'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Пересчет" Тогда 
				Возврат НСтр("ru='Пересчет';uk='Перерахунок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриемкаКомплектующихПослеРазборки" Тогда 
				Возврат НСтр("ru='Приемка комплектующих после разборки';uk='Приймання комплектуючих після розбирання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриемкаОтПоставщика" Тогда 
				Возврат НСтр("ru='Приемка от поставщика';uk='Приймання від постачальника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриемкаПоВозвратуОтКлиента" Тогда 
				Возврат НСтр("ru='Приемка по возврату от клиента';uk='Приймання за поверненням від клієнта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриемкаПоПеремещению" Тогда 
				Возврат НСтр("ru='Приемка по перемещению';uk='Приймання за переміщенням'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриемкаПоПеремещениюВПроизводстве" Тогда 
				Возврат НСтр("ru='Приемка по перемещению в производстве';uk='Приймання по переміщенню у виробництві'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриемкаПоПрочемуОприходованию" Тогда 
				Возврат НСтр("ru='Приемка по прочему оприходованию';uk='Приймання за іншим оприбуткуванням'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриемкаПродукцииИзПроизводства" Тогда 
				Возврат НСтр("ru='Приемка продукции из производства';uk='Приймання продукції з виробництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриемкаСобранныхКомплектов" Тогда 
				Возврат НСтр("ru='Приемка собранных комплектов';uk='Приймання зібраних комплектів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазмещениеВЯчейки" Тогда 
				Возврат НСтр("ru='Размещение в ячейки';uk='Розміщення в комірки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходМатериаловПриВыполненииМаршрутныхЛистов" Тогда 
				Возврат НСтр("ru='Потребление при производстве';uk='Споживання при виробництві'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеМатериаловНаЗатраты" Тогда 
				Возврат НСтр("ru='Распределение на затраты';uk='Розподіл на витрати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СлучаиУходаЗаБольнымиДетьми" Тогда 
			Если ИмяДляПеревода = "ПоУходуДо15тиЛетАмбулаторно" Тогда 
				Возврат НСтр("ru='(09) От 7 до 15-ти лет, амбулаторно';uk='(09) Від 7 до 15-ти років, амбулаторно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУходуДо15тиЛетВСтационаре" Тогда 
				Возврат НСтр("ru='(09) От 7 до 15-ти лет, в стационаре';uk='(09) Від 7 до 15-ти років, у стаціонарі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУходуДо15тиЛетПриВИЧ" Тогда 
				Возврат НСтр("ru='(15) До 18-ти лет, ВИЧ-инфицированным, в стационаре (до 2015 года - до 15-ти лет)';uk='(15) До 18-ти років, ВІЛ-інфікованим, у стаціонарі (до 2015 року - до 15-ти років)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУходуДо15тиЛетПриПоствакцинальномОсложненииАмбулаторно" Тогда 
				Возврат НСтр("ru='(14) До 18-ти лет при поствакцинальном осложнении, амбулаторно (до 2015 года - до 15-ти лет)';uk='(14) До 18-ти років при поствакцинальному ускладненні, амбулаторно (до 2015 року - до 15-ти років)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУходуДо15тиЛетПриПоствакцинальномОсложненииВСтационаре" Тогда 
				Возврат НСтр("ru='(14) До 18-ти лет при поствакцинальном осложнении, в стационаре (до 2015 года - до 15-ти лет)';uk='(14) До 18-ти років при поствакцинальному ускладненні, у стаціонарі (до 2015 року - до 15-ти років)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУходуДо7миЛетАмбулаторно" Тогда 
				Возврат НСтр("ru='(09) До 7-ми лет, амбулаторно';uk='(09) До 7-ми років, амбулаторно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУходуДо7миЛетВСтационаре" Тогда 
				Возврат НСтр("ru='(09) До 7-ми лет, в стационаре';uk='(09) До 7-ми років, в стаціонарі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУходуДо7миЛетПриОсобомЗаболеванииАмбулаторно" Тогда 
				Возврат НСтр("ru='(12) До 7-ми лет, амбулаторно, заболевание включено в Перечень';uk='(12) До 7-ми років, амбулаторно, захворювання включено до Переліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУходуДо7миЛетПриОсобомЗаболеванииВСтационаре" Тогда 
				Возврат НСтр("ru='(12) До 7-ми лет, в стационаре, при заболевании, включенном в Перечень';uk='(12) До 7-ми років, в стаціонарі, при захворюванні, включеному до Переліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУходуЗаРебенкомИнвалидомАмбулаторно" Тогда 
				Возврат НСтр("ru='(13) Инвалидом до 18-ти лет, амбулаторно (до 2015 года - до 15-ти лет)';uk='(13) Інвалідом до 18-ти років, амбулаторно (до 2015 року - до 15-ти років)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУходуЗаРебенкомИнвалидомВСтационаре" Тогда 
				Возврат НСтр("ru='(13) Инвалидом до 18-ти лет, в стационаре (до 2015 года - до 15-ти лет)';uk='(13) Інвалідом до 18-ти років, у стаціонарі (до 2015 року - до 15-ти років)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СообщенияДляРегОтчетов" Тогда 
			Если ИмяДляПеревода = "СдачаОтчета" Тогда 
				Возврат НСтр("ru='Сдача отчета';uk='Здача звіту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УплатаНалога" Тогда 
				Возврат НСтр("ru='Уплата налога';uk='Сплата податку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостояниеЗачисленияЗарплаты" Тогда 
			Если ИмяДляПеревода = "ГотовКВыгрузке" Тогда 
				Возврат НСтр("ru='Готов к выгрузке';uk='Готовий до вивантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗачисленоПолностью" Тогда 
				Возврат НСтр("ru='Зачислено полностью';uk='Зараховано повністю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗачисленоСОшибками" Тогда 
				Возврат НСтр("ru='Зачислено с ошибками (частично)';uk='Зараховано з помилками (частково)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеЗачислено" Тогда 
				Возврат НСтр("ru='Не зачислено (все строки - ошибки)';uk='Не зараховано (усі рядки - помилки)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетПодтверждения" Тогда 
				Возврат НСтр("ru='Выгружен в банк';uk='Вивантажено в банк'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостояниеЗаявкиНаОткрытиеЛицевогоСчетаСотрудника" Тогда 
			Если ИмяДляПеревода = "ГотовКВыгрузке" Тогда 
				Возврат НСтр("ru='Готов к выгрузке';uk='Готовий до вивантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаявкаНеЗаполнена" Тогда 
				Возврат НСтр("ru='Заявка не заполнена';uk='Заявка не заповнено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЛицевойСчетНеОткрыт" Тогда 
				Возврат НСтр("ru='Лицевой счет не открыт';uk='Особовий рахунок не відкрито'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЛицевыеСчетаНеОткрыты" Тогда 
				Возврат НСтр("ru='Лицевые счета не открыты (все строки - ошибки)';uk='Особові рахунки відкриті (усі рядки - помилки)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЛицевыеСчетаОткрыты" Тогда 
				Возврат НСтр("ru='Лицевые счета открыты';uk='Особові рахунки відкриті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЛицевыеСчетаОткрытыСОшибками" Тогда 
				Возврат НСтр("ru='Лицевые счета открыты (частично)';uk='Особові рахунки відкриті (частково)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетПодтверждения" Тогда 
				Возврат НСтр("ru='Выгружен в банк';uk='Вивантажено в банк'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтложеноОткрытиеЛицевогоСчета" Тогда 
				Возврат НСтр("ru='Отложено открытие лицевого счета';uk='Відкладено відкриття особового рахунку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияБизнесПроцессов" Тогда 
			Если ИмяДляПеревода = "Активен" Тогда 
				Возврат НСтр("ru='Активен';uk='Активний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Остановлен" Тогда 
				Возврат НСтр("ru='Остановлен';uk='Зупинений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияВерсийЭД" Тогда 
			Если ИмяДляПеревода = "Аннулирован" Тогда 
				Возврат НСтр("ru='Аннулирован';uk='Анульовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗакрытПринудительно" Тогда 
				Возврат НСтр("ru='Закрыт принудительно';uk='Закритий примусово'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзвещениеНаПодписи" Тогда 
				Возврат НСтр("ru='Требуется подписание извещения';uk='Потрібно підписання повідомлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаПодписи" Тогда 
				Возврат НСтр("ru='Требуется подписание';uk='Потрібно підписання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаУтверждении" Тогда 
				Возврат НСтр("ru='Требуется утверждение';uk='Затвердження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеПолучен" Тогда 
				Возврат НСтр("ru='Не получен';uk='Не отримано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСформирован" Тогда 
				Возврат НСтр("ru='Не начат';uk='Не розпочато'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбменЗавершен" Тогда 
				Возврат НСтр("ru='Завершен';uk='Завершений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбменЗавершенСИсправлением" Тогда 
				Возврат НСтр("ru='Завершен с исправлением';uk='Завершено з виправленням'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяАннулирование" Тогда 
				Возврат НСтр("ru='Ожидается аннулирование';uk='Очікується анулювання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяИзвещениеОПолучении" Тогда 
				Возврат НСтр("ru='Ожидается извещение о получении';uk='Очікується повідомлення про одержання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяКорректировка" Тогда 
				Возврат НСтр("ru='Ожидается корректировка';uk='Очікується коригування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяОтправка" Тогда 
				Возврат НСтр("ru='Требуется отправка';uk='Потрібно відправлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяОтправкаИзвещения" Тогда 
				Возврат НСтр("ru='Ожидается отправка извещения';uk='Очікується відправлення повідомлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяОтправкаПолучателю" Тогда 
				Возврат НСтр("ru='Ожидается подтверждение отправки';uk='Очікується підтвердження відправлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяПередачаОператору" Тогда 
				Возврат НСтр("ru='Ожидается передача оператору';uk='Очікується передача оператору'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяПодтверждение" Тогда 
				Возврат НСтр("ru='Ожидается подтверждение';uk='Очікується підтвердження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяПодтверждениеОператора" Тогда 
				Возврат НСтр("ru='Ожидается подтверждение оператора';uk='Очікується підтвердження оператора'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отклонен" Тогда 
				Возврат НСтр("ru='Закрыт с отклонением';uk='Закритий з відхиленням'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаПередачи" Тогда 
				Возврат НСтр("ru='Требуется исправление';uk='Потрібно виправлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуетсяАннулировать" Тогда 
				Возврат НСтр("ru='Требуется аннулирование';uk='Потрібно анулювання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуетсяУточнитьДокумент" Тогда 
				Возврат НСтр("ru='Требуется уточнение';uk='Потрібне уточнення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьОжидаетсяВыписка" Тогда 
				Возврат НСтр("ru='(не используется) Ожидается выписка';uk='(не використовується) Очікується виписка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьОжидаетсяИзвещение" Тогда 
				Возврат НСтр("ru='(не используется) Ожидается извещение';uk='(не використовується) Очікується повідомлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьОжидаетсяИсполнение" Тогда 
				Возврат НСтр("ru='(не используется) Ожидается исполнение';uk='(не використовується) Очікується виконання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьОжидаетсяОтзыв" Тогда 
				Возврат НСтр("ru='(не используется) Ожидается отзыв';uk='(не використовується) Очікується відгук'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьПлатежИсполнен" Тогда 
				Возврат НСтр("ru='(не используется) Платеж исполнен';uk='(не використовується) Платіж виконано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьТребуетсяПодтверждение" Тогда 
				Возврат НСтр("ru='(не используется) Требуется подтверждение';uk='(не використовується) Потрібне підтвердження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияВидовКартЛояльности" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяСогласование" Тогда 
				Возврат НСтр("ru='Ожидается согласование';uk='Очікується погодження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияВнутреннихЗаказов" Тогда 
			Если ИмяДляПеревода = "ВПроцессеОтгрузки" Тогда 
				Возврат НСтр("ru='В процессе отгрузки';uk='У процесі відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВПроцессеПоступления" Тогда 
				Возврат НСтр("ru='В процессе поступления';uk='В процесі надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВПроцессеСборки" Тогда 
				Возврат НСтр("ru='В процессе сборки (разборки)';uk='У процесі збирання (розбирання)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотовКЗакрытию" Тогда 
				Возврат НСтр("ru='Готов к закрытию';uk='Готовий до закриття'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотовКОбеспечению" Тогда 
				Возврат НСтр("ru='Готов к обеспечению';uk='Готовий до забезпечення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотовКОтгрузке" Тогда 
				Возврат НСтр("ru='Готов к отгрузке';uk='Готовий до відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотовКСборке" Тогда 
				Возврат НСтр("ru='Готов к сборке (разборке)';uk='Готовий до збирання (розбирання)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяОбеспечение" Тогда 
				Возврат НСтр("ru='Ожидается обеспечение';uk='Очікується забезпечення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияВыполненияОпераций" Тогда 
			Если ИмяДляПеревода = "Выполняется" Тогда 
				Возврат НСтр("ru='Выполняется';uk='Виконується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Завершена" Тогда 
				Возврат НСтр("ru='Завершена';uk='Завершена'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МожноВыполнять" Тогда 
				Возврат НСтр("ru='Можно выполнять';uk='Можна виконувати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачатаПредшествующая" Тогда 
				Возврат НСтр("ru='Начата предшествующая';uk='Розпочата попередня'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжиданиеПредшествующих" Тогда 
				Возврат НСтр("ru='Ожидание предшествующих';uk='Очікування попередніх'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияГосударственныхКонтрактов" Тогда 
			Если ИмяДляПеревода = "Выполняется" Тогда 
				Возврат НСтр("ru='Выполняется';uk='Виконується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Готовится" Тогда 
				Возврат НСтр("ru='Готовится';uk='Готується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Завершен" Тогда 
				Возврат НСтр("ru='Завершен';uk='Завершений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияДоговоровКонтрагентов" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяСогласование" Тогда 
				Возврат НСтр("ru='Ожидается согласование';uk='Очікується погодження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияДокументаСообщениеSMS" Тогда 
			Если ИмяДляПеревода = "Доставлено" Тогда 
				Возврат НСтр("ru='Доставлено';uk='Доставлене'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Доставляется" Тогда 
				Возврат НСтр("ru='Доставляется';uk='Доставляється'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Исходящее" Тогда 
				Возврат НСтр("ru='Исходящее';uk='Вихідне'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеДоставлено" Тогда 
				Возврат НСтр("ru='Не доставлено';uk='Не доставлено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧастичноДоставлено" Тогда 
				Возврат НСтр("ru='Частично доставлено';uk='Частково доставлено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Черновик" Тогда 
				Возврат НСтр("ru='Черновик';uk='Чернетка'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияДоставки" Тогда 
			Если ИмяДляПеревода = "ПолностьюВДоставке" Тогда 
				Возврат НСтр("ru='Полностью в доставке';uk='Повністю в доставці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуетсяДоставка" Тогда 
				Возврат НСтр("ru='Требуется доставка';uk='Потрібна доставка'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияЗаданий" Тогда 
			Если ИмяДляПеревода = "Выполняется" Тогда 
				Возврат НСтр("ru='Выполняется';uk='Виконується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Завершено" Тогда 
				Возврат НСтр("ru='Завершено';uk='Завершено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Запланировано" Тогда 
				Возврат НСтр("ru='Запланировано';uk='Заплановано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеАктивно" Тогда 
				Возврат НСтр("ru='Не активно';uk='Не активно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеЗапланировано" Тогда 
				Возврат НСтр("ru='Не запланировано';uk='Не заплановано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбработкаОшибкиПриАварийномЗавершении" Тогда 
				Возврат НСтр("ru='Обработка ошибки при аварийном завершении';uk='Обробка помилки при аварійному завершенні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаВыполнения" Тогда 
				Возврат НСтр("ru='Ошибка выполнения';uk='Помилка виконання'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияЗаказовКлиентов" Тогда 
			Если ИмяДляПеревода = "ВПроцессеОтгрузки" Тогда 
				Возврат НСтр("ru='В процессе отгрузки';uk='У процесі відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотовКЗакрытию" Тогда 
				Возврат НСтр("ru='Готов к закрытию';uk='Готовий до закриття'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотовКОбеспечению" Тогда 
				Возврат НСтр("ru='Готов к обеспечению';uk='Готовий до забезпечення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотовКОтгрузке" Тогда 
				Возврат НСтр("ru='Готов к отгрузке';uk='Готовий до відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяАвансДоОбеспечения" Тогда 
				Возврат НСтр("ru='Ожидается аванс (до обеспечения)';uk='Очікується аванс (до забезпечення)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяОбеспечение" Тогда 
				Возврат НСтр("ru='Ожидается обеспечение';uk='Очікується забезпечення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяОплатаПослеОтгрузки" Тогда 
				Возврат НСтр("ru='Ожидается оплата (после отгрузки)';uk='Очікується оплата (після відвантаження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяПредоплатаДоОтгрузки" Тогда 
				Возврат НСтр("ru='Ожидается предоплата (до отгрузки)';uk='Очікується передплата (до відвантаження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяСогласование" Тогда 
				Возврат НСтр("ru='Ожидается согласование';uk='Очікується погодження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияЗаказовПереработчикам" Тогда 
			Если ИмяДляПеревода = "ГотоваКОбеспечению" Тогда 
				Возврат НСтр("ru='Готова к обеспечению';uk='Готова до забезпечення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотоваКОтгрузке" Тогда 
				Возврат НСтр("ru='Готова к отгрузке';uk='Готова до відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотовКЗакрытию" Тогда 
				Возврат НСтр("ru='Готов к закрытию';uk='Готовий до закриття'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотовКПоступлению" Тогда 
				Возврат НСтр("ru='Готов к поступлению';uk='Готовий до надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяАвансДоПодтверждения" Тогда 
				Возврат НСтр("ru='Ожидается аванс (до подтверждения)';uk='Очікується аванс (до підтвердження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяОплатаПослеПоступления" Тогда 
				Возврат НСтр("ru='Ожидается оплата (после поступления)';uk='Очікується оплата (після надходження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяОтгрузка" Тогда 
				Возврат НСтр("ru='Ожидается отгрузка';uk='Очікується відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяПодтверждение" Тогда 
				Возврат НСтр("ru='Ожидается подтверждение';uk='Очікується підтвердження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяПоступление" Тогда 
				Возврат НСтр("ru='Ожидается поступление';uk='Очікується надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяПредоплатаДоПоступления" Тогда 
				Возврат НСтр("ru='Ожидается предоплата (до поступления)';uk='Очікується передплата (до надходження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяСогласование" Тогда 
				Возврат НСтр("ru='Ожидается согласование';uk='Очікується погодження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияЗаказовПоставщикам" Тогда 
			Если ИмяДляПеревода = "ГотовКЗакрытию" Тогда 
				Возврат НСтр("ru='Готов к закрытию';uk='Готовий до закриття'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотовКПоступлению" Тогда 
				Возврат НСтр("ru='Готов к поступлению';uk='Готовий до надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяАвансДоПодтверждения" Тогда 
				Возврат НСтр("ru='Ожидается аванс (до подтверждения)';uk='Очікується аванс (до підтвердження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяОплатаПослеПоступления" Тогда 
				Возврат НСтр("ru='Ожидается оплата (после поступления)';uk='Очікується оплата (після надходження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяПодтверждение" Тогда 
				Возврат НСтр("ru='Ожидается подтверждение';uk='Очікується підтвердження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяПоступление" Тогда 
				Возврат НСтр("ru='Ожидается поступление';uk='Очікується надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяПредоплатаДоПоступления" Тогда 
				Возврат НСтр("ru='Ожидается предоплата (до поступления)';uk='Очікується передплата (до надходження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяСогласование" Тогда 
				Возврат НСтр("ru='Ожидается согласование';uk='Очікується погодження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияЗаполненияМногооборотнойТары" Тогда 
			Если ИмяДляПеревода = "Заполнена" Тогда 
				Возврат НСтр("ru='Заполнена';uk='Заповнена'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеПредлагатьЗаполнить" Тогда 
				Возврат НСтр("ru='Не предлагать заполнить';uk='Не пропонувати заповнити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредлагатьЗаполнить" Тогда 
				Возврат НСтр("ru='Предлагать заполнить';uk='Пропонувати заповнити'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияЗапросовНаИспользованиеВнешнихРесурсов" Тогда 
			Если ИмяДляПеревода = "Новый" Тогда 
				Возврат НСтр("ru='Новый';uk='Новий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Применен" Тогда 
				Возврат НСтр("ru='Применен';uk='Застосований'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Проверен" Тогда 
				Возврат НСтр("ru='Проверен';uk='Перевірений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияЗаявленияНаВыпускСертификата" Тогда 
			Если ИмяДляПеревода = "Исполнено" Тогда 
				Возврат НСтр("ru='Исполнено';uk='Виконано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсполненоСертификатНеУстановлен" Тогда 
				Возврат НСтр("ru='Исполнено, сертификат не установлен';uk='Виконано, сертифікат не встановлено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеПодготовлено" Тогда 
				Возврат НСтр("ru='Не подготовлено';uk='Не підготовлено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отклонено" Тогда 
				Возврат НСтр("ru='Отклонено';uk='Відхилено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отправлено" Тогда 
				Возврат НСтр("ru='Отправлено';uk='Відправлене'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подготовлено" Тогда 
				Возврат НСтр("ru='Подготовлено';uk='Підготовлено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияЗаявокНаВозвратТоваровОтКлиентов" Тогда 
			Если ИмяДляПеревода = "ВПроцессеОтгрузки" Тогда 
				Возврат НСтр("ru='В процессе отгрузки';uk='У процесі відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Выполнена" Тогда 
				Возврат НСтр("ru='Выполнена';uk='Виконано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотоваКВозврату" Тогда 
				Возврат НСтр("ru='Готова к возврату';uk='Готова до повернення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотоваКОбеспечению" Тогда 
				Возврат НСтр("ru='Готова к обеспечению';uk='Готова до забезпечення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотоваКОтгрузке" Тогда 
				Возврат НСтр("ru='Готова к отгрузке';uk='Готова до відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяАвансИлиВозвратДоОбеспечения" Тогда 
				Возврат НСтр("ru='Ожидается аванс или возврат (до обеспечения)';uk='Очікується аванс або повернення (до забезпечення)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяВыполнение" Тогда 
				Возврат НСтр("ru='Ожидается выполнение';uk='Очікується виконання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяОбеспечение" Тогда 
				Возврат НСтр("ru='Ожидается обеспечение';uk='Очікується забезпечення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяОплатаИлиВозвратПослеОтгрузки" Тогда 
				Возврат НСтр("ru='Ожидается оплата или возврат (после отгрузки)';uk='Очікується оплата або повернення (після відвантаження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяПредоплатаИлиВозвратДоОтгрузки" Тогда 
				Возврат НСтр("ru='Ожидается предоплата или возврат (до отгрузки)';uk='Очікується передплата або повернення (до відвантаження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяСогласование" Тогда 
				Возврат НСтр("ru='Ожидается согласование';uk='Очікується погодження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отклонена" Тогда 
				Возврат НСтр("ru='Отклонена';uk='Відхилено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияКартЛояльности" Тогда 
			Если ИмяДляПеревода = "Аннулирована" Тогда 
				Возврат НСтр("ru='Аннулирована';uk='Анульовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияКоммерческихПредложенийКлиентам" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяСогласование" Тогда 
				Возврат НСтр("ru='Ожидается согласование';uk='Очікується погодження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отменено" Тогда 
				Возврат НСтр("ru='Отменено';uk='Скасовано'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияКонтрагентаБЭД" Тогда 
			Если ИмяДляПеревода = "НастроенЭДО" Тогда 
				Возврат НСтр("ru='Настроен ЭДО';uk='Налаштовано ЕДО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеПодключен" Тогда 
				Возврат НСтр("ru='Не подключен';uk='Не підключений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подключен" Тогда 
				Возврат НСтр("ru='Подключен';uk='Підключений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияНаличия" Тогда 
			Если ИмяДляПеревода = "Любое" Тогда 
				Возврат НСтр("ru='Любое';uk='Будь-яке'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НетВНаличии" Тогда 
				Возврат НСтр("ru='Нет в наличии';uk='Немає в наявності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолностьюВНаличии" Тогда 
				Возврат НСтр("ru='Полностью в наличии';uk='Повністю в наявності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолностьюИлиЧастичноВНаличии" Тогда 
				Возврат НСтр("ru='Полностью или частично в наличии';uk='Повністю або частково в наявності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧастичноВНаличии" Тогда 
				Возврат НСтр("ru='Частично в наличии';uk='Частково у наявності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧастичноИлиНетВНаличии" Тогда 
				Возврат НСтр("ru='Частично или нет в наличии';uk='Частково чи немає у наявності'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияОбеспеченияЗаказа" Тогда 
			Если ИмяДляПеревода = "ПолностьюОбеспечен" Тогда 
				Возврат НСтр("ru='Полностью обеспечен';uk='Повністю забезпечений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧастичноОбеспечен" Тогда 
				Возврат НСтр("ru='Частично обеспечен';uk='Частково забезпечений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияОперацийЗакрытияМесяца" Тогда 
			Если ИмяДляПеревода = "ВыполненоСОшибками" Тогда 
				Возврат НСтр("ru='Выполнено с ошибками';uk='Виконано з помилками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыполненоУспешно" Тогда 
				Возврат НСтр("ru='Выполнено успешно';uk='Виконано успішно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВыполнено" Тогда 
				Возврат НСтр("ru='Не выполнено';uk='Не виконано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Неопределено" Тогда 
				Возврат НСтр("ru='Неопределено';uk='Невизначено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеТребуется" Тогда 
				Возврат НСтр("ru='Не требуется';uk='Не потрібно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетВыполненияПредыдущихОпераций" Тогда 
				Возврат НСтр("ru='Ожидает выполнения предыдущих операций';uk='Очікує виконання попередніх операцій'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияОС" Тогда 
			Если ИмяДляПеревода = "НеПринятоКУчету" Тогда 
				Возврат НСтр("ru='Не принято к учету';uk='Не прийнято до обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПринятоКЗабалансовомуУчету" Тогда 
				Возврат НСтр("ru='Принято к забалансовому учету';uk='Прийнято до позабалансового обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПринятоКУчету" Тогда 
				Возврат НСтр("ru='Принято к учету';uk='Прийнято до обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СнятоСУчета" Тогда 
				Возврат НСтр("ru='Снято с учета';uk='Знято з обліку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияПересчетовЯчеек" Тогда 
			Если ИмяДляПеревода = "ПересчетВыполнен" Тогда 
				Возврат НСтр("ru='Пересчет выполнен';uk='Перерахунок виконано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуетсяПересчет" Тогда 
				Возврат НСтр("ru='Требуется пересчет';uk='Потрібен перерахунок'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияРасписанияРабочихЦентров" Тогда 
			Если ИмяДляПеревода = "НеАктуально" Тогда 
				Возврат НСтр("ru='Не актуально';uk='Не актуально'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Некорректное" Тогда 
				Возврат НСтр("ru='Некорректное';uk='Некоректне'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСформировано" Тогда 
				Возврат НСтр("ru='Не сформировано';uk='Не сформовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеТребуется" Тогда 
				Возврат НСтр("ru='Не требуется';uk='Не потрібно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сформировано" Тогда 
				Возврат НСтр("ru='Сформировано';uk='Сформовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СформированоПолностью" Тогда 
				Возврат НСтр("ru='Сформировано полностью';uk='Сформовано повністю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СформированоЧастично" Тогда 
				Возврат НСтр("ru='Сформировано частично';uk='Сформовано частково'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияРаспоряженийНаОтборТоваров" Тогда 
			Если ИмяДляПеревода = "ВПроцессеИсполнения" Тогда 
				Возврат НСтр("ru='В процессе исполнения';uk='В процесі виконання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыполняетсяРазмещениеПодпитка" Тогда 
				Возврат НСтр("ru='Выполняется размещение или подпитка';uk='Виконується розміщення або підживлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГотовоКПроверке" Тогда 
				Возврат НСтр("ru='Готово к проверке (отгрузке)';uk='Готово до перевірки (відвантаження)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсполненоСОшибками" Тогда 
				Возврат НСтр("ru='Исполнено с ошибками (недобор)';uk='Виконано з помилками (недобір)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КФормированиюЗаданий" Тогда 
				Возврат НСтр("ru='К формированию заданий';uk='До формування завдань'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяРазмещение" Тогда 
				Возврат НСтр("ru='Ожидается размещение';uk='Очікується розміщення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуетсяПодпитка" Тогда 
				Возврат НСтр("ru='Требуется подпитка';uk='Потрібне підживлення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияРаспоряженийНаПроведениеИнвентаризацийТоваров" Тогда 
			Если ИмяДляПеревода = "ВПроцессеОформленияАктов" Тогда 
				Возврат НСтр("ru='В процессе оформления актов';uk='У процесі оформлення актів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВПроцессеОформленияОрдеров" Тогда 
				Возврат НСтр("ru='В процессе оформления ордеров';uk='У процесі оформлення ордерів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВПроцессеПересчета" Тогда 
				Возврат НСтр("ru='В процессе пересчета';uk='В процесі перерахунку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Выполнен" Тогда 
				Возврат НСтр("ru='Выполнен';uk='Виконаний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПересчетНеНачался" Тогда 
				Возврат НСтр("ru='Пересчет не начался';uk='Перерахунок не почався'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияРаспределенияРасходов" Тогда 
			Если ИмяДляПеревода = "ГотовоКРаспределениюПоБазе" Тогда 
				Возврат НСтр("ru='Готово к распределению';uk='Готове до розподілу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаРаспределения" Тогда 
				Возврат НСтр("ru='Ошибка распределения';uk='Помилка розподілу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Распределено" Тогда 
				Возврат НСтр("ru='Распределено';uk='Розподілено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуетсяНастройкаРаспределения" Тогда 
				Возврат НСтр("ru='Требуется настройка распределения';uk='Потрібна настройка розподілу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияСогласования" Тогда 
			Если ИмяДляПеревода = "Отклонено" Тогда 
				Возврат НСтр("ru='Отклонено';uk='Відхилено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Рассматривается" Тогда 
				Возврат НСтр("ru='Рассматривается';uk='Розглядається'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Согласовано" Тогда 
				Возврат НСтр("ru='Согласовано';uk='Погоджено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияСогласованияВДокументообороте" Тогда 
			Если ИмяДляПеревода = "НаСогласовании" Тогда 
				Возврат НСтр("ru='На согласовании';uk='На погодженні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласован" Тогда 
				Возврат НСтр("ru='Не согласован';uk='Не погоджено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Согласован" Тогда 
				Возврат НСтр("ru='Согласован';uk='Погоджений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияСоглашенийСКлиентами" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыто" Тогда 
				Возврат НСтр("ru='Закрыто';uk='Закрито'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяСогласование" Тогда 
				Возврат НСтр("ru='Ожидается согласование';uk='Очікується погодження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияСоглашенийСПоставщиками" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыто" Тогда 
				Возврат НСтр("ru='Закрыто';uk='Закрито'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяСогласование" Тогда 
				Возврат НСтр("ru='Ожидается согласование';uk='Очікується погодження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияСоглашенийЭД" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыто" Тогда 
				Возврат НСтр("ru='Действие прекращено';uk='Дію припинено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаЮридическомСогласовании" Тогда 
				Возврат НСтр("ru='На юридическом согласовании';uk='На юридичному погодження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяСогласование" Тогда 
				Возврат НСтр("ru='Ожидается согласование';uk='Очікується погодження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроверкаТехническойСовместимости" Тогда 
				Возврат НСтр("ru='Проверка технической совместимости';uk='Перевірка технічної сумісності'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияСообщенияSMS" Тогда 
			Если ИмяДляПеревода = "Доставлено" Тогда 
				Возврат НСтр("ru='Доставлено';uk='Доставлене'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Исходящее" Тогда 
				Возврат НСтр("ru='Исходящее';uk='Вихідне'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеДоставлено" Тогда 
				Возврат НСтр("ru='Не доставлено';uk='Не доставлено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеОпознаноПровайдером" Тогда 
				Возврат НСтр("ru='Не опознано провайдером';uk='Не розпізнано провайдером'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеОтправленоПровайдером" Тогда 
				Возврат НСтр("ru='Не отправлено провайдером';uk='Не відправлено провайдером'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеУдалосьПередатьПровайдеру" Тогда 
				Возврат НСтр("ru='Не удалось передать провайдеру';uk='Не вдалося передати провайдера'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтправленоПровайдером" Тогда 
				Возврат НСтр("ru='Отправлено провайдером';uk='Відправлено провайдером'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтправляетсяПровайдером" Тогда 
				Возврат НСтр("ru='Отправляется провайдером';uk='Відправляється провайдером'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаПолученияСтатусаУПровайдера" Тогда 
				Возврат НСтр("ru='Ошибка получения статуса у провайдера';uk='Помилка отримання статусу у провайдера'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Черновик" Тогда 
				Возврат НСтр("ru='Черновик';uk='Чернетка'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияСотрудника" Тогда 
			Если ИмяДляПеревода = "Болезнь" Тогда 
				Возврат НСтр("ru='Болезнь';uk='Хвороба'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "БолезньБезОплаты" Тогда 
				Возврат НСтр("ru='Болезнь без оплаты';uk='Хвороба без оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВынужденныйПрогул" Тогда 
				Возврат НСтр("ru='Вынужденный прогул';uk='Вимушений прогул'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыполнениеГосударственныхОбязанностей" Тогда 
				Возврат НСтр("ru='Выполнение государственных обязанностей';uk='Виконання державних обов'язків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДополнительныеВыходныеДниНеОплачиваемые" Тогда 
				Возврат НСтр("ru='Дополнительные выходные дни не оплачиваемые';uk='Додаткові вихідні дні, що не оплачуються'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДополнительныеВыходныеДниОплачиваемые" Тогда 
				Возврат НСтр("ru='Дополнительные выходные дни (оплачиваемые)';uk='Додаткові вихідні дні (що оплачуються)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДополнительныйОтпуск" Тогда 
				Возврат НСтр("ru='Дополнительный отпуск';uk='Додаткова відпустка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДополнительныйОтпускНеоплачиваемый" Тогда 
				Возврат НСтр("ru='Дополнительный отпуск (неоплачиваемый)';uk='Додаткова відпустка (що не оплачується)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Командировка" Тогда 
				Возврат НСтр("ru='Командировка';uk='Відрядження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускНаСанаторноКурортноеЛечение" Тогда 
				Возврат НСтр("ru='Отпуск на санаторно-курортное лечение';uk='Відпустка на санаторно-курортне лікування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускНеоплачиваемыйПоЗаконодательству" Тогда 
				Возврат НСтр("ru='Отпуск неоплачиваемый по законодательству';uk='Неоплачувана відпустку за законодавством'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускНеоплачиваемыйПоРазрешениюРаботодателя" Тогда 
				Возврат НСтр("ru='Отпуск неоплачиваемый по разрешению работодателя';uk='Неоплачувана відпустка з дозволу роботодавця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускОсновной" Тогда 
				Возврат НСтр("ru='Отпуск основной';uk='Основна відпустка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускПоБеременностиИРодам" Тогда 
				Возврат НСтр("ru='Отпуск по беременности и родам';uk='Відпустка у зв'язку з вагітністю та пологами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускПоУходуЗаРебенком" Тогда 
				Возврат НСтр("ru='Отпуск по уходу за ребенком до 3 лет';uk='Відпустка по догляду за дитиною до 3 років'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускПоУходуЗаРебенком6лет" Тогда 
				Возврат НСтр("ru='Отпуск по уходу за ребенком до 6 лет';uk='Відпустка по догляду за дитиною до 6 років'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускУчебныйНеоплачиваемый" Тогда 
				Возврат НСтр("ru='Отпуск учебный неоплачиваемый';uk='Відпустка навчальна неоплачувану'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтпускУчебныйОплачиваемый" Тогда 
				Возврат НСтр("ru='Отпуск учебный оплачиваемый';uk='Відпустка навчальна оплачувана'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтсутствиеПоНевыясненнымПричинам" Тогда 
				Возврат НСтр("ru='Отсутствие по невыясненным причинам';uk='Відсутність з нез'ясованих причин'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтсутствиеССохранениемОплаты" Тогда 
				Возврат НСтр("ru='Отсутствие с сохранением оплаты';uk='Відсутність із збереженням оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прогул" Тогда 
				Возврат НСтр("ru='Прогул';uk='Прогул'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПростойНеЗависящийОтРаботодателяИРаботника" Тогда 
				Возврат НСтр("ru='Простой, не зависящий от работодателя и работника';uk='Простій, не залежний від роботодавця і працівника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПростойПоВинеРаботника" Тогда 
				Возврат НСтр("ru='Простой по вине работника';uk='Простій з вини працівника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПростойПоВинеРаботодателя" Тогда 
				Возврат НСтр("ru='Простой по вине работодателя';uk='Простій з вини роботодавця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Работа" Тогда 
				Возврат НСтр("ru='Работа';uk='Робота'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаботаВОтпускеПоУходуЗаРебенком" Тогда 
				Возврат НСтр("ru='Работа в отпуске по уходу за ребенком';uk='Робота у відпустці по догляду за дитиною'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Увольнение" Тогда 
				Возврат НСтр("ru='Увольнение';uk='Звільнення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Факт" Тогда 
				Возврат НСтр("ru='Факт';uk='Факт'" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "Мобилизация" Тогда 
				Возврат НСтр("ru='Мобилизация';uk='Мобілізація'" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "МобилизацияБезОплаты" Тогда 
				Возврат НСтр("ru='Мобилизация (без оплаты)';uk='Мобілізація (без оплати)'" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "ПриостановкаТрудовогоДоговора" Тогда 
				Возврат НСтр("ru='Приостановка трудового договора';uk='Призупинення трудового договору'" ,КодЯзыка);	
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияСчетовНаОплатуКлиентам" Тогда 
			Если ИмяДляПеревода = "Аннулирован" Тогда 
				Возврат НСтр("ru='Аннулирован';uk='Анульовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Выставлен" Тогда 
				Возврат НСтр("ru='Выставлен';uk='Виставлений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияУстановокЦенНоменклатуры" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяСогласование" Тогда 
				Возврат НСтр("ru='Ожидается согласование';uk='Очікується погодження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияЭтаповГрафикаПроизводства" Тогда 
			Если ИмяДляПеревода = "Выполнен" Тогда 
				Возврат НСтр("ru='Выполнен';uk='Виконаний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Запланирован" Тогда 
				Возврат НСтр("ru='Запланирован';uk='Запланований'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Любое" Тогда 
				Возврат НСтр("ru='Любое';uk='Будь-яке'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаВыполнении" Тогда 
				Возврат НСтр("ru='На выполнении';uk='На виконанні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеЗапланирован" Тогда 
				Возврат НСтр("ru='Не запланирован';uk='Не заплановано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуетсяЗапланировать" Тогда 
				Возврат НСтр("ru='Требуется запланировать';uk='Потрібно запланувати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СоциальныеГруппыНаселения" Тогда 
			Если ИмяДляПеревода = "ДетиДо18" Тогда 
				Возврат НСтр("ru='Дети от 6 до18 лет';uk='Діти від 6 до18 років'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДетиДо6" Тогда 
				Возврат НСтр("ru='Дети до 6 лет';uk='Діти до 6 років'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеТрудоспособные" Тогда 
				Возврат НСтр("ru='Нетрудоспособные';uk='Непрацездатні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Трудоспособные" Тогда 
				Возврат НСтр("ru='Трудоспособные';uk='Працездатні'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыPOP3Аутентификации" Тогда 
			Если ИмяДляПеревода = "APOP" Тогда 
				Возврат НСтр("ru='APOP';uk='APOP'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "CramMD5" Тогда 
				Возврат НСтр("ru='Cram MD5';uk='Cram MD5'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обычная" Тогда 
				Возврат НСтр("ru='Обычная';uk='Звичайна'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыSMTPАутентификации" Тогда 
			Если ИмяДляПеревода = "CramMD5" Тогда 
				Возврат НСтр("ru='Cram MD5';uk='Cram MD5'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Login" Тогда 
				Возврат НСтр("ru='Login';uk='Login'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Plain" Тогда 
				Возврат НСтр("ru='Plain';uk='Plain'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "БезАутентификации" Тогда 
				Возврат НСтр("ru='Без аутентификации';uk='Без аутентифікації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоУмолчанию" Тогда 
				Возврат НСтр("ru='По умолчанию';uk='По умовчанню'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыАвтовыбораНоменклатуры" Тогда 
			Если ИмяДляПеревода = "ЗадаетсяВСвойствеПродукции" Тогда 
				Возврат НСтр("ru='Задается в свойстве продукции';uk='Задається у властивості продукції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УказываетсяВНСИ" Тогда 
				Возврат НСтр("ru='Указывается в НСИ';uk='Вказується в НДІ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УточняетсяПриПроизводстве" Тогда 
				Возврат НСтр("ru='Уточняется при производстве (с учетом свойств продукции)';uk='Уточнюється при виробництві (з урахуванням властивостей продукції)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыАвтовыбораХарактеристики" Тогда 
			Если ИмяДляПеревода = "ПодбираетсяПоСвойствамПродукции" Тогда 
				Возврат НСтр("ru='Автоматически подбирается по свойствам продукции';uk='Автоматично підбирається за властивостями продукції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УказываетсяВНСИ" Тогда 
				Возврат НСтр("ru='Указывается в НСИ';uk='Вказується в НДІ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УточняетсяПриПроизводстве" Тогда 
				Возврат НСтр("ru='Уточняется при производстве (с учетом свойств продукции)';uk='Уточнюється при виробництві (з урахуванням властивостей продукції)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыВводаЗначенийПоказателейРасчетаЗарплаты" Тогда 
			Если ИмяДляПеревода = "ВводитсяЕдиновременно" Тогда 
				Возврат НСтр("ru='Вводится единовременно';uk='Вводиться одноразово'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВводитсяПриРасчете" Тогда 
				Возврат НСтр("ru='Вводится при расчете';uk='Вводиться при розрахунку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НакапливаетсяПоОтдельнымЗначениям" Тогда 
				Возврат НСтр("ru='Накапливается по отдельным значениям';uk='Накопичується за окремими значеннями'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыВыводаОтчета" Тогда 
			Если ИмяДляПеревода = "ПоВертикали" Тогда 
				Возврат НСтр("ru='По вертикали';uk='По вертикалі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоГоризонтали" Тогда 
				Возврат НСтр("ru='По горизонтали';uk='По горизонталі'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыВызоваДополнительныхОбработок" Тогда 
			Если ИмяДляПеревода = "ВызовКлиентскогоМетода" Тогда 
				Возврат НСтр("ru='Вызов клиентского метода';uk='Виклик клієнтського методу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВызовСерверногоМетода" Тогда 
				Возврат НСтр("ru='Вызов серверного метода';uk='Виклик серверного методу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗагрузкаДанныхИзФайла" Тогда 
				Возврат НСтр("ru='Загрузка данных из файла';uk='Завантаження даних з файлу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаполнениеФормы" Тогда 
				Возврат НСтр("ru='Заполнение формы';uk='Заповнення форми'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОткрытиеФормы" Тогда 
				Возврат НСтр("ru='Открытие формы';uk='Відкриття форми'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СценарийВБезопасномРежиме" Тогда 
				Возврат НСтр("ru='Сценарий в безопасном режиме';uk='Сценарій у безпечному режимі'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыВыполненияНачислений" Тогда 
			Если ИмяДляПеревода = "ВЗаданныхМесяцахПриОкончательномРасчете" Тогда 
				Возврат НСтр("ru='В перечисленных месяцах';uk='У перерахованих місяцях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЕжемесячноПриОкончательномРасчете" Тогда 
				Возврат НСтр("ru='Ежемесячно';uk='Щомісяця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаПраздничныеДниПриОкончательномРасчете" Тогда 
				Возврат НСтр("ru='Только если время приходится на праздничные дни';uk='Тільки якщо час припадає на святкові дні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЗначениюВидаВремениПриОкончательномРасчете" Тогда 
				Возврат НСтр("ru='Только если введен вид учета времени';uk='Тільки якщо введений вид обліку часу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЗначениюПоказателяПриОкончательномРасчете" Тогда 
				Возврат НСтр("ru='Только если введено значение показателя';uk='Тільки якщо введено значення показника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоОтдельномуДокументуДоОкончательногоРасчета" Тогда 
				Возврат НСтр("ru='По отдельному документу';uk='За окремим документом'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыВыполненияУдержаний" Тогда 
			Если ИмяДляПеревода = "ЕжемесячноПриОкончательномРасчете" Тогда 
				Возврат НСтр("ru='Ежемесячно';uk='Щомісяця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЗначениюПоказателяПриОкончательномРасчете" Тогда 
				Возврат НСтр("ru='Только если введено значение показателя';uk='Тільки якщо введено значення показника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоОтдельномуДокументуДоОкончательногоРасчета" Тогда 
				Возврат НСтр("ru='По отдельному документу';uk='За окремим документом'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыДоставки" Тогда 
			Если ИмяДляПеревода = "ДоКлиента" Тогда 
				Возврат НСтр("ru='До клиента';uk='До клієнта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КПолучателюОпределяетСлужбаДоставки" Тогда 
				Возврат НСтр("ru='На усмотрение транспортной службы';uk='На розсуд транспортної служби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НашимиСиламиСАдресаОтправителя" Тогда 
				Возврат НСтр("ru='Нашими силами с адреса отправителя';uk='Нашими силами з адреси відправника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтОтправителяОпределяетСлужбаДоставки" Тогда 
				Возврат НСтр("ru='От отправителя, определяет служба доставки';uk='Від відправника, визначає служба доставки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоручениеЭкспедиторуВПункте" Тогда 
				Возврат НСтр("ru='Поручение экспедитору в пункте';uk='Доручення експедитору в пункті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоручениеЭкспедиторуНаСклад" Тогда 
				Возврат НСтр("ru='Поручение экспедитору на склад';uk='Доручення експедитору на склад'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоручениеЭкспедиторуСоСклада" Тогда 
				Возврат НСтр("ru='Поручение экспедитору со склада';uk='Доручення експедитору зі складу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Самовывоз" Тогда 
				Возврат НСтр("ru='Самовывоз';uk='Самовивіз'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СиламиПеревозчика" Тогда 
				Возврат НСтр("ru='Силами перевозчика';uk='Силами перевізника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СиламиПеревозчикаДоНашегоСклада" Тогда 
				Возврат НСтр("ru='Силами перевозчика до нашего склада';uk='Силами перевізника до нашого складу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СиламиПеревозчикаДоПунктаПередачи" Тогда 
				Возврат НСтр("ru='Силами перевозчика до пункта передачи';uk='Силами перевізника до пункту передачі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СиламиПеревозчикаПоАдресу" Тогда 
				Возврат НСтр("ru='Силами перевозчика по адресу';uk='Силами перевізника за адресою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СиламиПоставщикаДоНашегоСклада" Тогда 
				Возврат НСтр("ru='Силами поставщика до нашего склада';uk='Силами постачальника до нашого складу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыДоставкиКорреспонденцииБанка" Тогда 
			Если ИмяДляПеревода = "Email" Тогда 
				Возврат НСтр("ru='E-mail';uk='E-mail'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеРассылать" Тогда 
				Возврат НСтр("ru='Не рассылать';uk='Не розсилати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Почтой" Тогда 
				Возврат НСтр("ru='Почтой';uk='Поштою'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыЗагрузкиВидаРабочегоЦентра" Тогда 
			Если ИмяДляПеревода = "ЗагружатьРавномерно" Тогда 
				Возврат НСтр("ru='Загружать оборудование равномерно';uk='Завантажувати рівномірно устаткування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МаксимизироватьЗагрузкуЕдиницы" Тогда 
				Возврат НСтр("ru='Максимизировать загрузку единицы оборудования';uk='Максимізувати завантаження одиниці устаткування'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыЗаданияЦен" Тогда 
			Если ИмяДляПеревода = "Вручную" Тогда 
				Возврат НСтр("ru='Ручное назначение';uk='Ручне призначення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаполнятьПоДаннымИБ" Тогда 
				Возврат НСтр("ru='Произвольный запрос к данным ИБ';uk='Довільний запит до даних ІБ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаполнятьПоДаннымИБПриПоступлении" Тогда 
				Возврат НСтр("ru='Заполнять по данным ИБ при поступлении';uk='Заповнювати за даними ІБ при надходженні товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаценкаНаДругойВидЦен" Тогда 
				Возврат НСтр("ru='Наценка на другой вид цен';uk='Націнка на інший вид цін'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаценкаНаЦенуПоступления" Тогда 
				Возврат НСтр("ru='Наценка на цену поступления';uk='Націнка на ціну надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РассчитыватьПоФормуламОтДругихВидовЦен" Тогда 
				Возврат НСтр("ru='Произвольная формула от других видов цен';uk='Довільна формула від інших видів цін'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыЗаполненияГрафикаРаботы" Тогда 
			Если ИмяДляПеревода = "ПоНеделям" Тогда 
				Возврат НСтр("ru='По неделям';uk='По тижнях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЦикламПроизвольнойДлины" Тогда 
				Возврат НСтр("ru='По циклам произвольной длины';uk='За циклами довільної довжини'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыЗаполненияНоменклатурыНалоговыхДокументов" Тогда 
			Если ИмяДляПеревода = "ТоварыПрочее" Тогда 
				Возврат НСтр("ru='Товары прочее';uk='Товари інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварыУслуги" Тогда 
				Возврат НСтр("ru='Товары и услуги';uk='Товари і послуги'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УслугиССдержанием" Тогда 
				Возврат НСтр("ru='Услуги с содержанием';uk='Послуги з вмістом'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыИдентификацииКонтрагентов" Тогда 
			Если ИмяДляПеревода = "ИННКПП" Тогда 
				Возврат НСтр("ru='По коду по ЕДРПОУ, если указан, иначе по наименованию';uk='За кодом ЄДРПОУ, якщо вказано, інакше за назвою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Наименование" Тогда 
				Возврат НСтр("ru='По наименованию';uk='За найменуванням'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыКомпенсацииВозвратовТоваров" Тогда 
			Если ИмяДляПеревода = "ВернутьДенежныеСредства" Тогда 
				Возврат НСтр("ru='Вернуть денежные средства';uk='Повернути грошові кошти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаменитьТовары" Тогда 
				Возврат НСтр("ru='Заменить товары';uk='Замінити товари'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОставитьВКачествеАванса" Тогда 
				Возврат НСтр("ru='Оставить в качестве аванса';uk='Залишити в якості авансу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыКомпенсацииПереработки" Тогда 
			Если ИмяДляПеревода = "Отгул" Тогда 
				Возврат НСтр("ru='Отгул';uk='Відгул'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПовышеннаяОплата" Тогда 
				Возврат НСтр("ru='Повышенная оплата';uk='Підвищена оплата'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыНастройкиПередачиМатериаловВПроизводство" Тогда 
			Если ИмяДляПеревода = "НастраиваетсяИндивидуально" Тогда 
				Возврат НСтр("ru='Настраивается индивидуально';uk='Настроюється індивідуально'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОпределяетсяНастройкойДляНоменклатуры" Тогда 
				Возврат НСтр("ru='Определяется настройкой для номенклатуры в целом';uk='Визначається настройкою для номенклатури в цілому'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОпределяетсяНастройкойДляПодразделения" Тогда 
				Возврат НСтр("ru='Определяется настройкой для подразделения в целом';uk='Визначається настройкою для підрозділу в цілому'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыНачисленияАмортизацииНМА" Тогда 
			Если ИмяДляПеревода = "Кумулятивный" Тогда 
				Возврат НСтр("ru='Кумулятивный (по сумме чисел лет)';uk='Кумулятивний (по сумі чисел років)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Линейный" Тогда 
				Возврат НСтр("ru='Прямолинейный';uk='Прямолінійний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПропорциональноОбъемуПродукции" Тогда 
				Возврат НСтр("ru='Производственный';uk='Виробничий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УменьшаемогоОстатка" Тогда 
				Возврат НСтр("ru='Уменьшения остатка';uk='Зменшення залишку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УскоренногоУменьшенияОстатка" Тогда 
				Возврат НСтр("ru='Ускоренного уменьшения остатка';uk='Прискореного зменшення залишку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыНачисленияАмортизацииОС" Тогда 
			Если ИмяДляПеревода = "_100" Тогда 
				Возврат НСтр("ru='100%';uk='100%'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "_50_50" Тогда 
				Возврат НСтр("ru='50% - 50%';uk='50% - 50%'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Кумулятивный" Тогда 
				Возврат НСтр("ru='Кумулятивный (по сумме чисел лет)';uk='Кумулятивний (по сумі чисел років)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Линейный" Тогда 
				Возврат НСтр("ru='Прямолинейный';uk='Прямолінійний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Налоговый" Тогда 
				Возврат НСтр("ru='Налоговый (с 01.04.2011 не актуален)';uk='Податковий (з 01.04.2011 не актуальний)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоИндивидуальномуГрафику" Тогда 
				Возврат НСтр("ru='По индивидуальному графику амортизации';uk='За індивідуальним графіком амортизації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПропорциональноОбъемуПродукции" Тогда 
				Возврат НСтр("ru='Производственный';uk='Виробничий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УменьшаемогоОстатка" Тогда 
				Возврат НСтр("ru='Уменьшения остатка';uk='Зменшення залишку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УскоренногоУменьшенияОстатка" Тогда 
				Возврат НСтр("ru='Ускоренного уменьшения остатка';uk='Прискореного зменшення залишку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыОбменаЭД" Тогда 
			Если ИмяДляПеревода = "БыстрыйОбмен" Тогда 
				Возврат НСтр("ru='Быстрый обмен';uk='Швидкий обмін'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьЧерезВебРесурсБанка" Тогда 
				Возврат НСтр("ru='Через веб-ресурс банка';uk='Через веб-ресурс банку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧерезFTP" Тогда 
				Возврат НСтр("ru='Через FTP';uk='Через FTP'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧерезКаталог" Тогда 
				Возврат НСтр("ru='Через каталог';uk='Через каталог'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧерезСервис1СЭДО" Тогда 
				Возврат НСтр("ru='Через сервис 1С-ЭДО';uk='Через сервіс 1С-ЕДО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧерезЭлектроннуюПочту" Тогда 
				Возврат НСтр("ru='Через электронную почту';uk='Через електронну пошту'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыОплатыПоДоговоруГПХ" Тогда 
			Если ИмяДляПеревода = "ВКонцеСрокаСАвансовымиПлатежами" Тогда 
				Возврат НСтр("ru='В конце срока с ежемесячными авансовыми платежами';uk='В кінці терміну з щомісячними авансовими платежами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОднократноВКонцеСрока" Тогда 
				Возврат НСтр("ru='Однократно в конце срока';uk='Однократно наприкінці  строку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоАктамВыполненныхРабот" Тогда 
				Возврат НСтр("ru='По актам выполненных работ';uk='За актами виконаних робіт'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыОпределенияНормыСуммированногоУчета" Тогда 
			Если ИмяДляПеревода = "ПоДаннымДругогоГрафика" Тогда 
				Возврат НСтр("ru='По данным другого графика';uk='За даними іншого графіка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоДаннымЭтогоГрафика" Тогда 
				Возврат НСтр("ru='По данным этого графика';uk='За даними цього графіка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПроизводственномуКалендарю" Тогда 
				Возврат НСтр("ru='По производственному календарю';uk='За виробничим календарем'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыОткрытияФайлаНаПросмотр" Тогда 
			Если ИмяДляПеревода = "ВоВстроенномРедакторе" Тогда 
				Возврат НСтр("ru='Во встроенном редакторе';uk='У вбудованому редакторі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтандартнымПриложением" Тогда 
				Возврат НСтр("ru='Стандартным приложением';uk='Стандартною прикладною програмою'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыОтраженияАктовОРасхожденияПослеПоступления" Тогда 
			Если ИмяДляПеревода = "ИсправлениеПервичныхДокументов" Тогда 
				Возврат НСтр("ru='Исправление первичных документов';uk='Виправлення первинних документів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОформлениеКорректировокПоступления" Тогда 
				Возврат НСтр("ru='Оформление корректировок поступления';uk='Оформлення коригувань надходження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента" Тогда 
			Если ИмяДляПеревода = "ИсправлениеПервичныхДокументов" Тогда 
				Возврат НСтр("ru='Исправление первичных документов';uk='Виправлення первинних документів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОформлениеКорректировкиКакИсправлениеПервичныхДокументов" Тогда 
				Возврат НСтр("ru='Оформление корректировки (исправление ошибок)';uk='Оформлення коригування (виправлення помилок)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОформлениеКорректировокКакНовыеПервичныеДокументы" Тогда 
				Возврат НСтр("ru='Оформление корректировок (реализация перепоставленного/возврат недопоставленного товара)';uk='Оформлення коригувань (реалізація перепоставленого/повернення недопоставленого товару)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыОценки" Тогда 
			Если ИмяДляПеревода = "ЛИФО" Тогда 
				Возврат НСтр("ru='ЛИФО';uk='ЛІФО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСредней" Тогда 
				Возврат НСтр("ru='По средней';uk='По середній'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФИФО" Тогда 
				Возврат НСтр("ru='ФИФО';uk='ФІФО'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПередачиТоваров" Тогда 
			Если ИмяДляПеревода = "НеПередается" Тогда 
				Возврат НСтр("ru='Не передается';uk='Не передається'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеТребуется" Тогда 
				Возврат НСтр("ru='Не требуется';uk='Не потрібно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаНаКомиссию" Тогда 
				Возврат НСтр("ru='Передача на комиссию';uk='Передача на комісію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаНаКомиссиюВозврат" Тогда 
				Возврат НСтр("ru='Передача на комиссию и возврат';uk='Передача на комісію та повернення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Продажа" Тогда 
				Возврат НСтр("ru='Продажа';uk='Продаж'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродажаВозврат" Тогда 
				Возврат НСтр("ru='Продажа и возврат';uk='Продаж та повернення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПланированияОплатыЗаявок" Тогда 
			Если ИмяДляПеревода = "ВВалютеВзаиморасчетов" Тогда 
				Возврат НСтр("ru='В валюте взаиморасчетов';uk='У валюті взаєморозрахунків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВВалютеПлатежа" Тогда 
				Возврат НСтр("ru='В валюте платежа';uk='У валюті платежу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПоворотаИзображения" Тогда 
			Если ИмяДляПеревода = "ВлевоНа90" Тогда 
				Возврат НСтр("ru='Влево на 90';uk='Уліво на 90'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВправоНа180" Тогда 
				Возврат НСтр("ru='Вправо на 180';uk='Вправо на 180'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВправоНа90" Тогда 
				Возврат НСтр("ru='Вправо на 90';uk='Вправо на 90'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НетПоворота" Тогда 
				Возврат НСтр("ru='Нет поворота';uk='Немає повороту'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПогашенияЗадолженностиПоВозвратам" Тогда 
			Если ИмяДляПеревода = "ВозвратДенег" Тогда 
				Возврат НСтр("ru='Возврат денег';uk='Повернення грошей'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаменаТоваров" Тогда 
				Возврат НСтр("ru='Замена товаров';uk='Заміна товарів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПогашенияЗаймаСотруднику" Тогда 
			Если ИмяДляПеревода = "ВТечениеСрока" Тогда 
				Возврат НСтр("ru='В течение срока';uk='Протягом строку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоОкончанииСрока" Тогда 
				Возврат НСтр("ru='По окончании срока';uk='По закінченні строку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПогашенияСтоимостиТМЦ" Тогда 
			Если ИмяДляПеревода = "ПоНаработке" Тогда 
				Возврат НСтр("ru='По наработке';uk='По напрацюванню'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоСроку" Тогда 
				Возврат НСтр("ru='По сроку эксплуатации';uk='По строку експлуатації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриПередаче" Тогда 
				Возврат НСтр("ru='При передаче в эксплуатацию';uk='При передачі в експлуатацію'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПолучениеМатериаловЭтапаПроизводства" Тогда 
			Если ИмяДляПеревода = "ЗаказатьНаСклад" Тогда 
				Возврат НСтр("ru='Заказать на склад';uk='Замовити на склад'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзПодразделения" Тогда 
				Возврат НСтр("ru='Из запаса подразделения';uk='Із запасу підрозділу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизвестиНаЭтапе" Тогда 
				Возврат НСтр("ru='Производится на этапе';uk='Проводиться на етапі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизвестиПоСпецификации" Тогда 
				Возврат НСтр("ru='Произвести по спецификации';uk='Провести по специфікації'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПолученияПолуфабрикатовПроизводимыхВПроцессе" Тогда 
			Если ИмяДляПеревода = "Напрямую" Тогда 
				Возврат НСтр("ru='Напрямую';uk='Напряму'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧерезСклад" Тогда 
				Возврат НСтр("ru='Через склад';uk='Через склад'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПоступленияАктивов" Тогда 
			Если ИмяДляПеревода = "БезвозмездноеПоступление" Тогда 
				Возврат НСтр("ru='Безвозмездное поступление';uk='Безоплатне надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВкладВСовместнуюДеятельность" Тогда 
				Возврат НСтр("ru='Вклад в совместную деятельность';uk='Внесок у спільну діяльність'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВкладВУставныйКапитал" Тогда 
				Возврат НСтр("ru='Вклад в уставный (складочный) капитал';uk='Внесок до статутного (складового) капіталу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВОбменНаДругоеИмущество" Тогда 
				Возврат НСтр("ru='В обмен на другое имущество';uk='В обмін на інше майно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Иное" Тогда 
				Возврат НСтр("ru='Иное';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоДоговоруАренды" Тогда 
				Возврат НСтр("ru='По договору аренды (лизинга)';uk='По договору оренди (лізингу)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеВДоверительноеУправление" Тогда 
				Возврат НСтр("ru='Поступление в доверительное управление';uk='Надходження в довірче управління'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриобретениеЗаПлату" Тогда 
				Возврат НСтр("ru='Приобретение за плату';uk='Придбання за плату'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Строительство" Тогда 
				Возврат НСтр("ru='Строительство (создание)';uk='Будівництво (створення)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПредоставленияЗаймаСотруднику" Тогда 
			Если ИмяДляПеревода = "Единовременно" Тогда 
				Возврат НСтр("ru='Единовременно';uk='Одноразово'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Траншами" Тогда 
				Возврат НСтр("ru='Отдельными траншами';uk='Окремими траншами'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПредоставленияСкидокНаценок" Тогда 
			Если ИмяДляПеревода = "ВидЦены" Тогда 
				Возврат НСтр("ru='Специальная цена';uk='Спеціальна ціна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КартаЛояльности" Тогда 
				Возврат НСтр("ru='Выдача карты лояльности';uk='Видача карти лояльності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Количество" Тогда 
				Возврат НСтр("ru='Скидка количеством';uk='Знижка кількістю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОкруглениеСуммы" Тогда 
				Возврат НСтр("ru='Округление суммы документа';uk='Округлення суми документа'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подарок" Тогда 
				Возврат НСтр("ru='Подарок';uk='Подарунок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Процент" Тогда 
				Возврат НСтр("ru='Скидка (наценка) процентом';uk='Знижка (націнка) відсотком'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сообщение" Тогда 
				Возврат НСтр("ru='Выдача сообщения';uk='Видача повідомлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сумма" Тогда 
				Возврат НСтр("ru='Скидка (наценка) суммой на документ';uk='Знижка (націнка) сумою на документ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаДляКаждойСтроки" Тогда 
				Возврат НСтр("ru='Скидка (наценка) суммой для каждой строки';uk='Знижка (націнка) сумою для кожного рядка'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПривязкиОперацийПроизводства" Тогда 
			Если ИмяДляПеревода = "КНачалу" Тогда 
				Возврат НСтр("ru='К началу';uk='До початку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОкончанию" Тогда 
				Возврат НСтр("ru='К окончанию';uk='До закінчення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПризнанияРасходов" Тогда 
			Если ИмяДляПеревода = "ВОсобомПорядке" Тогда 
				Возврат НСтр("ru='В особом порядке';uk='В особливому порядку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоКалендарнымДням" Тогда 
				Возврат НСтр("ru='По календарным дням';uk='По календарних днях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоМесяцам" Тогда 
				Возврат НСтр("ru='По месяцам';uk='По місяцях'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты" Тогда 
			Если ИмяДляПеревода = "Постоянное" Тогда 
				Возврат НСтр("ru='Во всех месяцах после ввода значения (постоянное использование)';uk='У всіх місяцях після вводу значення (постійне користування)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Разовое" Тогда 
				Возврат НСтр("ru='Только в месяце, в котором вводится значение (разовое использование)';uk='Тільки у місяці, в якому вводиться значення (разове використання)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПримененияЛьготРаботников" Тогда 
			Если ИмяДляПеревода = "НаКаждогоРебенка" Тогда 
				Возврат НСтр("ru='На каждого ребенка';uk='На кожну дитину'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаКаждогоРебенкаИнвалида" Тогда 
				Возврат НСтр("ru='На каждого ребенка-инвалида';uk='На кожну дитину-інваліда'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаТроихДетей" Тогда 
				Возврат НСтр("ru='На троих и больше детей';uk='На трьох і більше дітей'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Основной" Тогда 
				Возврат НСтр("ru='Основной';uk='Основний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыПримененияСкидокНаценок" Тогда 
			Если ИмяДляПеревода = "НачислитьБонусныеБаллы" Тогда 
				Возврат НСтр("ru='Начислить бонусные баллы';uk='Нарахувати бонусні бали'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрименитьВМоментРасчетаСкидокНаценок" Тогда 
				Возврат НСтр("ru='Применить в момент расчета скидок(наценок)';uk='Застосувати в момент розрахунку знижок(націнок)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРаспределенияСтатейРасходов" Тогда 
			Если ИмяДляПеревода = "НаДругиеСтатьиРасходов" Тогда 
				Возврат НСтр("ru='На другие статьи расходов';uk='На інші статті витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПодразделениямВручнуюПоЭтапамПоПравилу" Тогда 
				Возврат НСтр("ru='По подразделениям вручную, по этапам по правилу';uk='По підрозділах вручну, по етапах за правилом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПодразделениямИЭтапамПоПравилам" Тогда 
				Возврат НСтр("ru='По подразделениям и этапам по правилам';uk='По підрозділах і етапах за правилами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПоказателюНаВсеПодразделения" Тогда 
				Возврат НСтр("ru='На все подразделения';uk='На всі підрозділи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПоказателюНаВышестоящееПодразделение" Тогда 
				Возврат НСтр("ru='На вышестоящее подразделение';uk='На підрозділ вищого рівня'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПоказателюНаНижестоящиеПодразделения" Тогда 
				Возврат НСтр("ru='На нижестоящие подразделения';uk='На підпорядковані підрозділи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоПоказателюНаУказанныеПодразделения" Тогда 
				Возврат НСтр("ru='На указанные подразделения';uk='На зазначені підрозділи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЭтапамВручнуюПоВсемПодразделениям" Тогда 
				Возврат НСтр("ru='По этапам вручную (по всем подразделениям)';uk='По етапах вручну (по всіх підрозділах)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЭтапамПоПравилуВДанномПодразделении" Тогда 
				Возврат НСтр("ru='По этапам по правилу (в данном подразделении)';uk='По етапах за правилом (в даному підрозділі)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоЭтапамПоПравилуПоВсемПодразделениям" Тогда 
				Возврат НСтр("ru='По этапам по правилу (по всем подразделениям)';uk='По етапах за правилом (по всіх підрозділах)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаАванса" Тогда 
			Если ИмяДляПеревода = "ПроцентомОтТарифа" Тогда 
				Возврат НСтр("ru='Процентом от тарифа';uk='Відсотком від тарифу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетомЗаПервуюПоловинуМесяца" Тогда 
				Возврат НСтр("ru='Расчетом за первую половину месяца';uk='Розрахунком за першу половину місяця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФиксированнойСуммой" Тогда 
				Возврат НСтр("ru='Фиксированной суммой';uk='Фіксованою сумою'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаВзносов" Тогда 
			Если ИмяДляПеревода = "Взносы" Тогда 
				Возврат НСтр("ru='Взносы';uk='Внески'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВзносыФОТ" Тогда 
				Возврат НСтр("ru='Взносы ФОТ';uk='Внески ФОП'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаДоплатыЗаСовмещение" Тогда 
			Если ИмяДляПеревода = "ПроцентФОТ" Тогда 
				Возврат НСтр("ru='Процент ФОТ';uk='Відсоток ФОП'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазницаФОТ" Тогда 
				Возврат НСтр("ru='Разница ФОТ';uk='Різниця ФОП'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаЗатратПлановойКалькуляции" Тогда 
			Если ИмяДляПеревода = "ПоДетальнымЗаписям" Тогда 
				Возврат НСтр("ru='По детальным записям';uk='По детальних записах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоФормуле" Тогда 
				Возврат НСтр("ru='По формуле';uk='По формулі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФиксированнымЗначением" Тогда 
				Возврат НСтр("ru='Фиксированным значением';uk='Фіксованим значенням'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаКомиссионногоВознаграждения" Тогда 
			Если ИмяДляПеревода = "НеРассчитывается" Тогда 
				Возврат НСтр("ru='Не рассчитывается';uk='Не розраховується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроцентОтРазностиСуммыПродажиИСуммыКомитента" Тогда 
				Возврат НСтр("ru='Процент от разности суммы продажи и суммы комитента';uk='Відсоток від різниці суми продажу та суми комітента'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроцентОтСуммыПродажи" Тогда 
				Возврат НСтр("ru='Процент от суммы продажи';uk='Відсоток від суми продажу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаНачислений" Тогда 
			Если ИмяДляПеревода = "ДоплатаДоМЗП" Тогда 
				Возврат НСтр("ru='Доплата до МЗП';uk='Доплата до МЗП'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоплатаДоСохраняемогоДенежногоСодержанияЗаДниБолезни" Тогда 
				Возврат НСтр("ru='Доплата до сохраняемого денежного содержания за дни болезни';uk='Доплата до збереженого грошового утримання за дні хвороби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоплатаДоСреднегоЗаработка" Тогда 
				Возврат НСтр("ru='Доплата до среднего заработка';uk='Доплата до середнього заробітку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоплатаДоСреднегоЗаработкаФСС" Тогда 
				Возврат НСтр("ru='Доплата до среднего заработка ФСС';uk='Доплата до середнього заробітку ФСС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Индексация" Тогда 
				Возврат НСтр("ru='Индексация';uk='Індексація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаБольничного" Тогда 
				Возврат НСтр("ru='Оплата больничного';uk='Оплата лікарняного'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаОтпускаПоКалендарнымДням" Тогда 
				Возврат НСтр("ru='Оплата отпуска по календарным дням';uk='Оплата відпустки за календарними днями'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаОтпускаПоШестидневке" Тогда 
				Возврат НСтр("ru='По среднему заработку для отпуска при расчете из рабочих дней';uk='По середньому заробітку для відпустки при розрахунку робочих днів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПростоя" Тогда 
				Возврат НСтр("ru='Оплата простоя';uk='Оплата простою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПособиеПоУходуЗаРебенкомДоПолутораЛет" Тогда 
				Возврат НСтр("ru='Пособие по уходу за ребенком до 1.5 лет';uk='Допомога по догляду за дитиною до 1.5 років'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизвольнаяФормула" Тогда 
				Возврат НСтр("ru='Произвольная формула';uk='Довільна формула'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаОтпуска" Тогда 
			Если ИмяДляПеревода = "ВКалендарныхДнях" Тогда 
				Возврат НСтр("ru='В календарных днях';uk='У календарних днях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВКалендарныхДняхСПраздниками" Тогда 
				Возврат НСтр("ru='В календарных днях с праздниками';uk='У календарних днях з святами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВКалендарныхИлиРабочихДняхВЗависимостиОтТрудовогоДоговора" Тогда 
				Возврат НСтр("ru='В календарных или рабочих днях в зависимости от трудового договора';uk='У календарних або робочих днях в залежності від трудового договору'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВРабочихДнях" Тогда 
				Возврат НСтр("ru='В рабочих днях';uk='У робочих днях'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаУдержаний" Тогда 
			Если ИмяДляПеревода = "ВознаграждениеПлатежногоАгента" Тогда 
				Возврат НСтр("ru='Вознаграждение платежного агента';uk='Винагорода платіжного агента'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсполнительныйЛист" Тогда 
				Возврат НСтр("ru='Исполнительный лист';uk='Виконавчий лист'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизвольнаяФормула" Тогда 
				Возврат НСтр("ru='Произвольная формула';uk='Довільна формула'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаУдержанияПоИсполнительномуДокументу" Тогда 
			Если ИмяДляПеревода = "Долей" Тогда 
				Возврат НСтр("ru='Долей';uk='Часткою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Процентом" Тогда 
				Возврат НСтр("ru='Процентом';uk='Відсотком'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФиксированнойСуммой" Тогда 
				Возврат НСтр("ru='Фиксированной суммой';uk='Фіксованою сумою'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРедактированияЭлектронныхПисем" Тогда 
			Если ИмяДляПеревода = "HTML" Тогда 
				Возврат НСтр("ru='HTML';uk='HTML'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбычныйТекст" Тогда 
				Возврат НСтр("ru='Обычный текст';uk='Звичайний текст'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыСоставленияБюджетов" Тогда 
			Если ИмяДляПеревода = "НаФиксированныйПериод" Тогда 
				Возврат НСтр("ru='На фиксированный период';uk='На фіксований період'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Скользящий" Тогда 
				Возврат НСтр("ru='Скользящий';uk='Ковзний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыСравненияВерсийФайлов" Тогда 
			Если ИмяДляПеревода = "MicrosoftOfficeWord" Тогда 
				Возврат НСтр("ru='Microsoft Office Word';uk='Microsoft Office Word'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "OpenOfficeOrgWriter" Тогда 
				Возврат НСтр("ru='OpenOffice.org Writer';uk='OpenOffice.org Writer'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыУправленияОперациями" Тогда 
			Если ИмяДляПеревода = "РегистрацияОтклонений" Тогда 
				Возврат НСтр("ru='Регистрация отклонений';uk='Реєстрація відхилень'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РегистрацияФакта" Тогда 
				Возврат НСтр("ru='Регистрация факта';uk='Реєстрація факту'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыУстановкиВремениНапоминания" Тогда 
			Если ИмяДляПеревода = "ВУказанноеВремя" Тогда 
				Возврат НСтр("ru='В указанное время';uk='У зазначений час'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтносительноВремениПредмета" Тогда 
				Возврат НСтр("ru='Относительно времени предмета';uk='Відносто часу предмета'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтносительноТекущегоВремени" Тогда 
				Возврат НСтр("ru='Относительно текущего времени';uk='Відносно поточного часу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Периодически" Тогда 
				Возврат НСтр("ru='Периодически';uk='Періодично'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыУстановкиКурсаВалюты" Тогда 
			Если ИмяДляПеревода = "ЗагрузкаИзИнтернета" Тогда 
				Возврат НСтр("ru='Загрузка из интернета';uk='Завантаження з інтернету'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаценкаНаКурсДругойВалюты" Тогда 
				Возврат НСтр("ru='Наценка на курс другой валюты';uk='Націнка на курс іншої валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетПоФормуле" Тогда 
				Возврат НСтр("ru='Расчет по формуле';uk='Розрахунок за формулою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РучнойВвод" Тогда 
				Возврат НСтр("ru='Ручной ввод';uk='Ручне введення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыФинансированияПособийСоцстрахования" Тогда 
			Если ИмяДляПеревода = "ЗаСчетРаботодателя" Тогда 
				Возврат НСтр("ru='За счет работодателя';uk='За рахунок роботодавця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаСчетФСС" Тогда 
				Возврат НСтр("ru='За счет ФСС';uk='За рахунок ФСС'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыФормированияСегментов" Тогда 
			Если ИмяДляПеревода = "ПериодическиОбновлять" Тогда 
				Возврат НСтр("ru='Периодически обновлять';uk='Періодично оновлювати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФормироватьВручную" Тогда 
				Возврат НСтр("ru='Формировать вручную';uk='Формувати вручну'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФормироватьДинамически" Тогда 
				Возврат НСтр("ru='Формировать динамически';uk='Формувати динамічно'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СрокиХраненияВерсий" Тогда 
			Если ИмяДляПеревода = "Бессрочно" Тогда 
				Возврат НСтр("ru='Бессрочно';uk='Безстроково'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаПоследниеТриМесяца" Тогда 
				Возврат НСтр("ru='За последние три месяца';uk='За останні три місяці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаПоследниеШестьМесяцев" Тогда 
				Возврат НСтр("ru='За последние шесть месяцев';uk='За останні шість місяців'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаПоследнийГод" Тогда 
				Возврат НСтр("ru='За последний год';uk='За останній рік'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаПоследнийМесяц" Тогда 
				Возврат НСтр("ru='За последний месяц';uk='За останній місяць'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаПоследнююНеделю" Тогда 
				Возврат НСтр("ru='За последнюю неделю';uk='За останній тиждень'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтавкиНДС" Тогда 
			Если ИмяДляПеревода = "БезНДС" Тогда 
				Возврат НСтр("ru='Без НДС';uk='Без ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДС0" Тогда 
				Возврат НСтр("ru='0%';uk='0%'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДС20" Тогда 
				Возврат НСтр("ru='20%';uk='20%'" ,КодЯзыка);			
            ИначеЕсли ИмяДляПеревода = "НДС14" Тогда 
            	Возврат НСтр("ru='14%';uk='14%'" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "НДС7" Тогда 
				Возврат НСтр("ru='7%';uk='7%'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеНДС" Тогда 
				Возврат НСтр("ru='Не НДС';uk='Не ПДВ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтадииАссортимента" Тогда 
			Если ИмяДляПеревода = "ЗапрещеныЗакупкиИПродажи" Тогда 
				Возврат НСтр("ru='Запрещены закупки и продажи';uk='Заборонені купівлі та продажі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазрешеныЗакупкиИПродажи" Тогда 
				Возврат НСтр("ru='Разрешены закупки и продажи';uk='Дозволені купівлі та продажі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазрешеныТолькоЗакупки" Тогда 
				Возврат НСтр("ru='Разрешены только закупки';uk='Дозволені тільки купівлі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазрешеныТолькоПродажи" Тогда 
				Возврат НСтр("ru='Разрешены только продажи';uk='Дозволені тільки продажі'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтадииВзаимоотношенийСКлиентами" Тогда 
			Если ИмяДляПеревода = "ПостоянныйКлиент" Тогда 
				Возврат НСтр("ru='Постоянный клиент';uk='Постійний клієнт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПотенциальныйКлиент" Тогда 
				Возврат НСтр("ru='Потенциальный клиент';uk='Потенційний клієнт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПотерянныйКлиент" Тогда 
				Возврат НСтр("ru='Потерянный клиент';uk='Втрачений клієнт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазовыйКлиент" Тогда 
				Возврат НСтр("ru='Разовый клиент';uk='Разовий клієнт'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтадииЗадач" Тогда 
			Если ИмяДляПеревода = "Выполнена" Тогда 
				Возврат НСтр("ru='Выполнена';uk='Виконано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Выполняется" Тогда 
				Возврат НСтр("ru='Выполняется';uk='Виконується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Запланирована" Тогда 
				Возврат НСтр("ru='Запланирована';uk='Запланована'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеЗапланирована" Тогда 
				Возврат НСтр("ru='Не запланирована';uk='Не запланована'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Приостановлена" Тогда 
				Возврат НСтр("ru='Приостановлена';uk='Призупинена'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Проверена" Тогда 
				Возврат НСтр("ru='Проверена';uk='Перевірена'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыАвансовогоОтчета" Тогда 
			Если ИмяДляПеревода = "Подготовлен" Тогда 
				Возврат НСтр("ru='Подготовлен';uk='Підготовлений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Утвержден" Тогда 
				Возврат НСтр("ru='Утвержден';uk='Затверджено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыАвтокорректировкиНалоговыхДокументов" Тогда 
			Если ИмяДляПеревода = "ИсправлятьТекущийДокумент" Тогда 
				Возврат НСтр("ru='Исправлять этот документ';uk='Виправляти цей документ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсправлятьТехническуюТЧ" Тогда 
				Возврат НСтр("ru='Не исправлять (не рекомендуется)';uk='Не виправляти (не рекомендується)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФормироватьПриложение2" Тогда 
				Возврат НСтр("ru='Формировать ""Приложение 2 к налоговой накладной""';uk='Формувати ""Додаток 2 до податкової накладної""'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыАктаОРасхождениях" Тогда 
			Если ИмяДляПеревода = "КВыполнению" Тогда 
				Возврат НСтр("ru='Отрабатывается';uk='Відпрацьовується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласовано" Тогда 
				Возврат НСтр("ru='Не согласовано';uk='Не погоджено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отработано" Тогда 
				Возврат НСтр("ru='Отработано';uk='Відпрацьовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Согласовано" Тогда 
				Возврат НСтр("ru='Обеспечивается';uk='Забезпечується'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыВидовКартЛояльности" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеДействует" Тогда 
				Возврат НСтр("ru='Не действует';uk='Не діє'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыВнутреннихЗаказов" Тогда 
			Если ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КВыполнению" Тогда 
				Возврат НСтр("ru='К выполнению';uk='До виконання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОбеспечению" Тогда 
				Возврат НСтр("ru='К обеспечению';uk='До забезпечення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыВозвратовМатериаловИзПроизводства" Тогда 
			Если ИмяДляПеревода = "КВозврату" Тогда 
				Возврат НСтр("ru='К возврату';uk='До повернення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Принято" Тогда 
				Возврат НСтр("ru='Принято';uk='Прийнято'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыВыдачиПокупателюНалоговыхДокументов" Тогда 
			Если ИмяДляПеревода = "ВыданПокупателю" Тогда 
				Возврат НСтр("ru='Выдан покупателю';uk='Виданий покупцеві'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВыданПокупателю" Тогда 
				Возврат НСтр("ru='Не выдан покупателю';uk='Не виданий покупцю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПодлежитПовторнойВыдаче" Тогда 
				Возврат НСтр("ru='Подлежит повторной выдаче';uk='Підлягає повторній видачі'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыВыполненияОпераций" Тогда 
			Если ИмяДляПеревода = "Завершено" Тогда 
				Возврат НСтр("ru='Завершено';uk='Завершено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Начато" Тогда 
				Возврат НСтр("ru='Началось';uk='Почалося'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеЗапланировано" Тогда 
				Возврат НСтр("ru='Не запланировано';uk='Не заплановано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеНачато" Тогда 
				Возврат НСтр("ru='Не началось';uk='Не почалося'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыВыполненияПроизводства" Тогда 
			Если ИмяДляПеревода = "ВЖелтойЗоне" Тогда 
				Возврат НСтр("ru='В желтой зоне';uk='У жовтій зоні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВЗеленойЗоне" Тогда 
				Возврат НСтр("ru='В зеленой зоне';uk='У зеленій зоні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВКраснойЗоне" Тогда 
				Возврат НСтр("ru='В красной зоне';uk='У червоній зоні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Просрочен" Тогда 
				Возврат НСтр("ru='Просрочен';uk='Прострочений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуетсяВнимание" Тогда 
				Возврат НСтр("ru='Требуется внимание';uk='Потребує уваги'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыГрафикаПроизводстваВЗаказеНаПроизводство" Тогда 
			Если ИмяДляПеревода = "Рассчитан" Тогда 
				Возврат НСтр("ru='Рассчитан';uk='Розрахований'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуетсяРассчитать" Тогда 
				Возврат НСтр("ru='Требуется рассчитать';uk='Потрібно розрахувати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыДействияСкидок" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеДействует" Тогда 
				Возврат НСтр("ru='Не действует';uk='Не діє'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыДефектов" Тогда 
			Если ИмяДляПеревода = "Зарегистрирован" Тогда 
				Возврат НСтр("ru='Зарегистрирован';uk='Зареєстрований'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отклонен" Тогда 
				Возврат НСтр("ru='Отклонен';uk='Відхилено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтложеноУстранение" Тогда 
				Возврат НСтр("ru='Отложено устранение';uk='Відкладено усунення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Признан" Тогда 
				Возврат НСтр("ru='Признан';uk='Визнаний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Устранен" Тогда 
				Возврат НСтр("ru='Устранен';uk='Усунутий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыДоверенностей" Тогда 
			Если ИмяДляПеревода = "Аннулирована" Тогда 
				Возврат НСтр("ru='Аннулирована';uk='Анульовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Выдана" Тогда 
				Возврат НСтр("ru='Выдана';uk='Видано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Использована" Тогда 
				Возврат НСтр("ru='Использована';uk='Використана'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВыдана" Тогда 
				Возврат НСтр("ru='Не выдана';uk='Не видана'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИспользована" Тогда 
				Возврат НСтр("ru='Не использована';uk='Не використана'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыДоговоровКонтрагентов" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласован" Тогда 
				Возврат НСтр("ru='Не согласован';uk='Не погоджено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЗаданийНаПеревозку" Тогда 
			Если ИмяДляПеревода = "Закрыто" Тогда 
				Возврат НСтр("ru='Закрыто';uk='Закрито'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КПогрузке" Тогда 
				Возврат НСтр("ru='К погрузке';uk='До навантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отправлено" Тогда 
				Возврат НСтр("ru='Отправлено';uk='Відправлене'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Формируется" Тогда 
				Возврат НСтр("ru='Формируется';uk='Формується'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЗаданийТорговымПредставителям" Тогда 
			Если ИмяДляПеревода = "КОтработке" Тогда 
				Возврат НСтр("ru='К отработке';uk='До відпрацювання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеОтработано" Тогда 
				Возврат НСтр("ru='Не отработано';uk='Не відпрацьовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеПодготовлено" Тогда 
				Возврат НСтр("ru='Не подготовлено';uk='Не підготовлено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отменено" Тогда 
				Возврат НСтр("ru='Отменено';uk='Скасовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отработано" Тогда 
				Возврат НСтр("ru='Отработано';uk='Відпрацьовано'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЗаказовДавальцев" Тогда 
			Если ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОтгрузке" Тогда 
				Возврат НСтр("ru='К отгрузке';uk='До відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КПроизводству" Тогда 
				Возврат НСтр("ru='К производству';uk='До виробництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласован" Тогда 
				Возврат НСтр("ru='Не согласован';uk='Не погоджено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Согласован" Тогда 
				Возврат НСтр("ru='Согласован';uk='Погоджений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЗаказовКлиентов" Тогда 
			Если ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОбеспечению" Тогда 
				Возврат НСтр("ru='К выполнению / В резерве';uk='До виконання / В резерві'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОтгрузке" Тогда 
				Возврат НСтр("ru='К отгрузке';uk='До відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласован" Тогда 
				Возврат НСтр("ru='На согласовании';uk='На погодженні'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЗаказовМатериаловВПроизводство" Тогда 
			Если ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КВыполнению" Тогда 
				Возврат НСтр("ru='К выполнению';uk='До виконання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОбеспечению" Тогда 
				Возврат НСтр("ru='К обеспечению';uk='До забезпечення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЗаказовНаПроизводство" Тогда 
			Если ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КПроизводству" Тогда 
				Возврат НСтр("ru='К производству';uk='До виробництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Создан" Тогда 
				Возврат НСтр("ru='Создан';uk='Створено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЗаказовНаРемонт" Тогда 
			Если ИмяДляПеревода = "Выполняется" Тогда 
				Возврат НСтр("ru='Выполняется';uk='Виконується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КВыполнению" Тогда 
				Возврат НСтр("ru='К выполнению';uk='До виконання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Создан" Тогда 
				Возврат НСтр("ru='Создан';uk='Створено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЗаказовПереработчикам" Тогда 
			Если ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КИсполнению" Тогда 
				Возврат НСтр("ru='К исполнению';uk='До виконання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОбеспечению" Тогда 
				Возврат НСтр("ru='К обеспечению';uk='До забезпечення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласован" Тогда 
				Возврат НСтр("ru='Не согласован';uk='Не погоджено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЗаказовПоставщикам" Тогда 
			Если ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КПоступлению" Тогда 
				Возврат НСтр("ru='К поступлению';uk='До надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласован" Тогда 
				Возврат НСтр("ru='Не согласован';uk='Не погоджено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подтвержден" Тогда 
				Возврат НСтр("ru='Подтвержден';uk='Підтверджений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Согласован" Тогда 
				Возврат НСтр("ru='Согласован';uk='Погоджений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЗаявленийИРеестровНаВыплатуПособий" Тогда 
			Если ИмяДляПеревода = "Аннулирован" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Аннулирован';uk='ѳ(не український) Анульовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВРаботе" Тогда 
				Возврат НСтр("ru='В работе';uk='В роботі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеПринятФСС" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Не принят ФСС';uk='ѳ(не український) Не прийнятий ФСС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереданВФСС" Тогда 
				Возврат НСтр("ru='Передан в фонд';uk='Переданий до фонду'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подготовлен" Тогда 
				Возврат НСтр("ru='Подготовлен';uk='Підготовлений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПринятФСС" Тогда 
				Возврат НСтр("ru='ѳ(не украинский) Принят ФСС';uk='ѳ(не український) Прийнятий ФСС'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов" Тогда 
			Если ИмяДляПеревода = "Выполнена" Тогда 
				Возврат НСтр("ru='Выполнена';uk='Виконано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КВозврату" Тогда 
				Возврат НСтр("ru='К возврату';uk='До повернення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОбеспечению" Тогда 
				Возврат НСтр("ru='К выполнению / В резерве';uk='До виконання / В резерві'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОтгрузке" Тогда 
				Возврат НСтр("ru='К отгрузке';uk='До відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласована" Тогда 
				Возврат НСтр("ru='На согласовании';uk='На погодженні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отклонена" Тогда 
				Возврат НСтр("ru='Отклонена';uk='Відхилено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств" Тогда 
			Если ИмяДляПеревода = "КОплате" Тогда 
				Возврат НСтр("ru='К оплате';uk='До оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласована" Тогда 
				Возврат НСтр("ru='Не согласована';uk='Не погоджена'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отклонена" Тогда 
				Возврат НСтр("ru='Отклонена';uk='Відхилено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Согласована" Тогда 
				Возврат НСтр("ru='Согласована';uk='Погоджено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыИзвлеченияТекстаФайлов" Тогда 
			Если ИмяДляПеревода = "Извлечен" Тогда 
				Возврат НСтр("ru='Извлечен';uk='Витягнутий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзвлечьНеУдалось" Тогда 
				Возврат НСтр("ru='Извлечь не удалось';uk='Витягти не вдалося'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИзвлечен" Тогда 
				Возврат НСтр("ru='Не извлечен';uk='Не витягнутий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыИсходящегоЭлектронногоПисьма" Тогда 
			Если ИмяДляПеревода = "Исходящее" Тогда 
				Возврат НСтр("ru='Исходящее';uk='Вихідне'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отправлено" Тогда 
				Возврат НСтр("ru='Отправлено';uk='Відправлене'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Черновик" Тогда 
				Возврат НСтр("ru='Черновик';uk='Чернетка'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыКартЛояльности" Тогда 
			Если ИмяДляПеревода = "Аннулирована" Тогда 
				Возврат НСтр("ru='Аннулирована';uk='Анульовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыКассовойСмены" Тогда 
			Если ИмяДляПеревода = "Закрыта" Тогда 
				Возврат НСтр("ru='Закрыта';uk='Закрита'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗакрытаЧекиЗаархивированы" Тогда 
				Возврат НСтр("ru='Закрыта (чеки заархивированы)';uk='Закрита (чеки заархівовані)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Открыта" Тогда 
				Возврат НСтр("ru='Открыта';uk='Відкрита'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыКоммерческихПредложенийКлиентам" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласовано" Тогда 
				Возврат НСтр("ru='Не согласовано';uk='Не погоджено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отменено" Тогда 
				Возврат НСтр("ru='Отменено';uk='Скасовано'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыКомплектовФинансовойОтчетности" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеДействует" Тогда 
				Возврат НСтр("ru='Не действует';uk='Не діє'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЛистковСообщения" Тогда 
			Если ИмяДляПеревода = "ВрученСотруднику" Тогда 
				Возврат НСтр("ru='Вручен сотруднику';uk='Вручено співробітникові'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВрученСотруднику" Тогда 
				Возврат НСтр("ru='Не вручен сотруднику';uk='Не вручений співробітникові'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредъявленКорешок" Тогда 
				Возврат НСтр("ru='Предъявлен корешок из военкомата';uk='Пред'явлений корінець з військкомату'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыМаршрутныхКарт" Тогда 
			Если ИмяДляПеревода = "ВРазработке" Тогда 
				Возврат НСтр("ru='В разработке';uk='В розробці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыта" Тогда 
				Возврат НСтр("ru='Закрыта';uk='Закрита'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыМаршрутныхЛистовПроизводства" Тогда 
			Если ИмяДляПеревода = "Выполнен" Тогда 
				Возврат НСтр("ru='Выполнен';uk='Виконаний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Выполняется" Тогда 
				Возврат НСтр("ru='Выполняется';uk='Виконується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КВыполнению" Тогда 
				Возврат НСтр("ru='К выполнению';uk='До виконання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отменен" Тогда 
				Возврат НСтр("ru='Отменен';uk='Скасовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Создан" Тогда 
				Возврат НСтр("ru='Создан';uk='Створено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыМоделейБюджетирования" Тогда 
			Если ИмяДляПеревода = "ВРазработке" Тогда 
				Возврат НСтр("ru='В разработке';uk='В розробці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыта" Тогда 
				Возврат НСтр("ru='Закрыта';uk='Закрита'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыНалоговыхДокументов" Тогда 
			Если ИмяДляПеревода = "КПроверке" Тогда 
				Возврат НСтр("ru='К проверке';uk='До перевірки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Проверен" Тогда 
				Возврат НСтр("ru='Проверен';uk='Перевірений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сформирован" Тогда 
				Возврат НСтр("ru='Сформирован';uk='Сформований'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыНаправленияДеятельности" Тогда 
			Если ИмяДляПеревода = "Используется" Тогда 
				Возврат НСтр("ru='Используется';uk='Використовується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеИспользуется" Тогда 
				Возврат НСтр("ru='Не используется';uk='Не використовується'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыОбластейДанных" Тогда 
			Если ИмяДляПеревода = "ИмпортИзФайла" Тогда 
				Возврат НСтр("ru='Импорт из файла';uk='Імпорт з файлу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Используется" Тогда 
				Возврат НСтр("ru='Используется';uk='Використовується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КУдалению" Тогда 
				Возврат НСтр("ru='К удалению';uk='До вилучення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Новая" Тогда 
				Возврат НСтр("ru='Новая';uk='Нова'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Удалена" Тогда 
				Возврат НСтр("ru='Удалена';uk='Вилучена'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыОбъектовЭксплуатации" Тогда 
			Если ИмяДляПеревода = "ВЭксплуатации" Тогда 
				Возврат НСтр("ru='В эксплуатации';uk='В експлуатації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ликвидирован" Тогда 
				Возврат НСтр("ru='Ликвидирован';uk='Ліквідовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Редактируется" Тогда 
				Возврат НСтр("ru='Редактируется';uk='Редагується'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыОрдеровНаПеремещение" Тогда 
			Если ИмяДляПеревода = "ВПроцессеПроверки" Тогда 
				Возврат НСтр("ru='В процессе проверки';uk='В процесі перевірки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОтбору" Тогда 
				Возврат НСтр("ru='К отбору';uk='До відбору'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОтгрузке" Тогда 
				Возврат НСтр("ru='К отгрузке';uk='До відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КПроверке" Тогда 
				Возврат НСтр("ru='К проверке';uk='До перевірки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Принят" Тогда 
				Возврат НСтр("ru='Принят';uk='Прийнятий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыОтборовРазмещенийТоваров" Тогда 
			Если ИмяДляПеревода = "ВРаботе" Тогда 
				Возврат НСтр("ru='В работе';uk='В роботі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыполненоБезОшибок" Тогда 
				Возврат НСтр("ru='Выполнено без ошибок';uk='Виконано без помилок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыполненоСОшибками" Тогда 
				Возврат НСтр("ru='Выполнено с ошибками';uk='Виконано з помилками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подготовлено" Тогда 
				Возврат НСтр("ru='Подготовлено';uk='Підготовлено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыОтказовОтПроизводства" Тогда 
			Если ИмяДляПеревода = "Отклонен" Тогда 
				Возврат НСтр("ru='Отклонен';uk='Відхилено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Принят" Тогда 
				Возврат НСтр("ru='Принят';uk='Прийнятий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Создан" Тогда 
				Возврат НСтр("ru='Создан';uk='Створено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыОтраженияВМеждународномУчете" Тогда 
			Если ИмяДляПеревода = "КОтражениюВУчете" Тогда 
				Возврат НСтр("ru='К отражению в учете';uk='До відображення в обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОтражениюВУчетеВручную" Тогда 
				Возврат НСтр("ru='К отражению в учете вручную';uk='До відображення в обліку вручну'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОжидаетсяОтражениеВРеглУчете" Тогда 
				Возврат НСтр("ru='Ожидается отражение в регл. учете';uk='Очікується відображення в регл. обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтраженоВУчете" Тогда 
				Возврат НСтр("ru='Отражено в учете';uk='Відображено в обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтраженоВУчетеВручную" Тогда 
				Возврат НСтр("ru='Отражено в учете вручную';uk='Відображено в обліку вручну'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтсутствуютПравилаОтраженияВУчете" Тогда 
				Возврат НСтр("ru='Отсутствуют правила отражения в учете';uk='Відсутні правила відображення в обліку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыОтраженияДокументовВРеглУчете" Тогда 
			Если ИмяДляПеревода = "КОтражениюВРеглУчете" Тогда 
				Возврат НСтр("ru='К отражению';uk='До відображення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОтражениюВУчетеВручную" Тогда 
				Возврат НСтр("ru='Требует подтверждения';uk='Потребує підтвердження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеУказаныСчетаУчета" Тогда 
				Возврат НСтр("ru='Не указаны счета учета';uk='Не зазначені рахунки обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтраженоВРеглУчете" Тогда 
				Возврат НСтр("ru='Отражен';uk='Відображено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтраженоВУчетеВручную" Тогда 
				Возврат НСтр("ru='Отражен вручную';uk='Відображено вручну'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПакетовЭД" Тогда 
			Если ИмяДляПеревода = "Доставлен" Тогда 
				Возврат НСтр("ru='Доставлен';uk='Доставлений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КРаспаковке" Тогда 
				Возврат НСтр("ru='К распаковке';uk='До розпакування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Неизвестный" Тогда 
				Возврат НСтр("ru='Неизвестный';uk='Невідомий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отменен" Тогда 
				Возврат НСтр("ru='Отменен (без обработки)';uk='Скасовано (без обробки)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отправлен" Тогда 
				Возврат НСтр("ru='Отправлен';uk='Відправлений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПодготовленКОтправке" Тогда 
				Возврат НСтр("ru='Подготовлен к отправке';uk='Підготовлено до відправлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Распакован" Тогда 
				Возврат НСтр("ru='Распакован';uk='Розпакований'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаспакованДокументыНеОбработаны" Тогда 
				Возврат НСтр("ru='Распакован, документы не обработаны';uk='Розпакований, документи не оброблені'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПередачМатериаловВПроизводство" Тогда 
			Если ИмяДляПеревода = "Отгружено" Тогда 
				Возврат НСтр("ru='Отгружено';uk='Відвантажено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Принято" Тогда 
				Возврат НСтр("ru='Принято';uk='Прийнято'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПеремещенийТоваров" Тогда 
			Если ИмяДляПеревода = "Отгружено" Тогда 
				Возврат НСтр("ru='Отгружено';uk='Відвантажено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Принято" Тогда 
				Возврат НСтр("ru='Принято';uk='Прийнято'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УДАЛИТЬКОтгрузке" Тогда 
				Возврат НСтр("ru='(не используется) КОтгрузке';uk='(не використовується) До відвантаження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПеремещенияМатериаловВПроизводстве" Тогда 
			Если ИмяДляПеревода = "КОтгрузке" Тогда 
				Возврат НСтр("ru='К отгрузке';uk='До відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отгружено" Тогда 
				Возврат НСтр("ru='Отгружено';uk='Відвантажено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Принято" Тогда 
				Возврат НСтр("ru='Принято';uk='Прийнято'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПересчетовТоваров" Тогда 
			Если ИмяДляПеревода = "ВнесениеРезультатов" Тогда 
				Возврат НСтр("ru='Внесение результатов';uk='Внесення результатів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВРаботе" Тогда 
				Возврат НСтр("ru='В работе';uk='В роботі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Выполнено" Тогда 
				Возврат НСтр("ru='Выполнено';uk='Виконано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подготовлено" Тогда 
				Возврат НСтр("ru='Подготовлено';uk='Підготовлено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПисем" Тогда 
			Если ИмяДляПеревода = "Исходящее" Тогда 
				Возврат НСтр("ru='Исходящее';uk='Вихідне'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отправленное" Тогда 
				Возврат НСтр("ru='Отправленное';uk='Відправлений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Полученное" Тогда 
				Возврат НСтр("ru='Полученное';uk='Отриманий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сохраненное" Тогда 
				Возврат НСтр("ru='Сохраненное';uk='Збережений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПланированияПодсборки" Тогда 
			Если ИмяДляПеревода = "Выполнено" Тогда 
				Возврат НСтр("ru='Выполнено';uk='Виконано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Запланировать" Тогда 
				Возврат НСтр("ru='Запланировать';uk='Запланувати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеТребуется" Тогда 
				Возврат НСтр("ru='Не требуется';uk='Не потрібно'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПланов" Тогда 
			Если ИмяДляПеревода = "ВПодготовке" Тогда 
				Возврат НСтр("ru='В подготовке';uk='У підготовці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаУтверждении" Тогда 
				Возврат НСтр("ru='На утверждении';uk='На затвердженні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отменен" Тогда 
				Возврат НСтр("ru='Отменен';uk='Скасовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Утвержден" Тогда 
				Возврат НСтр("ru='Утвержден';uk='Затверджено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПлановыхКалькуляций" Тогда 
			Если ИмяДляПеревода = "ВРазработке" Тогда 
				Возврат НСтр("ru='В разработке';uk='В розробці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПодарочныхСертификатов" Тогда 
			Если ИмяДляПеревода = "Активирован" Тогда 
				Возврат НСтр("ru='Активирован';uk='Активований'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Аннулирован" Тогда 
				Возврат НСтр("ru='Аннулирован';uk='Анульовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Возвращен" Тогда 
				Возврат НСтр("ru='Возвращен';uk='Повернуто'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеАктивирован" Тогда 
				Возврат НСтр("ru='Не активирован';uk='Не активований'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолностьюПогашен" Тогда 
				Возврат НСтр("ru='Полностью погашен';uk='Повністю погашений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧастичноПогашен" Тогда 
				Возврат НСтр("ru='Частично погашен';uk='Частково погашений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПретензийКлиентов" Тогда 
			Если ИмяДляПеревода = "Зарегистрирована" Тогда 
				Возврат НСтр("ru='Зарегистрирована';uk='Зареєстрована'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеУдовлетворена" Тогда 
				Возврат НСтр("ru='Не удовлетворена';uk='Не задоволена'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обрабатывается" Тогда 
				Возврат НСтр("ru='Обрабатывается';uk='Обробляється'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Удовлетворена" Тогда 
				Возврат НСтр("ru='Удовлетворена';uk='Задоволена'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПриходныхОрдеров" Тогда 
			Если ИмяДляПеревода = "ВРаботе" Тогда 
				Возврат НСтр("ru='В работе';uk='В роботі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КПоступлению" Тогда 
				Возврат НСтр("ru='К поступлению';uk='До надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Принят" Тогда 
				Возврат НСтр("ru='Принят';uk='Прийнятий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуетсяОбработка" Тогда 
				Возврат НСтр("ru='Требуется обработка';uk='Потрібна обробка'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПроверкиЛимитов" Тогда 
			Если ИмяДляПеревода = "ЛимитыПревышены" Тогда 
				Возврат НСтр("ru='Лимиты превышены';uk='Ліміти перевищені'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеПроверено" Тогда 
				Возврат НСтр("ru='Не проверено';uk='Не перевірено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Проверено" Тогда 
				Возврат НСтр("ru='Проверено';uk='Перевірено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПроверкиЭЦП" Тогда 
			Если ИмяДляПеревода = "Валидна" Тогда 
				Возврат НСтр("ru='Валидна';uk='Валидна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВалидна" Тогда 
				Возврат НСтр("ru='Не валидна';uk='Не валидна'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыПроцессовПодготовкиБюджетов" Тогда 
			Если ИмяДляПеревода = "Выполняется" Тогда 
				Возврат НСтр("ru='Выполняется';uk='Виконується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Завершен" Тогда 
				Возврат НСтр("ru='Завершен';uk='Завершений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Незапущен" Тогда 
				Возврат НСтр("ru='Незапущен';uk='Незапущено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отменен" Тогда 
				Возврат НСтр("ru='Отменен';uk='Скасовано'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыРаботыРабочихЦентров" Тогда 
			Если ИмяДляПеревода = "БезОтклонений" Тогда 
				Возврат НСтр("ru='Без отклонений';uk='Без відхилень'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВРаботе" Тогда 
				Возврат НСтр("ru='В работе';uk='В роботі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗавершенаСОтставанием" Тогда 
				Возврат НСтр("ru='Завершена с отставанием';uk='Завершено з відставанням'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСформированоРасписание" Тогда 
				Возврат НСтр("ru='Не сформировано расписание';uk='Не сформовано розклад'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Опережение" Тогда 
				Возврат НСтр("ru='Опережение';uk='Випередження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отставание" Тогда 
				Возврат НСтр("ru='Отставание';uk='Відставання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтартуетЧерез" Тогда 
				Возврат НСтр("ru='Стартует через';uk='Стартує через'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыРазрешенийНаЗаменуМатериалов" Тогда 
			Если ИмяДляПеревода = "Прекращено" Тогда 
				Возврат НСтр("ru='Прекращено';uk='Припинено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Создано" Тогда 
				Возврат НСтр("ru='Создано';uk='Створено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Утверждено" Тогда 
				Возврат НСтр("ru='Утверждено';uk='Затверджено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыРаспоряженийНаПеремещениеДенежныхСредств" Тогда 
			Если ИмяДляПеревода = "КОплате" Тогда 
				Возврат НСтр("ru='К оплате';uk='До оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласовано" Тогда 
				Возврат НСтр("ru='Не согласовано';uk='Не погоджено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отклонено" Тогда 
				Возврат НСтр("ru='Отклонено';uk='Відхилено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Согласовано" Тогда 
				Возврат НСтр("ru='Согласовано';uk='Погоджено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыРаспоряженийНаПроведениеИнвентаризацийТоваров" Тогда 
			Если ИмяДляПеревода = "ВРаботе" Тогда 
				Возврат НСтр("ru='В работе';uk='В роботі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыт" Тогда 
				Возврат НСтр("ru='Закрыт';uk='Закритий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыРассылокКлиентам" Тогда 
			Если ИмяДляПеревода = "Выполнена" Тогда 
				Возврат НСтр("ru='Выполнена';uk='Виконано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОтправке" Тогда 
				Возврат НСтр("ru='К отправке';uk='До відправлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обрабатывается" Тогда 
				Возврат НСтр("ru='Обрабатывается';uk='Обробляється'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Черновик" Тогда 
				Возврат НСтр("ru='Черновик';uk='Чернетка'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыРасходныхОрдеров" Тогда 
			Если ИмяДляПеревода = "ВПроцессеПроверки" Тогда 
				Возврат НСтр("ru='В процессе проверки';uk='В процесі перевірки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОтбору" Тогда 
				Возврат НСтр("ru='К отбору';uk='До відбору'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КОтгрузке" Тогда 
				Возврат НСтр("ru='К отгрузке';uk='До відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КПроверке" Тогда 
				Возврат НСтр("ru='К проверке';uk='До перевірки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отгружен" Тогда 
				Возврат НСтр("ru='Отгружен';uk='Відвантажено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подготовлено" Тогда 
				Возврат НСтр("ru='Подготовлено';uk='Підготовлено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыРеализацийТоваровУслуг" Тогда 
			Если ИмяДляПеревода = "ВПути" Тогда 
				Возврат НСтр("ru='В пути';uk='В дорозі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КПредоплате" Тогда 
				Возврат НСтр("ru='К предоплате';uk='До передплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отгружено" Тогда 
				Возврат НСтр("ru='Реализовано';uk='Реалізовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УДАЛИТЬКОтгрузке" Тогда 
				Возврат НСтр("ru='(не используется) КОтгрузке';uk='(не використовується) До відвантаження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыРегистрацииВЕРНННалоговыхДокументов" Тогда 
			Если ИмяДляПеревода = "ЗаблокированВЕРНН" Тогда 
				Возврат НСтр("ru='Заблокирован в ЕРНН';uk='Заблокований в ЄРПН'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗарегистрированВЕРНН" Тогда 
				Возврат НСтр("ru='Зарегистрирован в ЕРНН';uk='Зареєстрований в ЄРПН'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаправленНаРегистрациюВЕРНН" Тогда 
				Возврат НСтр("ru='Направлен на регистрацию в ЕРНН';uk='Направлений на реєстрацію до ЄРПН'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеЗарегистрированВЕРНН" Тогда 
				Возврат НСтр("ru='Не зарегистрирован в ЕРНН';uk='Не зареєстрований в ЄРПН'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтказаноВРегистрацииВЕРНН" Тогда 
				Возврат НСтр("ru='Отказано в регистрации в ЕРНН';uk='Відмовлено в реєстрації в ЄРПН'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыРегламентированныхОтчетов" Тогда 
			Если ИмяДляПеревода = "ВРаботе" Тогда 
				Возврат НСтр("ru='В работе';uk='В роботі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЖдетПодтвержденияСтатуса" Тогда 
				Возврат НСтр("ru='Ждет подтверждения статуса';uk='Чекає підтвердження статусу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеПринят" Тогда 
				Возврат НСтр("ru='Не принят';uk='Не прийнятий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подготовлен" Тогда 
				Возврат НСтр("ru='Подготовлен';uk='Підготовлений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Принят" Тогда 
				Возврат НСтр("ru='Принят';uk='Прийнятий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сдан" Тогда 
				Возврат НСтр("ru='Сдан';uk='Зданий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыСборокТоваров" Тогда 
			Если ИмяДляПеревода = "ВРаботе" Тогда 
				Возврат НСтр("ru='В работе';uk='В роботі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СобраноРазобрано" Тогда 
				Возврат НСтр("ru='Собрано (разобрано)';uk='Зібрано (розібрано)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УДАЛИТЬКСборкеРазборке" Тогда 
				Возврат НСтр("ru='(не используется) К сборке (разборке)';uk='(не використовується) До складання (розбирання)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыСверокВзаиморасчетов" Тогда 
			Если ИмяДляПеревода = "НаСверке" Тогда 
				Возврат НСтр("ru='На сверке';uk='На звірці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сверена" Тогда 
				Возврат НСтр("ru='Сверена';uk='Звірена'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Создана" Тогда 
				Возврат НСтр("ru='Создана';uk='Створена'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыСделок" Тогда 
			Если ИмяДляПеревода = "ВРаботе" Тогда 
				Возврат НСтр("ru='В работе';uk='В роботі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Выиграна" Тогда 
				Возврат НСтр("ru='Выиграна';uk='Виграна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Проиграна" Тогда 
				Возврат НСтр("ru='Проиграна';uk='Програна'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыСертификатовНоменклатуры" Тогда 
			Если ИмяДляПеревода = "Действующий" Тогда 
				Возврат НСтр("ru='Действующий';uk='Діючий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Недействующий" Тогда 
				Возврат НСтр("ru='Недействующий';uk='Недіючий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыСоглашенийСКлиентами" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыто" Тогда 
				Возврат НСтр("ru='Закрыто';uk='Закрито'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласовано" Тогда 
				Возврат НСтр("ru='Не согласовано';uk='Не погоджено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыСоглашенийСПоставщиками" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыто" Тогда 
				Возврат НСтр("ru='Закрыто';uk='Закрито'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласовано" Тогда 
				Возврат НСтр("ru='Не согласовано';uk='Не погоджено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыСоглашенийЭД" Тогда 
			Если ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыто" Тогда 
				Возврат НСтр("ru='Закрыто';uk='Закрито'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСогласовано" Тогда 
				Возврат НСтр("ru='Не согласовано';uk='Не погоджено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыСпецификаций" Тогда 
			Если ИмяДляПеревода = "ВРазработке" Тогда 
				Возврат НСтр("ru='В разработке';uk='В розробці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Действует" Тогда 
				Возврат НСтр("ru='Действует';uk='Діє'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Закрыта" Тогда 
				Возврат НСтр("ru='Закрыта';uk='Закрита'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыТаможенныхДеклараций" Тогда 
			Если ИмяДляПеревода = "ВыпущеноСТаможни" Тогда 
				Возврат НСтр("ru='Выпущено с таможни';uk='Випущено з митниці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТаможенноеОформление" Тогда 
				Возврат НСтр("ru='На таможенном оформлении';uk='На митному оформленні'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыУстановокЦенНоменклатуры" Тогда 
			Если ИмяДляПеревода = "НеСогласован" Тогда 
				Возврат НСтр("ru='Не согласован';uk='Не погоджено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Согласован" Тогда 
				Возврат НСтр("ru='Согласован';uk='Погоджений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыУчастниковОбменаЭД" Тогда 
			Если ИмяДляПеревода = "ОжидаемСогласия" Тогда 
				Возврат НСтр("ru='Ожидаем согласия';uk='Чекаємо згоди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отсоединен" Тогда 
				Возврат НСтр("ru='Отсоединен';uk='Від'єднано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ошибка" Тогда 
				Возврат НСтр("ru='Ошибка';uk='Помилка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Присоединен" Тогда 
				Возврат НСтр("ru='Присоединен';uk='Приєднаний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуетсяОтсоединить" Тогда 
				Возврат НСтр("ru='Требуется отсоединить';uk='Потрібно від'єднати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуетсяПригласить" Тогда 
				Возврат НСтр("ru='Требуется пригласить';uk='Потрібно запросити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТребуетсяСогласие" Тогда 
				Возврат НСтр("ru='Требуется согласие';uk='Потрібна згода'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыФинансовойОтчетности" Тогда 
			Если ИмяДляПеревода = "ВРаботе" Тогда 
				Возврат НСтр("ru='В работе';uk='В роботі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Опубликован" Тогда 
				Возврат НСтр("ru='Опубликован';uk='Опублікований'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подготовлен" Тогда 
				Возврат НСтр("ru='Подготовлен';uk='Підготовлений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЧековККМ" Тогда 
			Если ИмяДляПеревода = "Отложен" Тогда 
				Возврат НСтр("ru='Отложен без резервирования';uk='Відкладений без резервування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Пробит" Тогда 
				Возврат НСтр("ru='Чек пробит';uk='Чек пробитий '" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТоварЗарезервирован" Тогда 
				Возврат НСтр("ru='Отложен с резервированием';uk='Відкладений з резервуванням'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтатусыЭД" Тогда 
			Если ИмяДляПеревода = "Аннулирован" Тогда 
				Возврат НСтр("ru='Аннулирован';uk='Анульовано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Доставлен" Тогда 
				Возврат НСтр("ru='Доставлен получателю';uk='Доставлений одержувачу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоставленоПодтверждение" Тогда 
				Возврат НСтр("ru='Доставлено подтверждение';uk='Доставлено підтвердження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеПолучен" Тогда 
				Возврат НСтр("ru='<Не получен>';uk='<Не отримано>'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеСформирован" Тогда 
				Возврат НСтр("ru='<Не сформирован>';uk='<Не сформований>'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Обработан" Тогда 
				Возврат НСтр("ru='Обработан';uk='Оброблений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отклонен" Тогда 
				Возврат НСтр("ru='Отклонен';uk='Відхилено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтклоненПолучателем" Тогда 
				Возврат НСтр("ru='Отклонен получателем';uk='Відхилено одержувачем'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отправлен" Тогда 
				Возврат НСтр("ru='Отправлен получателю';uk='Відправлено одержувачу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтправленоИзвещение" Тогда 
				Возврат НСтр("ru='Отправлено извещение';uk='Повідомлення відправлено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтправленоПодтверждение" Тогда 
				Возврат НСтр("ru='Отправлено подтверждение';uk='Відправлено підтвердження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтправленоПредложениеОбАннулировании" Тогда 
				Возврат НСтр("ru='Отправлено предложение об аннулировании';uk='Надіслано пропозицію про анулювання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтправленоУведомление" Тогда 
				Возврат НСтр("ru='Отправлено уведомление об уточнении';uk='Відправлено повідомлення про уточнення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОшибкаПередачи" Тогда 
				Возврат НСтр("ru='Ошибка передачи';uk='Помилка передачі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереданОператору" Тогда 
				Возврат НСтр("ru='Отправлен оператору ЭДО';uk='Відправлено оператору ЕДО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПодготовленКОтправке" Тогда 
				Возврат НСтр("ru='Подготовлен к отправке';uk='Підготовлено до відправлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПодготовленоИзвещение" Тогда 
				Возврат НСтр("ru='Подготовлено извещение';uk='Підготовлено повідомлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПодготовленоПодтверждение" Тогда 
				Возврат НСтр("ru='Подготовлено подтверждение';uk='Підготовлено підтвердження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подписан" Тогда 
				Возврат НСтр("ru='Подписан';uk='Підписаний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолностьюПодписан" Тогда 
				Возврат НСтр("ru='Полностью подписан';uk='Повністю підписано'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Получен" Тогда 
				Возврат НСтр("ru='Получен';uk='Отриманий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолученоИзвещение" Тогда 
				Возврат НСтр("ru='Получено извещение';uk='Отримано повідомлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолученоПодтверждение" Тогда 
				Возврат НСтр("ru='Получено подтверждение';uk='Отримано підтвердження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолученоПодтверждениеОператора" Тогда 
				Возврат НСтр("ru='Получено подтверждение оператора';uk='Отримано підтвердження оператора'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолученоПредложениеОбАннулировании" Тогда 
				Возврат НСтр("ru='Получено предложение об аннулировании';uk='Отримано пропозицію про анулювання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПолученоУведомление" Тогда 
				Возврат НСтр("ru='Получено уведомление об уточнении';uk='Отримано повідомлення про уточнення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Принят" Тогда 
				Возврат НСтр("ru='Принят';uk='Прийнятий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сформирован" Тогда 
				Возврат НСтр("ru='Сформирован';uk='Сформований'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СформированоПредложениеОбАннулировании" Тогда 
				Возврат НСтр("ru='Сформировано предложение об аннулировании';uk='Сформовано пропозицію про анулювання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьИсполнен" Тогда 
				Возврат НСтр("ru='(не используется) Исполнен';uk='(не використовується) Виконаний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьКартотека2" Тогда 
				Возврат НСтр("ru='(не используется) Картотека 2';uk='(не використовується) Картотека 2'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьНеОтправлен" Тогда 
				Возврат НСтр("ru='(не используется) Не отправлен';uk='(не використовується) Не відправлено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьОтказанАБС" Тогда 
				Возврат НСтр("ru='(не используется) Отказан АБС';uk='(не використовується) Відмовлено АБС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьОтклоненБанком" Тогда 
				Возврат НСтр("ru='(не используется) Отклонен банком';uk='(не використовується) Відхилено банком'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьОшибкаРеквизитов" Тогда 
				Возврат НСтр("ru='(не используется) Ошибка реквизитов';uk='(не використовується) Помилка реквізитів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьПодтвержден" Тогда 
				Возврат НСтр("ru='(не используется) Подтвержден';uk='(не використовується) Підтверджений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьПриостановлен" Тогда 
				Возврат НСтр("ru='(не используется) Приостановлен';uk='(не використовується) Призупинено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьЭПНеВерна" Тогда 
				Возврат НСтр("ru='(не используется) ЭП не верна';uk='(не використовується) ЕП не вірна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Утвержден" Тогда 
				Возврат НСтр("ru='Утвержден';uk='Затверджено'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧастичноПодписан" Тогда 
				Возврат НСтр("ru='Частично подписан';uk='Частково підписано'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтоимостьТоваровПриОценкеРентабельностиПродажи" Тогда 
			Если ИмяДляПеревода = "ПоНормативномуВидуЦен" Тогда 
				Возврат НСтр("ru='По нормативному виду цен';uk='За нормативним видом цін'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоРасчетнойСебестоимости" Тогда 
				Возврат НСтр("ru='По расчетной себестоимости';uk='За розрахунковою собівартістю'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтратегииОтраженияВУчетеНачисленийУдержаний" Тогда 
			Если ИмяДляПеревода = "КакЗаданоВидуРасчета" Тогда 
				Возврат НСтр("ru='Как задано виду расчета';uk='Як задано виду розрахунку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоБазовымРасчетам" Тогда 
				Возврат НСтр("ru='По базовым расчетам';uk='За базовими розрахунками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоДаннымОСотрудникеИЕгоПлановыхНачислениях" Тогда 
				Возврат НСтр("ru='По данным о сотруднике и его плановых начислениях';uk='За даними про співробітника і його планових нарахуваннях'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СубъектыГражданскоПравовыхОтношений" Тогда 
			Если ИмяДляПеревода = "Агент" Тогда 
				Возврат НСтр("ru='Агент';uk='Агент'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Доверитель" Тогда 
				Возврат НСтр("ru='Доверитель';uk='Довіритель'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Комиссионер" Тогда 
				Возврат НСтр("ru='Комиссионер';uk='Комісіонер'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Комитент" Тогда 
				Возврат НСтр("ru='Комитент';uk='Комітент'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Поверенный" Тогда 
				Возврат НСтр("ru='Поверенный';uk='Повірений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Покупатель" Тогда 
				Возврат НСтр("ru='Покупатель';uk='Покупець'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Принципал" Тогда 
				Возврат НСтр("ru='Принципал';uk='Принципал'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Продавец" Тогда 
				Возврат НСтр("ru='Продавец';uk='Продавець'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТарифыМобильногоБанка" Тогда 
			Если ИмяДляПеревода = "Полный" Тогда 
				Возврат НСтр("ru='Полный';uk='Повний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Экономный" Тогда 
				Возврат НСтр("ru='Экономный';uk='Економний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипНалоговойДеятельности" Тогда 
			Если ИмяДляПеревода = "НеОблагаемый" Тогда 
				Возврат НСтр("ru='Не облагаемый';uk='Не оподатковуваний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОблагаемыйПоОбычнойСтавке" Тогда 
				Возврат НСтр("ru='Облагаемый по обычной ставке';uk='Оподатковуваний по звичайній ставці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсвобожденныйОтНалогообложения" Тогда 
				Возврат НСтр("ru='Освобожденный от налогообложения';uk='Звільнений від оподаткування'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипПоказателяБюджетов" Тогда 
			Если ИмяДляПеревода = "Расчетный" Тогда 
				Возврат НСтр("ru='Расчетный';uk='Розрахунковий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Целевой" Тогда 
				Возврат НСтр("ru='Целевой';uk='Цільовий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипПравилаПолученияФактическихДанныхБюджетирования" Тогда 
			Если ИмяДляПеревода = "ИсполнениеБюджета" Тогда 
				Возврат НСтр("ru='Исполнение бюджета';uk='Виконання бюджету'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсполнениеБюджетаИФактическиеДанные" Тогда 
				Возврат НСтр("ru='Исполнение бюджета и фактические данные';uk='Виконання бюджету і фактичні дані'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФактическиеДанные" Тогда 
				Возврат НСтр("ru='Фактические данные';uk='Фактичні дані'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыАнализаПоказателей" Тогда 
			Если ИмяДляПеревода = "ДинамикаИзменения" Тогда 
				Возврат НСтр("ru='Динамика изменения';uk='Динаміка зміни'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзмерениеТекущегоСостояния" Тогда 
				Возврат НСтр("ru='Измерение текущего состояния';uk='Вимірювання поточного стану'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокомпонентноеСравнение" Тогда 
				Возврат НСтр("ru='Покомпонентное сравнение (структура)';uk='Покомпонентне порівняння (структура)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокомпонентноеСравнениеДинамика" Тогда 
				Возврат НСтр("ru='Покомпонентное сравнение (динамика)';uk='Покомпонентне порівняння (динаміка)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СравнениеСПрошлымПериодом" Тогда 
				Возврат НСтр("ru='Сравнение с прошлым периодом';uk='Порівняння з минулим періодом'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыБазыРаспределенияРасходов" Тогда 
			Если ИмяДляПеревода = "ВводитсяЕжемесячно" Тогда 
				Возврат НСтр("ru='Вводится вручную ежемесячно';uk='Вводиться вручну щомісяця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВводитсяПриИзменении" Тогда 
				Возврат НСтр("ru='Вводится вручную при изменении';uk='Вводиться вручну при зміні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВесПродукции" Тогда 
				Возврат НСтр("ru='Вес продукции';uk='Вага продукції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВесУказанныхМатериалов" Тогда 
				Возврат НСтр("ru='Вес указанных материалов';uk='Вага зазначених матеріалів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КоличествоПродукции" Тогда 
				Возврат НСтр("ru='Количество продукции';uk='Кількість продукції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КоличествоРаботУказанныхВидов" Тогда 
				Возврат НСтр("ru='Количество работ указанных видов';uk='Кількість робіт зазначених видів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КоличествоУказанныхМатериалов" Тогда 
				Возврат НСтр("ru='Количество указанных материалов';uk='Кількість зазначених матеріалів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НормативРасходаМатериала" Тогда 
				Возврат НСтр("ru='Норматив расхода данного материала';uk='Норматив витрачання даного матеріалу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НормативыОплатыТруда" Тогда 
				Возврат НСтр("ru='Нормативная сумма расходов на оплату труда';uk='Нормативна сума витрат на оплату праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбъемПродукции" Тогда 
				Возврат НСтр("ru='Объем продукции';uk='Об'єм продукції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбъемУказанныхМатериалов" Тогда 
				Возврат НСтр("ru='Объем указанных материалов';uk='Об'єм зазначених матеріалів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПлановаяСтоимостьПродукции" Тогда 
				Возврат НСтр("ru='Плановая стоимость продукции';uk='Планова вартість продукції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаМатериальныхЗатрат" Тогда 
				Возврат НСтр("ru='Стоимость материальных затрат';uk='Вартість матеріальних витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СуммаРасходовНаОплатуТруда" Тогда 
				Возврат НСтр("ru='Сумма расходов на оплату труда';uk='Сума витрат на оплату праці'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыБлокировокСкладскихЯчеек" Тогда 
			Если ИмяДляПеревода = "Отбор" Тогда 
				Возврат НСтр("ru='Отбор';uk='Відбір'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Полная" Тогда 
				Возврат НСтр("ru='Полная';uk='Повна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Размещение" Тогда 
				Возврат НСтр("ru='Размещение';uk='Розміщення'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыВерсийОбъекта" Тогда 
			Если ИмяДляПеревода = "ИзмененоПользователем" Тогда 
				Возврат НСтр("ru='Изменено пользователем';uk='Змінено користувачем'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НепринятыеДанныеПоКоллизии" Тогда 
				Возврат НСтр("ru='Непринятые данные по коллизии';uk='Неприйняті дані по колізії'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НепринятыйПоДатеЗапретаОбъектНеСуществуетВБазе" Тогда 
				Возврат НСтр("ru='Непринятый по дате запрета объект не существует в базе';uk='Неприйнятий по даті заборони об'єкт не існує в базі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НепринятыйПоДатеЗапретаОбъектСуществуетВБазе" Тогда 
				Возврат НСтр("ru='Непринятый по дате запрета объект существует в базе';uk='Неприйнятий по даті заборони об'єкт існує в базі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПринятыеДанныеПоКоллизии" Тогда 
				Возврат НСтр("ru='Принятые данные по коллизии';uk='Прийняті дані по колізії'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыВладельцевЭЦП" Тогда 
			Если ИмяДляПеревода = "ГлавныйБухгалтер" Тогда 
				Возврат НСтр("ru='Главный бухгалтер';uk='Головний бухгалтер'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДругойСотрудник" Тогда 
				Возврат НСтр("ru='Другой сотрудник';uk='Інший співробітник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Руководитель" Тогда 
				Возврат НСтр("ru='Руководитель';uk='Керівник'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыВопросовШаблонаАнкеты" Тогда 
			Если ИмяДляПеревода = "ВопросСУсловием" Тогда 
				Возврат НСтр("ru='Вопрос с условием';uk='Питання з умовою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Простой" Тогда 
				Возврат НСтр("ru='Простой';uk='Простій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Табличный" Тогда 
				Возврат НСтр("ru='Табличный';uk='Табличний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыВыводимыхПоказателейБюджетногоОтчета" Тогда 
			Если ИмяДляПеревода = "Количество" Тогда 
				Возврат НСтр("ru='Количество';uk='Кількість'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КоличествоИСумма" Тогда 
				Возврат НСтр("ru='Количество, сумма';uk='Кількість, сума'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сумма" Тогда 
				Возврат НСтр("ru='Сумма';uk='Сума'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыВыданныхДоверенностей" Тогда 
			Если ИмяДляПеревода = "НаПолучениеДС" Тогда 
				Возврат НСтр("ru='На получение ДС';uk='На отримання грошових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаПолучениеПрочихМатериальныхЦенностей" Тогда 
				Возврат НСтр("ru='На получение прочих МЦ';uk='На отримання інших МЦ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаПолучениеТоваров" Тогда 
				Возврат НСтр("ru='На получение товаров';uk='На отримання товарів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыГражданскоПравовыхОтношений" Тогда 
			Если ИмяДляПеревода = "ДоверительПоверенный" Тогда 
				Возврат НСтр("ru='Доверитель - поверенный';uk='Довіритель - повірений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомитентКомиссионер" Тогда 
				Возврат НСтр("ru='Комитент - комиссионер';uk='Комітент - комісіонер""'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокупательПродавец" Тогда 
				Возврат НСтр("ru='Покупатель - продавец';uk='Покупець - продавець'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПринципалАгент" Тогда 
				Возврат НСтр("ru='Принципал - агент';uk='Принципал - агент'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыГрафикаКредитовИДепозитов" Тогда 
			Если ИмяДляПеревода = "Начисления" Тогда 
				Возврат НСтр("ru='Начисления';uk='Нарахування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оплаты" Тогда 
				Возврат НСтр("ru='Оплаты';uk='Оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Транши" Тогда 
				Возврат НСтр("ru='Транши';uk='Транші'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыДанныхКэшаПрограммныхИнтерфейсов" Тогда 
			Если ИмяДляПеревода = "ВерсииИнтерфейса" Тогда 
				Возврат НСтр("ru='Версии интерфейса';uk='Версії інтерфейсу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОписаниеWebСервиса" Тогда 
				Возврат НСтр("ru='Описание web-сервиса';uk='Опис web-сервісу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыДанныхУчета" Тогда 
			Если ИмяДляПеревода = "ДенежныеСредства" Тогда 
				Возврат НСтр("ru='Денежные средства';uk='Грошові кошти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоходыРасходы" Тогда 
				Возврат НСтр("ru='Доходы/Расходы';uk='Доходи/Витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Контрагенты" Тогда 
				Возврат НСтр("ru='Контрагенты';uk='Контрагенти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Номенклатура" Тогда 
				Возврат НСтр("ru='Номенклатура';uk='Номенклатура'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеАктивыПассивы" Тогда 
				Возврат НСтр("ru='Прочие активы/пассивы';uk='Інші активи/пасиви'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыДвиженияЗапасов" Тогда 
			Если ИмяДляПеревода = "Отгрузка" Тогда 
				Возврат НСтр("ru='Отгрузка';uk='Відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Поступление" Тогда 
				Возврат НСтр("ru='Поступление';uk='Надходження'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыДействийЭтаповПодготовкиБюджетов" Тогда 
			Если ИмяДляПеревода = "ВводПлана" Тогда 
				Возврат НСтр("ru='Ввод плана';uk='Введення плану'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВводЭкземпляраБюджета" Тогда 
				Возврат НСтр("ru='Ввод экземпляра бюджета';uk='Введення примірника бюджету'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПовторГруппыЭтапов" Тогда 
				Возврат НСтр("ru='Повтор группы этапов';uk='Повтор групи етапів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УстановкаЗначенийНефинансовыхПоказателей" Тогда 
				Возврат НСтр("ru='Установка значений нефинансовых показателей';uk='Встановлення значень нефінансових показників'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УстановкаЛимитовРасходаДС" Тогда 
				Возврат НСтр("ru='Установка лимитов расхода ДС';uk='Встановлення лімітів витрачань ГК'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УтверждениеБюджетов" Тогда 
				Возврат НСтр("ru='Утверждение бюджетов';uk='Затвердження бюджетів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыДенежныхСредств" Тогда 
			Если ИмяДляПеревода = "Безналичные" Тогда 
				Возврат НСтр("ru='Безналичные';uk='Безготівкові'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДенежныеДокументы" Тогда 
				Возврат НСтр("ru='Денежные документы';uk='Грошові документи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДенежныеСредстваВПути" Тогда 
				Возврат НСтр("ru='Денежные средства в пути';uk='Грошові кошти в дорозі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДенежныеСредстваУПодотчетногоЛица" Тогда 
				Возврат НСтр("ru='Денежные средства у подотчетного лица';uk='Грошові кошти у підзвітної особи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДенежныеСредстваУЭквайера" Тогда 
				Возврат НСтр("ru='Денежные средства у эквайера';uk='Грошові кошти у еквайєра'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Депозиты" Тогда 
				Возврат НСтр("ru='Депозиты';uk='Депозити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Наличные" Тогда 
				Возврат НСтр("ru='Наличные';uk='Готівка'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыДенежныхСредствПоЭквайрингу" Тогда 
			Если ИмяДляПеревода = "ПоступлениеПоПлатежнойКарте" Тогда 
				Возврат НСтр("ru='Поступление по платежной карте';uk='Надходження по платіжній карті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеПоПлатежнойКарте" Тогда 
				Возврат НСтр("ru='Списание по платежной карте';uk='Списання за платіжною карткою'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыДиаграммПоказателей" Тогда 
			Если ИмяДляПеревода = "Гистограмма" Тогда 
				Возврат НСтр("ru='Гистограмма';uk='Гістограма'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГистограммаГоризонтальная" Тогда 
				Возврат НСтр("ru='Гистограмма горизонтальная';uk='Гістограма горизонтальна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГистограммаГоризонтальнаяОбъемная" Тогда 
				Возврат НСтр("ru='Гистограмма горизонтальная объемная';uk='Гістограма горизонтальна об'ємна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГистограммаНормированная" Тогда 
				Возврат НСтр("ru='Гистограмма нормированная';uk='Гістограма нормована'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГистограммаНормированнаяГоризонтальная" Тогда 
				Возврат НСтр("ru='Гистограмма нормированная горизонтальная';uk='Гістограма нормована горизонтальна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГистограммаНормированнаяГоризонтальнаяОбъемная" Тогда 
				Возврат НСтр("ru='Гистограмма нормированная горизонтальная объемная';uk='Гістограма нормована горизонтальна об'ємна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГистограммаНормированнаяОбъемная" Тогда 
				Возврат НСтр("ru='Гистограмма нормированная объемная';uk='Гістограма нормована об'ємна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГистограммаОбъемная" Тогда 
				Возврат НСтр("ru='Гистограмма объемная';uk='Гістограма об'ємна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГистограммаСНакоплением" Тогда 
				Возврат НСтр("ru='Гистограмма с накоплением';uk='Гістограма з накопиченням'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГистограммаСНакоплениемГоризонтальная" Тогда 
				Возврат НСтр("ru='Гистограмма с накоплением горизонтальная';uk='Гістограма з накопиченням горизонтальна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГистограммаСНакоплениемГоризонтальнаяОбъемная" Тогда 
				Возврат НСтр("ru='Гистограмма с накоплением горизонтальная объемная';uk='Гістограма з накопиченням горизонтальна об'ємна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГистограммаСНакоплениемОбъемная" Тогда 
				Возврат НСтр("ru='Гистограмма с накоплением объемная';uk='Гістограма з накопиченням об'ємна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "График" Тогда 
				Возврат НСтр("ru='График';uk='Графік'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГрафикПоШагам" Тогда 
				Возврат НСтр("ru='График по шагам (ступенчатая)';uk='Графік по кроках (ступінчаста)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГрафикСНакоплением" Тогда 
				Возврат НСтр("ru='График с накоплением';uk='Графік з накопиченням'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГрафикСОбластями" Тогда 
				Возврат НСтр("ru='График с областями';uk='Графік з областями'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГрафикСОбластямиИНакоплением" Тогда 
				Возврат НСтр("ru='График с областями и накоплением';uk='Графік з областями й накопиченням'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГрафикСОбластямиНормированный" Тогда 
				Возврат НСтр("ru='График с областями нормированный';uk='Графік з областями нормований'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Измерительная" Тогда 
				Возврат НСтр("ru='Измерительная';uk='Вимірювальна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Круговая" Тогда 
				Возврат НСтр("ru='Круговая';uk='Кругова'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыДоговораКредитовИДепозитов" Тогда 
			Если ИмяДляПеревода = "ВкладСотрудника" Тогда 
				Возврат НСтр("ru='Вклад сотрудника';uk='Внесок співробітника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВнешнийЗайм" Тогда 
				Возврат НСтр("ru='Внешний займ';uk='Зовнішній займ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВнутреннийЗайм" Тогда 
				Возврат НСтр("ru='Внутренний займ';uk='Внутрішній займ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДепозитВБанке" Тогда 
				Возврат НСтр("ru='Депозит без капитализации';uk='Депозит без капіталізації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДепозитВБанкеСКапитализацией" Тогда 
				Возврат НСтр("ru='Депозит с капитализацией';uk='Депозит з капіталізацією'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КредитВБанке" Тогда 
				Возврат НСтр("ru='Кредит в банке';uk='Кредит у банку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КредитСотруднику" Тогда 
				Возврат НСтр("ru='Кредит сотруднику';uk='Кредит співробітникові'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыДоговоров" Тогда 
			Если ИмяДляПеревода = "Импорт" Тогда 
				Возврат НСтр("ru='Импорт';uk='Імпорт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИмпортКомиссия" Тогда 
				Возврат НСтр("ru='Импорт (комиссия)';uk='Імпорт (комісія)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СДавальцем" Тогда 
				Возврат НСтр("ru='С давальцем';uk='З давальцем'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СКомиссионером" Тогда 
				Возврат НСтр("ru='С комиссионером';uk='З комісіонером'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СКомитентом" Тогда 
				Возврат НСтр("ru='С комитентом';uk='З комітентом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СПереработчиком" Тогда 
				Возврат НСтр("ru='С переработчиком';uk='З переробником'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СПокупателем" Тогда 
				Возврат НСтр("ru='С покупателем / заказчиком';uk='З покупцем / замовником'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СПоставщиком" Тогда 
				Возврат НСтр("ru='С поставщиком / исполнителем';uk='З постачальником / виконавцем'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыДополнительныхРеквизитов" Тогда 
			Если ИмяДляПеревода = "ИдентификаторОтправителя" Тогда 
				Возврат НСтр("ru='Идентификатор отправителя';uk='Ідентифікатор відправника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИдентификаторПервичногоСообщения" Тогда 
				Возврат НСтр("ru='Идентификатор первичного сообщения';uk='Ідентифікатор первинного повідомлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИдентификаторПолучателя" Тогда 
				Возврат НСтр("ru='Идентификатор получателя';uk='Ідентифікатор одержувача'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИмяПередающейСистемы" Тогда 
				Возврат НСтр("ru='Имя передающей системы';uk='Ім'я передавальної системи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТипПередаваемойИнформации" Тогда 
				Возврат НСтр("ru='Тип передаваемой информации';uk='Тип інформації, що передається'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыЗадолженности" Тогда 
			Если ИмяДляПеревода = "Дебиторская" Тогда 
				Возврат НСтр("ru='Задолженность дебитора';uk='Заборгованість дебітора'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Кредиторская" Тогда 
				Возврат НСтр("ru='Задолженность перед кредитором';uk='Заборгованість перед кредитором'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыЗапасов" Тогда 
			Если ИмяДляПеревода = "АгентскаяУслуга" Тогда 
				Возврат НСтр("ru='Агентская услуга';uk='Агентська послуга'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомиссионныйТовар" Тогда 
				Возврат НСтр("ru='Комиссионный товар';uk='Комісійний товар'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Материал" Тогда 
				Возврат НСтр("ru='Материал';uk='Матеріал'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "МатериалДавальца" Тогда 
				Возврат НСтр("ru='Материал давальца';uk='Матеріал давальца'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродукцияДавальца" Тогда 
				Возврат НСтр("ru='Продукция давальца';uk='Продукція давальца'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Товар" Тогда 
				Возврат НСтр("ru='Собственный товар';uk='Власний товар'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Услуга" Тогда 
				Возврат НСтр("ru='Работа (Услуга)';uk='Робота (Послуга)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыЗатрат" Тогда 
			Если ИмяДляПеревода = "Амортизация" Тогда 
				Возврат НСтр("ru='Амортизация';uk='Амортизація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратныеОтходы" Тогда 
				Возврат НСтр("ru='Возвратные отходы';uk='Зворотні відходи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Материальные" Тогда 
				Возврат НСтр("ru='Материальные';uk='Матеріальні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаТруда" Тогда 
				Возврат НСтр("ru='Оплата труда';uk='Оплата праці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыЗатратРегл" Тогда 
			Если ИмяДляПеревода = "МатериальныеЗатраты" Тогда 
				Возврат НСтр("ru='Материальные затраты';uk='Матеріальні витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Работы" Тогда 
				Возврат НСтр("ru='Работы';uk='Роботи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СдельнаяОплатаТруда" Тогда 
				Возврат НСтр("ru='Сдельная оплата труда';uk='Відрядна оплата праці'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыЗначенийКатегорийНовостей" Тогда 
			Если ИмяДляПеревода = "Булево" Тогда 
				Возврат НСтр("ru='Булево';uk='Булево'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Дата" Тогда 
				Возврат НСтр("ru='Дата';uk='Дата'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СправочникСсылка_ЗначенияКатегорийНовостей" Тогда 
				Возврат НСтр("ru='Значения категорий новостей';uk='Значення категорій новин'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СправочникСсылка_ИнтервалыВерсийПродукта" Тогда 
				Возврат НСтр("ru='Интервалы версий продукта';uk='Інтервали версій продукту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Строка" Тогда 
				Возврат НСтр("ru='Строка';uk='Рядок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Число" Тогда 
				Возврат НСтр("ru='Число';uk='Число'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыЗначенийПоказателейБюджетногоОтчета" Тогда 
			Если ИмяДляПеревода = "КонечныйОстаток" Тогда 
				Возврат НСтр("ru='Конечный остаток';uk='Кінцевий залишок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачальныйОстаток" Тогда 
				Возврат НСтр("ru='Начальный остаток';uk='Початковий залишок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оборот" Тогда 
				Возврат НСтр("ru='Оборот';uk='Оборот'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Приход" Тогда 
				Возврат НСтр("ru='Приход';uk='Надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Расход" Тогда 
				Возврат НСтр("ru='Расход';uk='Видаток'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыИзмеренийФинансовогоОтчета" Тогда 
			Если ИмяДляПеревода = "Аналитика" Тогда 
				Возврат НСтр("ru='Аналитика';uk='Аналітика'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Валюта" Тогда 
				Возврат НСтр("ru='Валюта';uk='Валюта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзмерениеРегистра" Тогда 
				Возврат НСтр("ru='Измерение регистра';uk='Вимірювання регістра'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзмерениеРегистраБухгалтерии" Тогда 
				Возврат НСтр("ru='Измерение регистра бухгалтерии';uk='Вимірювання регістра бухгалтерії'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Организация" Тогда 
				Возврат НСтр("ru='Организация';uk='Організація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Период" Тогда 
				Возврат НСтр("ru='Период';uk='Період'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Подразделение" Тогда 
				Возврат НСтр("ru='Подразделение';uk='Підрозділ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Субконто" Тогда 
				Возврат НСтр("ru='Субконто';uk='Субконто'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сценарий" Тогда 
				Возврат НСтр("ru='Сценарий';uk='Сценарій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФиксированнаяАналитика" Тогда 
				Возврат НСтр("ru='Фиксированная аналитика';uk='Фіксована аналітика'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыИзмеряемыхВеличин" Тогда 
			Если ИмяДляПеревода = "Вес" Тогда 
				Возврат НСтр("ru='Вес';uk='Вага'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Длина" Тогда 
				Возврат НСтр("ru='Длина';uk='Довжина'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КоличествоШтук" Тогда 
				Возврат НСтр("ru='Количество штук';uk='Кількість штук'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Объем" Тогда 
				Возврат НСтр("ru='Объем';uk='Об'єм'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Площадь" Тогда 
				Возврат НСтр("ru='Площадь';uk='Площа'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Упаковка" Тогда 
				Возврат НСтр("ru='Упаковка';uk='Упаковка'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыИсполнителейЗаданийНаПеревозку" Тогда 
			Если ИмяДляПеревода = "НашаТранспортнаяСлужба" Тогда 
				Возврат НСтр("ru='Наша транспортная служба';uk='Наша транспортна служба'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Перевозчик" Тогда 
				Возврат НСтр("ru='Перевозчик';uk='Перевізник'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыИсточниковУточненияСчета" Тогда 
			Если ИмяДляПеревода = "ГруппаФинансовогоУчетаДенежныхСредств" Тогда 
				Возврат НСтр("ru='Группа финансового учета денежных средств';uk='Група фінансового обліку коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГруппаФинансовогоУчетаДенежныхСредствДебета" Тогда 
				Возврат НСтр("ru='Группа финансового учета денежных средств дебета';uk='Група фінансового обліку грошових коштів дебету'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГруппаФинансовогоУчетаДенежныхСредствКредита" Тогда 
				Возврат НСтр("ru='Группа финансового учета денежных средств кредита';uk='Група фінансового обліку грошових коштів кредиту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГруппаФинансовогоУчетаДоходовРасходов" Тогда 
				Возврат НСтр("ru='Группа финансового учета доходов/расходов';uk='Група фінансового обліку доходів/витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГруппаФинансовогоУчетаДоходовРасходовДебета" Тогда 
				Возврат НСтр("ru='Группа финансового учета доходов/расходов дебета';uk='Група фінансового обліку доходів/витрат дебету'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГруппаФинансовогоУчетаДоходовРасходовКредита" Тогда 
				Возврат НСтр("ru='Группа финансового учета доходов/расходов кредита';uk='Група фінансового обліку доходів/витрат кредиту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГруппаФинансовогоУчетаНоменклатуры" Тогда 
				Возврат НСтр("ru='Группа финансового учета номенклатуры';uk='Група фінансового обліку номенклатури'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГруппаФинансовогоУчетаНоменклатурыДебета" Тогда 
				Возврат НСтр("ru='Группа финансового учета номенклатуры дебета';uk='Група фінансового обліку номенклатури дебету'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГруппаФинансовогоУчетаНоменклатурыКредита" Тогда 
				Возврат НСтр("ru='Группа финансового учета номенклатуры кредита';uk='Група фінансового обліку номенклатури кредиту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГруппаФинансовогоУчетаРасчетов" Тогда 
				Возврат НСтр("ru='Группа финансового учета расчетов';uk='Група фінансового обліку розрахунків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГруппаФинансовогоУчетаРасчетовДебета" Тогда 
				Возврат НСтр("ru='Группа финансового учета расчетов дебета';uk='Група фінансового обліку розрахунків дебету'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГруппаФинансовогоУчетаРасчетовКредита" Тогда 
				Возврат НСтр("ru='Группа финансового учета расчетов кредита';uk='Група фінансового обліку розрахунків кредиту'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыИтогов" Тогда 
			Если ИмяДляПеревода = "Оборот" Тогда 
				Возврат НСтр("ru='Оборот';uk='Оборот'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОборотДт" Тогда 
				Возврат НСтр("ru='Оборот Дт';uk='Оборот Дт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОборотКт" Тогда 
				Возврат НСтр("ru='Оборот Кт';uk='Оборот Кт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сальдо" Тогда 
				Возврат НСтр("ru='Сальдо';uk='Сальдо'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СальдоДт" Тогда 
				Возврат НСтр("ru='Сальдо Дт';uk='Сальдо Дт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СальдоКт" Тогда 
				Возврат НСтр("ru='Сальдо Кт';uk='Сальдо Кт'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыКарт" Тогда 
			Если ИмяДляПеревода = "Магнитная" Тогда 
				Возврат НСтр("ru='Магнитная';uk='Магнітна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Смешанная" Тогда 
				Возврат НСтр("ru='Смешанная';uk='Змішана'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Штриховая" Тогда 
				Возврат НСтр("ru='Штриховая';uk='Штрихова'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыКассККМ" Тогда 
			Если ИмяДляПеревода = "АвтономнаяККМ" Тогда 
				Возврат НСтр("ru='Автономная ККМ';uk='Автономна ККМ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ККМOffline" Тогда 
				Возврат НСтр("ru='ККМ Offline';uk='ККМ Offlіne'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФискальныйРегистратор" Тогда 
				Возврат НСтр("ru='Фискальный регистратор';uk='Фіскальний реєстратор'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыКлассификации" Тогда 
			Если ИмяДляПеревода = "ABC" Тогда 
				Возврат НСтр("ru='ABC';uk='ABC'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "XYZ" Тогда 
				Возврат НСтр("ru='XYZ';uk='XYZ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыКодовКарт" Тогда 
			Если ИмяДляПеревода = "МагнитныйКод" Тогда 
				Возврат НСтр("ru='Магнитный код';uk='Магнітний код'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Штрихкод" Тогда 
				Возврат НСтр("ru='Штрихкод';uk='Штрихкод'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыКомиссииКредитовИДепозитов" Тогда 
			Если ИмяДляПеревода = "Нет" Тогда 
				Возврат НСтр("ru='Нет';uk='Ні'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизвольныйГрафик" Тогда 
				Возврат НСтр("ru='По графику';uk='За графіком'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Процент" Тогда 
				Возврат НСтр("ru='Процент';uk='Відсоток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Сумма" Тогда 
				Возврат НСтр("ru='Сумма';uk='Сума'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыКонтактнойИнформации" Тогда 
			Если ИмяДляПеревода = "Skype" Тогда 
				Возврат НСтр("ru='Skype';uk='Skype'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Адрес" Тогда 
				Возврат НСтр("ru='Адрес';uk='Адреса'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АдресЭлектроннойПочты" Тогда 
				Возврат НСтр("ru='Адрес электронной почты';uk='Адреса електронної пошти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВебСтраница" Тогда 
				Возврат НСтр("ru='Веб страница';uk='Веб сторінка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Другое" Тогда 
				Возврат НСтр("ru='Другое';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Телефон" Тогда 
				Возврат НСтр("ru='Телефон';uk='Телефон'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Факс" Тогда 
				Возврат НСтр("ru='Факс';uk='Факс'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыКриптоПровайдеров" Тогда 
			Если ИмяДляПеревода = "CryptoPro" Тогда 
				Возврат НСтр("ru='Crypto pro';uk='Crypto pro'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "VipNet" Тогда 
				Возврат НСтр("ru='Vip net';uk='Vip net'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыЛимитовРасходованияДС" Тогда 
			Если ИмяДляПеревода = "ДополнительноОграничивающий" Тогда 
				Возврат НСтр("ru='Дополнительно ограничивающий';uk='Додатково обмежує'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Информационный" Тогда 
				Возврат НСтр("ru='Информационный';uk='Інформаційний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазрешающийВПределахЛимита" Тогда 
				Возврат НСтр("ru='Разрешающий в пределах лимита';uk='Дозволяючий в межах ліміту'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыЛистовКассовойКниги" Тогда 
			Если ИмяДляПеревода = "Обычный" Тогда 
				Возврат НСтр("ru='Обычный';uk='Звичайний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоследнийВГоду" Тогда 
				Возврат НСтр("ru='Последний в году';uk='Останній в році'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоследнийВМесяце" Тогда 
				Возврат НСтр("ru='Последний в месяце';uk='Останній в місяці'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыНалогов" Тогда 
			Если ИмяДляПеревода = "ВоенныйСбор" Тогда 
				Возврат НСтр("ru='Военный сбор';uk='Військовий збір'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачисленныйЕСВ" Тогда 
				Возврат НСтр("ru='Начисленный ЕСВ';uk='Нарахований ЄСВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛ" Тогда 
				Возврат НСтр("ru='НДФЛ при исполнении обязанностей налогового агента';uk='ПДФО при виконанні обов'язків податкового агента'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛДоначисленныйПоРезультатамПроверки" Тогда 
				Возврат НСтр("ru='НДФЛ, доначисленный по результатам проверки';uk='ПДФО, донарахований за результатами перевірки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛДоходыКонтрагентов" Тогда 
				Возврат НСтр("ru='НДФЛ с доходов контрагентов';uk='ПДФО з доходів контрагентів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛПередачаЗадолженностиВНалоговыйОрган" Тогда 
				Возврат НСтр("ru='НДФЛ передача задолженности в налоговый орган';uk='ПДФО передача заборгованості в податковий орган'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДФЛПрочиеРасчетыСПерсоналом" Тогда 
				Возврат НСтр("ru='НДФЛ с доходов по прочим операциям с персоналом';uk='ПДФО з доходів за іншими операціями з персоналом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НФДЛДивиденды" Тогда 
				Возврат НСтр("ru='НДФЛ с дивидендов';uk='ПДФО з дивідендів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НФДЛДивидендыСотрудникам" Тогда 
				Возврат НСтр("ru='НДФЛ с дивидендов работникам';uk='ПДФО з дивідендів працівникам'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыНалогообложенияНДС" Тогда 
			Если ИмяДляПеревода = "ПоФактическомуИспользованию" Тогда 
				Возврат НСтр("ru='По фактическому использованию';uk='По фактичному використанню'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродажаНаЭкспорт" Тогда 
				Возврат НСтр("ru='Продажа на экспорт (ставка 0%)';uk='Продаж на експорт (ставка 0%)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродажаНеОблагаетсяНДС" Тогда 
				Возврат НСтр("ru='Поставка не облагается НДС';uk='Постачання не оподатковується ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродажаОблагаетсяНДС" Тогда 
				Возврат НСтр("ru='Поставка облагается НДС по основной ставке';uk='Постачання оподатковується ПДВ за основною ставкою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродажаОсвобожденаОтНДС" Тогда 
				Возврат НСтр("ru='Поставка освобождена от НДС';uk='Постачання звільнено від ПДВ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыНачисленийПоЛизингу" Тогда 
			Если ИмяДляПеревода = "АрендныеОбязательства" Тогда 
				Возврат НСтр("ru='Арендные обязательства';uk='Орендні зобов'язання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыкупПредметаЛизинга" Тогда 
				Возврат НСтр("ru='Выкуп предмета лизинга';uk='Викуп предмета лізингу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗачетОбеспечительногоПлатежа" Тогда 
				Возврат НСтр("ru='Зачет обеспечительного платежа';uk='Залік забезпечувального платежу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УслугаПоЛизингу" Тогда 
				Возврат НСтр("ru='Услуга по лизингу';uk='Послуга по лізингу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыНоменклатуры" Тогда 
			Если ИмяДляПеревода = "МногооборотнаяТара" Тогда 
				Возврат НСтр("ru='Тара';uk='Тара'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Набор" Тогда 
				Возврат НСтр("ru='Набор';uk='Набір'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Работа" Тогда 
				Возврат НСтр("ru='Работа';uk='Робота'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Товар" Тогда 
				Возврат НСтр("ru='Товар';uk='Товар'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Услуга" Тогда 
				Возврат НСтр("ru='Услуга';uk='Послуга'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыОбеспечения" Тогда 
			Если ИмяДляПеревода = "Перемещение" Тогда 
				Возврат НСтр("ru='Перемещение';uk='Переміщення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Покупка" Тогда 
				Возврат НСтр("ru='Покупка';uk='Покупка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Производство" Тогда 
				Возврат НСтр("ru='Собственное производство';uk='Власне виробництво'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизводствоНаСтороне" Тогда 
				Возврат НСтр("ru='Производство силами переработчика';uk='Виробництво силами переробника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СборкаРазборка" Тогда 
				Возврат НСтр("ru='Сборка/разборка';uk='Збирання/розбирання'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыОбеспеченияКредитовИДепозитов" Тогда 
			Если ИмяДляПеревода = "Залог" Тогда 
				Возврат НСтр("ru='Залог';uk='Застава'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Поручительство" Тогда 
				Возврат НСтр("ru='Поручительство';uk='Порука'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыОперацийВводаОстатков" Тогда 
			Если ИмяДляПеревода = "ОптовыеПродажиЗаПрошлыеПериоды" Тогда 
				Возврат НСтр("ru='Оптовые продажи за прошлые периоды';uk='Гуртові продажі за минулі періоди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиАрендованныхОС" Тогда 
				Возврат НСтр("ru='Арендованные основные средства';uk='Орендовані основні засоби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиВАвтономныхКассахККМКОформлениюОтчетовОРозничныхПродажах" Тогда 
				Возврат НСтр("ru='В автономных ККМ к оформлению отчетов о продажах';uk='В автономних ККМ до оформлення звітів про продажі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиВАвтономныхКассахККМПоРозничнойВыручке" Тогда 
				Возврат НСтр("ru='В автономных ККМ';uk='В автономних ККМ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиВзаиморасчетовПоДоговорамЛизинга" Тогда 
				Возврат НСтр("ru='Взаиморасчеты по договорам лизинга';uk='Взаєморозрахунки за договорами лізингу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиВКассах" Тогда 
				Возврат НСтр("ru='В кассах';uk='У касах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиВозвратнойТарыПереданнойКлиентам" Тогда 
				Возврат НСтр("ru='Переданная клиентам возвратная тара';uk='Передана клієнтам зворотна тара'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиВозвратнойТарыПринятойОтПоставщиков" Тогда 
				Возврат НСтр("ru='Принятая от поставщиков возвратная тара';uk='Прийнята від постачальників зворотна тара'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиЗадолженностиКлиентов" Тогда 
				Возврат НСтр("ru='Задолженность клиентов';uk='Заборгованість клієнтів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиЗадолженностиПередПоставщиками" Тогда 
				Возврат НСтр("ru='Задолженность перед поставщиками';uk='Заборгованість перед постачальниками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиЗадолженностиПодотчетников" Тогда 
				Возврат НСтр("ru='Долг подотчетных лиц';uk='Борг підзвітних осіб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиМатериаловПереданныхВПроизводство" Тогда 
				Возврат НСтр("ru='Переданные в производство материалы';uk='Передані у виробництво матеріали'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиМатериаловПереданныхПереработчикам" Тогда 
				Возврат НСтр("ru='Переданные переработчикам материалы';uk='Передані переробникам матеріали'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиНаБанковскихСчетах" Тогда 
				Возврат НСтр("ru='На банковских счетах';uk='На банківських рахунках'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиНМА" Тогда 
				Возврат НСтр("ru='Нематериальные активы';uk='Нематеріальні активи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиОС" Тогда 
				Возврат НСтр("ru='Основные средства';uk='Основні засоби'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиПоАвансамКлиентов" Тогда 
				Возврат НСтр("ru='Авансы, полученные от клиентов';uk='Аванси, отримані від клієнтів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиПоАвансамПоставщикам" Тогда 
				Возврат НСтр("ru='Авансы, выданные поставщикам';uk='Аванси, видані постачальникам'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиПоДоговорамКредитовИДепозитов" Тогда 
				Возврат НСтр("ru='Договоры кредитов, депозитов и выданных займов';uk='Договори кредитів, депозитів і виданих позик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиПредметовЛизингаЗаБалансом" Тогда 
				Возврат НСтр("ru='Предметы лизинга за балансом';uk='Предмети лізингу за балансом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиПредметовЛизингаНаБалансе" Тогда 
				Возврат НСтр("ru='Предметы лизинга на балансе';uk='Предмети лізингу на балансі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиПрочихАктивовПассивов" Тогда 
				Возврат НСтр("ru='Прочие активы и пассивы';uk='Інші активи та пасиви'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиПрочихРасходов" Тогда 
				Возврат НСтр("ru='Прочие расходы';uk='Інші витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиРасчетовМеждуОрганизациямиПоАвансам" Тогда 
				Возврат НСтр("ru='Расчеты между организациями по авансам';uk='Розрахунки між організаціями за авансами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиРасчетовМеждуОрганизациямиПоРеализациям" Тогда 
				Возврат НСтр("ru='Расчеты между организациями по реализациям';uk='Розрахунки між організаціями за реалізаціями'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиСобственныхТоваров" Тогда 
				Возврат НСтр("ru='Собственные товары';uk='Власні товари'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиТМЦВЭксплуатации" Тогда 
				Возврат НСтр("ru='ТМЦ в эксплуатации';uk='ТМЦ в експлуатації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиТоваровПереданныхНаКомиссию" Тогда 
				Возврат НСтр("ru='Переданные на комиссию товары';uk='Передані на комісію товари'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОстаткиТоваровПолученныхНаКомиссию" Тогда 
				Возврат НСтр("ru='Полученные на комиссию товары';uk='Отримані на комісію товари'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПерерасходыПодотчетныхСредств" Тогда 
				Возврат НСтр("ru='Перерасходы подотчетных средств';uk='Перевитрати підзвітних засобів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереходНаИспользованиеАдресногоХраненияОстатков" Тогда 
				Возврат НСтр("ru='Переход на использование адресного хранения остатков';uk='Перехід на використання адресного зберігання залишків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереходНаИспользованиеСкладскихПомещений" Тогда 
				Возврат НСтр("ru='Переход на использование складских помещений';uk='Перехід на використання складських приміщень'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПодарочныеСертификаты" Тогда 
				Возврат НСтр("ru='Подарочные сертификаты';uk='Подарункові сертифікати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РозничныеПродажиЗаПрошлыеПериоды" Тогда 
				Возврат НСтр("ru='Розничные продажи за прошлые периоды';uk='Роздрібні продажі за минулі періоди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СторноОтчетовПоЭквайрингу" Тогда 
				Возврат НСтр("ru='Сторно отчетов по эквайрингу';uk='Сторно звітів з еквайрингу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьОстаткиВозвратнойТарыПринятойОтПоставщиковНаАдресномСкладе" Тогда 
				Возврат НСтр("ru='Принятая от поставщиков возвратная тара на адресных складах (архив)';uk='Прийнята від постачальників зворотна тара на адресних складах (архів)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УДАЛИТЬОстаткиЗадолженностиПодотчетниковПоНаличнымРасчетам" Тогда 
				Возврат НСтр("ru='(не используется) Долг подотчетных лиц по наличным расчетам';uk='(не використовується) Борг підзвітних осіб за готівковими розрахунками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьОстаткиСобственныхТоваровНаАдресномСкладе" Тогда 
				Возврат НСтр("ru='Собственные товары на адресных складах (архив)';uk='Власні товари на адресних складах (архів)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьОстаткиТоваровПолученныхНаКомиссиюНаАдресномСкладе" Тогда 
				Возврат НСтр("ru='Полученные на комиссию товары на адресных складах (архив)';uk='Отримані на комісію товари на адресних складах (архів)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФинансовыйРезультатЗаПрошлыеПериоды" Тогда 
				Возврат НСтр("ru='Финансовый результат за прошлые периоды';uk='Фінансовий результат за минулі періоди'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыОперацийЗаказаНаСборку" Тогда 
			Если ИмяДляПеревода = "РазборкаНаКомплектующие" Тогда 
				Возврат НСтр("ru='Разборка на комплектующие';uk='Розбирання на комплектуючі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СборкаИзКомплектующих" Тогда 
				Возврат НСтр("ru='Сборка из комплектующих';uk='Збирання з комплектуючих'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыОС" Тогда 
			Если ИмяДляПеревода = "КапитальноеВложение" Тогда 
				Возврат НСтр("ru='Капитальное вложение в арендованное недвижимое имущество';uk='Капітальне вкладення в орендоване нерухоме майно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбъектОС" Тогда 
				Возврат НСтр("ru='Объект основных средств';uk='Об'єкт основних засобів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыОснованияАктаОРасхождении" Тогда 
			Если ИмяДляПеревода = "ВозвратПоставщику" Тогда 
				Возврат НСтр("ru='Возврат поставщику';uk='Повернення постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратТоваровОтКлиента" Тогда 
				Возврат НСтр("ru='Возврат товаров от клиента';uk='Повернення товарів від клієнта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеТоваровУслуг" Тогда 
				Возврат НСтр("ru='Поступление товаров услуг';uk='Надходження товарів і послуг'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияТоваровУслуг" Тогда 
				Возврат НСтр("ru='Реализация товаров услуг';uk='Реалізація товарів і послуг'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыОтветовНаВопрос" Тогда 
			Если ИмяДляПеревода = "Булево" Тогда 
				Возврат НСтр("ru='Булево';uk='Булево'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Дата" Тогда 
				Возврат НСтр("ru='Дата';uk='Дата'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗначениеИнформационнойБазы" Тогда 
				Возврат НСтр("ru='Значение информационной базы';uk='Значення інформаційної бази'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НесколькоВариантовИз" Тогда 
				Возврат НСтр("ru='Выбор нескольких вариантов ответа из предложенных';uk='Вибір декількох варіантів відповіді із запропонованих'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОдинВариантИз" Тогда 
				Возврат НСтр("ru='Выбор одного варианта ответа из предложенных';uk='Вибір одного варіанта відповіді із запропонованих'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Строка" Тогда 
				Возврат НСтр("ru='Строка';uk='Рядок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Текст" Тогда 
				Возврат НСтр("ru='Текст';uk='Текст'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Число" Тогда 
				Возврат НСтр("ru='Число';uk='Число'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыОтветственныхЛиц" Тогда 
			Если ИмяДляПеревода = "ГлавныйБухгалтер" Тогда 
				Возврат НСтр("ru='Главный бухгалтер';uk='Головний бухгалтер'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Кассир" Тогда 
				Возврат НСтр("ru='Кассир';uk='Касир'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Кладовщик" Тогда 
				Возврат НСтр("ru='Кладовщик';uk='Комірник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Руководитель" Тогда 
				Возврат НСтр("ru='Руководитель';uk='Керівник'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыОтчетов" Тогда 
			Если ИмяДляПеревода = "Внешний" Тогда 
				Возврат НСтр("ru='Внешний';uk='Зовнішній'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Внутренний" Тогда 
				Возврат НСтр("ru='Внутренний';uk='Внутрішній'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Дополнительный" Тогда 
				Возврат НСтр("ru='Дополнительный';uk='Додатковий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Расширение" Тогда 
				Возврат НСтр("ru='Расширение';uk='Розширення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьОтчет" Тогда 
				Возврат НСтр("ru='(не используется) Отчет';uk='(не використовується) Звіт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдалитьПользовательский" Тогда 
				Возврат НСтр("ru='(не используется) Пользовательский';uk='(не використовується) Користувацький'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыОформляемыхОбластейБюджетныхОтчетов" Тогда 
			Если ИмяДляПеревода = "ВсяКолонка" Тогда 
				Возврат НСтр("ru='Вся колонка';uk='Вся колонка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВсяСтрока" Тогда 
				Возврат НСтр("ru='Вся строка';uk='Весь рядок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВсяТаблица" Тогда 
				Возврат НСтр("ru='Вся таблица';uk='Вся таблиця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаголовкиКолонок" Тогда 
				Возврат НСтр("ru='Заголовки колонок';uk='Заголовки колонок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаголовкиСтрок" Тогда 
				Возврат НСтр("ru='Заголовки строк';uk='Заголовки рядків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЯчейкиНаПересеченииСтрокИКолонок" Тогда 
				Возврат НСтр("ru='Ячейки на пересечении строк и колонок';uk='Комірки на перетині рядків і колонок'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыОценочныхОбязательств" Тогда 
			Если ИмяДляПеревода = "ОценочныеОбязательстваПоВзносамФССНСиПЗ" Тогда 
				Возврат НСтр("ru='Оценочные обязательства по взносам в ФСС от НС и ПЗ';uk='Оціночні зобов'язання за внесками до ФСС від НВ та ПЗ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОценочныеОбязательстваПоВознаграждениям" Тогда 
				Возврат НСтр("ru='Оценочные обязательства по вознаграждениям';uk='Оціночні зобов'язання з винагород'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОценочныеОбязательстваПоСтраховымВзносам" Тогда 
				Возврат НСтр("ru='Оценочные обязательства по страховым взносам';uk='Оціночні зобов'язання за страховими внесками'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыПараметровКлассификации" Тогда 
			Если ИмяДляПеревода = "ВаловаяПрибыль" Тогда 
				Возврат НСтр("ru='Валовая прибыль';uk='Валовий прибуток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Выручка" Тогда 
				Возврат НСтр("ru='Выручка';uk='Виторг'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Количество" Тогда 
				Возврат НСтр("ru='Количество';uk='Кількість'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыПланов" Тогда 
			Если ИмяДляПеревода = "ПланЗакупок" Тогда 
				Возврат НСтр("ru='План закупок';uk='План купівель'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПланПродаж" Тогда 
				Возврат НСтр("ru='План продаж';uk='План продажів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПланПродажПоКатегориям" Тогда 
				Возврат НСтр("ru='План продаж по категориям';uk='План продажів по категоріях'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПланПроизводства" Тогда 
				Возврат НСтр("ru='План производства';uk='План виробництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПланСборкиРазборки" Тогда 
				Возврат НСтр("ru='План сборки (разборки)';uk='План збирання (розбирання)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыПлатежейПоЛизингу" Тогда 
			Если ИмяДляПеревода = "ВыкупПредметаЛизинга" Тогда 
				Возврат НСтр("ru='Выкуп предмета лизинга';uk='Викуп предмета лізингу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЛизинговыйПлатеж" Тогда 
				Возврат НСтр("ru='Лизинговый платеж';uk='Лізинговий платіж'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбеспечительныйПлатеж" Тогда 
				Возврат НСтр("ru='Обеспечительный платеж';uk='Забезпечувальний платіж'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыПлатежныхДокументов" Тогда 
			Если ИмяДляПеревода = "Аккредитив" Тогда 
				Возврат НСтр("ru='Аккредитив';uk='Акредитив'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "БанковскийОрдер" Тогда 
				Возврат НСтр("ru='Банковский ордер';uk='Банківський ордер'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИнкассовоеПоручение" Тогда 
				Возврат НСтр("ru='Инкассовое поручение';uk='Інкасове доручення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПлатежноеПоручение" Тогда 
				Возврат НСтр("ru='Платежное поручение';uk='Платіжне доручення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПлатежноеТребование" Тогда 
				Возврат НСтр("ru='Платежное требование';uk='Платіжна вимога'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПлатежноеТребованиеПоручение" Тогда 
				Возврат НСтр("ru='Платежное требование-поручение';uk='Платіжна вимога-доручення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПлатежныйОрдер" Тогда 
				Возврат НСтр("ru='Платежный ордер';uk='Платіжний ордер'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыПодключаемогоОборудования" Тогда 
			Если ИмяДляПеревода = "WebСервисОборудование" Тогда 
				Возврат НСтр("ru='Web-сервис оборудование';uk='Web-сервіс обладнання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВесыСПечатьюЭтикеток" Тогда 
				Возврат НСтр("ru='Весы с печатью этикеток';uk='Ваги з друком етикеток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДисплейПокупателя" Тогда 
				Возврат НСтр("ru='Дисплеи покупателя';uk='Дисплеї покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ККМOffline" Тогда 
				Возврат НСтр("ru='ККМ Offline';uk='ККМ Offlіne'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПринтерЧеков" Тогда 
				Возврат НСтр("ru='Принтеры чеков';uk='Принтери чеків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПринтерЭтикеток" Тогда 
				Возврат НСтр("ru='Принтеры этикеток';uk='Принтери етикеток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СканерШтрихкода" Тогда 
				Возврат НСтр("ru='Сканеры штрихкода';uk='Сканери штрихкоду'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчитывательМагнитныхКарт" Тогда 
				Возврат НСтр("ru='Считыватели магнитных карт';uk='Зчитувачі магнітних карт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТерминалСбораДанных" Тогда 
				Возврат НСтр("ru='Терминалы сбора данных';uk='Термінали збору даних'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФискальныйРегистратор" Тогда 
				Возврат НСтр("ru='Фискальные регистраторы';uk='Фіскальні реєстратори'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭквайринговыйТерминал" Тогда 
				Возврат НСтр("ru='Эквайринговые терминалы';uk='Еквайрингові термінали'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЭлектронныеВесы" Тогда 
				Возврат НСтр("ru='Электронные весы';uk='Електронні ваги'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыПоказателейРасчетаЗарплаты" Тогда 
			Если ИмяДляПеревода = "Денежный" Тогда 
				Возврат НСтр("ru='Денежный';uk='Грошовий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Числовой" Тогда 
				Возврат НСтр("ru='Числовой';uk='Числовий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧисловойЗависящийОтДругогоПоказателя" Тогда 
				Возврат НСтр("ru='Числовой, зависящий от другого показателя';uk='Число, що залежить від іншого показника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧисловойЗависящийОтСтажа" Тогда 
				Возврат НСтр("ru='Числовой, зависящий от стажа';uk='Число, що залежить від стажу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыПолитикУказанияСерий" Тогда 
			Если ИмяДляПеревода = "АвторасчетПоFEFOОстатковСерий" Тогда 
				Возврат НСтр("ru='Авторасчет по FEFO остатков серий';uk='Авторозрахунок за FEFO залишків серій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СправочноеУказаниеСерий" Тогда 
				Возврат НСтр("ru='Справочное указание серий';uk='Довідкове зазначення серій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УправлениеОстаткамиСерий" Тогда 
				Возврат НСтр("ru='Управление остатками серий';uk='Управління залишками серій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УправлениеПоFEFOОстаткамиСерий" Тогда 
				Возврат НСтр("ru='Управление по FEFO остатками серий';uk='Управління по FEFO залишками серій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УчетСебестоимостиПоСериям" Тогда 
				Возврат НСтр("ru='Учет себестоимости по сериям';uk='Облік собівартості по серіях'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыПредназначенияВидовЗапасов" Тогда 
			Если ИмяДляПеревода = "ПредназначенДляЗаказа" Тогда 
				Возврат НСтр("ru='Предназначен для заказа';uk='Призначений для замовлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредназначенДляМенеджера" Тогда 
				Возврат НСтр("ru='Предназначен для менеджера';uk='Призначений для менеджера'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредназначенДляПодразделения" Тогда 
				Возврат НСтр("ru='Предназначен для подразделения';uk='Призначений для підрозділу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредназначенДляСделки" Тогда 
				Возврат НСтр("ru='Предназначен для сделки';uk='Призначений для угоди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредназначениеНеОграничено" Тогда 
				Возврат НСтр("ru='Предназначение не ограничено';uk='Призначення не обмежено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыПроблемОбменаДанными" Тогда 
			Если ИмяДляПеревода = "НезаполненныеРеквизиты" Тогда 
				Возврат НСтр("ru='Незаполненные реквизиты';uk='Незаповнені реквізити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НепроведенныйДокумент" Тогда 
				Возврат НСтр("ru='Непроведенный документ';uk='Непроведений документ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыПроводокМеждународныйУчет" Тогда 
			Если ИмяДляПеревода = "Корректировка" Тогда 
				Возврат НСтр("ru='Корректировка';uk='Коригування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Начисление" Тогда 
				Возврат НСтр("ru='Начисление';uk='Нарахування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Реверс" Тогда 
				Возврат НСтр("ru='Реверс';uk='Реверс'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыРасчетовСПартнерами" Тогда 
			Если ИмяДляПеревода = "РасчетыСКлиентом" Тогда 
				Возврат НСтр("ru='Расчеты с клиентом';uk='Розрахунки з клієнтом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетыСПоставщиком" Тогда 
				Возврат НСтр("ru='Расчеты с поставщиком';uk='Розрахунки з постачальником'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыРегламентныхОпераций" Тогда 
			Если ИмяДляПеревода = "ЗакрытиеГода" Тогда 
				Возврат НСтр("ru='Закрытие года';uk='Закриття року'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереоценкаВалютныхСредств" Тогда 
				Возврат НСтр("ru='Расчет курсовых разниц по регламентированному учету';uk='Розрахунок курсових різниць по регламентованому обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФормированиеРезервовПоСомнительнымДолгам" Тогда 
				Возврат НСтр("ru='Формирование резервов по сомнительным долгам';uk='Формування резервів по сумнівних боргах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФормированиеФинансовогоРезультата" Тогда 
				Возврат НСтр("ru='Формирование финансового результата';uk='Формування фінансового результату'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыРегламентныхОперацийМеждународныйУчет" Тогда 
			Если ИмяДляПеревода = "ЗакрытиеСчетовДоходовРасходов" Тогда 
				Возврат НСтр("ru='Закрытие счетов учета доходов и расходов';uk='Закриття рахунків обліку доходів і витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетКурсовыхРазницВалютаПредставления" Тогда 
				Возврат НСтр("ru='Расчет курсовых разниц в валюте представления';uk='Розрахунок курсових різниць у валюті подання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасчетКурсовыхРазницФункциональнаяВалюта" Тогда 
				Возврат НСтр("ru='Расчет курсовых разниц в функциональной валюте';uk='Розрахунок курсових різниць у функціональній валюті'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыРесурсовМеханизмаОнлайнСервисовРО" Тогда 
			Если ИмяДляПеревода = "ИнформацияОРелизе" Тогда 
				Возврат НСтр("ru='Информация о релизе';uk='Інформація про реліз'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СправочникВнешнихМодулейДокументооборотаСФНС" Тогда 
				Возврат НСтр("ru='Справочник внешних модулей защищенного документооборота с ФНС';uk='Довідник зовнішніх модулів захищеного документообігу з ФНС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СправочникРелизов" Тогда 
				Возврат НСтр("ru='Справочник релизов';uk='Довідник релізів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СправочникФормИФорматов" Тогда 
				Возврат НСтр("ru='Справочник форм и форматов';uk='Довідник форм і форматів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСделокСКлиентами" Тогда 
			Если ИмяДляПеревода = "ПрочиеНепроцессныеСделки" Тогда 
				Возврат НСтр("ru='Прочие непроцессные сделки';uk='Інші непроцесні угоди'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СделкиСРучнымПереходомПоЭтапам" Тогда 
				Возврат НСтр("ru='Сделки с ручным переходом по этапам';uk='Угоди з ручним переходом по етапах'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТиповаяПродажа" Тогда 
				Возврат НСтр("ru='Типовая продажа';uk='Типовий продаж'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСкладов" Тогда 
			Если ИмяДляПеревода = "ОптовыйСклад" Тогда 
				Возврат НСтр("ru='Оптовый склад';uk='Гуртовий склад'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РозничныйМагазин" Тогда 
				Возврат НСтр("ru='Розничный магазин';uk='Роздрібний магазин'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСкладскихЯчеек" Тогда 
			Если ИмяДляПеревода = "Архив" Тогда 
				Возврат НСтр("ru='Архив';uk='Архів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отгрузка" Тогда 
				Возврат НСтр("ru='Отгрузка';uk='Відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Приемка" Тогда 
				Возврат НСтр("ru='Приемка';uk='Приймання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Хранение" Тогда 
				Возврат НСтр("ru='Хранение';uk='Зберігання'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСмещенияЭтаповПроизводства" Тогда 
			Если ИмяДляПеревода = "КЗавершению" Тогда 
				Возврат НСтр("ru='К завершению';uk='До завершення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КНачалу" Тогда 
				Возврат НСтр("ru='К началу';uk='До початку'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСобытийОповещений" Тогда 
			Если ИмяДляПеревода = "АннулированиеСчета" Тогда 
				Возврат НСтр("ru='Аннулирование счета';uk='Анулювання рахунку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыпискаСчета" Тогда 
				Возврат НСтр("ru='Выписка счета';uk='Виписка рахунку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзменениеСостоянияЗаказа" Тогда 
				Возврат НСтр("ru='Изменение состояния заказа';uk='Зміна стану замовлення'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзменениеСчета" Тогда 
				Возврат НСтр("ru='Изменение счета';uk='Зміна рахунку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачислениеБонусов" Тогда 
				Возврат НСтр("ru='Начисление бонусов';uk='Нарахування бонусів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОкончаниеОпроса" Тогда 
				Возврат НСтр("ru='Напоминание об окончании опроса';uk='Нагадування про закінчення опитування'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПлановыеОтгрузки" Тогда 
				Возврат НСтр("ru='Приближение плановой отгрузки';uk='Наближення планового відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПлановыеПлатежи" Тогда 
				Возврат НСтр("ru='Приближение плановой оплаты';uk='Наближення планової оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоздравлениеСДнемРождения" Тогда 
				Возврат НСтр("ru='День рождения контактного лица';uk='День народження контактної особи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОплатыОтКлиента" Тогда 
				Возврат НСтр("ru='Поступление оплаты от клиента';uk='Надходження оплати від клієнта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПросроченнаяЗадолженность" Тогда 
				Возврат НСтр("ru='Выявление просроченной задолженности';uk='Виявлення простроченої заборгованості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеБонусов" Тогда 
				Возврат НСтр("ru='Списание бонусов';uk='Списання бонусів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСравненияЗначенийСкидокНаценок" Тогда 
			Если ИмяДляПеревода = "НеБолее" Тогда 
				Возврат НСтр("ru='не более';uk='не більше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеМенее" Тогда 
				Возврат НСтр("ru='не менее';uk='не менш'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСроковЭтаповПодготовкиБюджетов" Тогда 
			Если ИмяДляПеревода = "ВКалендарныхДнях" Тогда 
				Возврат НСтр("ru='Календарных дней';uk='Календарних днів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВРабочихДнях" Тогда 
				Возврат НСтр("ru='Рабочих дней';uk='Робочих днів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСрочностиКредитовИДепозитов" Тогда 
			Если ИмяДляПеревода = "Долгосрочный" Тогда 
				Возврат НСтр("ru='Долгосрочный';uk='Довгостроковий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДолгосрочныйИстекающий" Тогда 
				Возврат НСтр("ru='Долгосрочный (12 мес. до завершения)';uk='Довгостроковий (12 міс. до завершення)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Краткосрочный" Тогда 
				Возврат НСтр("ru='Краткосрочный';uk='Короткостроковий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСтатейАктивовПассивов" Тогда 
			Если ИмяДляПеревода = "СтатьяАктивов" Тогда 
				Возврат НСтр("ru='Статья активов';uk='Стаття активів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтатьяДоходов" Тогда 
				Возврат НСтр("ru='Статья доходов';uk='Стаття доходів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтатьяПассивов" Тогда 
				Возврат НСтр("ru='Статья пассивов';uk='Стаття пасивів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СтатьяРасходов" Тогда 
				Возврат НСтр("ru='Статья расходов';uk='Стаття витрат'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСтоимостиВыходныхИзделий" Тогда 
			Если ИмяДляПеревода = "Рассчитывается" Тогда 
				Возврат НСтр("ru='Рассчитывается';uk='Розраховується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Фиксированная" Тогда 
				Возврат НСтр("ru='Фиксированная';uk='Фіксована'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСуммГрафикаКредитовИДепозитов" Тогда 
			Если ИмяДляПеревода = "Комиссия" Тогда 
				Возврат НСтр("ru='Комиссия';uk='Комісія'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОсновнойДолг" Тогда 
				Возврат НСтр("ru='Основной долг';uk='Основний борг'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Проценты" Тогда 
				Возврат НСтр("ru='Проценты';uk='Відсотки'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСуммЗадолженности" Тогда 
			Если ИмяДляПеревода = "АвансВыданный" Тогда 
				Возврат НСтр("ru='Аванс выданный';uk='Аванс виданий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АвансПолученный" Тогда 
				Возврат НСтр("ru='Аванс полученный';uk='Аванс отриманий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДолгКлиента" Тогда 
				Возврат НСтр("ru='Долг клиента';uk='Борг клієнта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДолгПоставщику" Тогда 
				Возврат НСтр("ru='Долг поставщику';uk='Борг постачальнику'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСчетчиковВыгрузки" Тогда 
			Если ИмяДляПеревода = "СчетчикДокументовАлко" Тогда 
				Возврат НСтр("ru='Счетчик документов для алкогольных деклараций';uk='Лічильник документів для алкогольних декларацій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетчикДокументовВФормате201" Тогда 
				Возврат НСтр("ru='Счетчик документов в формате 2.01';uk='Лічильник документів у форматі 2.01'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетчикДокументовВФормате300" Тогда 
				Возврат НСтр("ru='Счетчик документов в формате 3.00';uk='Лічильник документів у форматі 3.00'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетчикФайлов" Тогда 
				Возврат НСтр("ru='Счетчик файлов';uk='Лічильник файлів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СчетчикФайловАлко" Тогда 
				Возврат НСтр("ru='Счетчик файлов для алкогольных деклараций';uk='Лічильник файлів для алкогольних декларацій'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыТабличныхВопросов" Тогда 
			Если ИмяДляПеревода = "ПредопределенныеОтветыВКолонках" Тогда 
				Возврат НСтр("ru='Предопределенные ответы в колонках';uk='Напередвизначені відповіді в колонках'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредопределенныеОтветыВСтроках" Тогда 
				Возврат НСтр("ru='Предопределенные ответы в строках';uk='Напередвизначені відповіді в рядках'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредопределенныеОтветыВСтрокахИКолонках" Тогда 
				Возврат НСтр("ru='Предопределенные ответы в строках и колонках';uk='Напередвизначені відповіді в рядках і колонках'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Составной" Тогда 
				Возврат НСтр("ru='Составной';uk='Складений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыТекстовЭлектронныхПисем" Тогда 
			Если ИмяДляПеревода = "HTML" Тогда 
				Возврат НСтр("ru='HTML';uk='HTML'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "HTMLСКартинками" Тогда 
				Возврат НСтр("ru='HTML с картинками';uk='HTML з картинками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПростойТекст" Тогда 
				Возврат НСтр("ru='Простой текст';uk='Простий текст'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РазмеченныйТекст" Тогда 
				Возврат НСтр("ru='Размеченный текст';uk='Розмічений текст'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыУпаковокНоменклатуры" Тогда 
			Если ИмяДляПеревода = "Конечная" Тогда 
				Возврат НСтр("ru='Конечная';uk='Кінцева'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Разупаковка" Тогда 
				Возврат НСтр("ru='Разупаковка';uk='Розупаковка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Составная" Тогда 
				Возврат НСтр("ru='Составная';uk='Складова'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыУсловийЗапускаЭтаповПодготовкиБюджетов" Тогда 
			Если ИмяДляПеревода = "ДоНачалаПериода" Тогда 
				Возврат НСтр("ru='До начала периода';uk='До початку періоду'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоОкончанияПериода" Тогда 
				Возврат НСтр("ru='До окончания периода';uk='До закінчення періоду'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПослеНачалаПериода" Тогда 
				Возврат НСтр("ru='После начала периода';uk='Після початку періоду'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПослеОкончанияПериода" Тогда 
				Возврат НСтр("ru='После окончания периода';uk='Після закінчення періоду'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыУчастниковВзаимозачета" Тогда 
			Если ИмяДляПеревода = "Клиент" Тогда 
				Возврат НСтр("ru='клиент';uk='клієнт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОрганизацияКлиент" Тогда 
				Возврат НСтр("ru='организация-клиент';uk='організація-клієнт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОрганизацияПоставщик" Тогда 
				Возврат НСтр("ru='организация-поставщик';uk='організація-постачальник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Поставщик" Тогда 
				Возврат НСтр("ru='поставщик';uk='постачальник'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыФайловДляВстроенногоРедактора" Тогда 
			Если ИмяДляПеревода = "ГеографическиеСхемы" Тогда 
				Возврат НСтр("ru='Географические схемы';uk='Географічні схеми'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ГрафическиеСхемы" Тогда 
				Возврат НСтр("ru='Графические схемы';uk='Графічні схеми'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТабличныеФайлы" Тогда 
				Возврат НСтр("ru='Табличные файлы';uk='Табличні файли'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ТекстовыеФайлы" Тогда 
				Возврат НСтр("ru='Текстовые файлы';uk='Текстові файли'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыФайловСохраненияПечатныхФормОбъектов" Тогда 
			Если ИмяДляПеревода = "MXL" Тогда 
				Возврат НСтр("ru='MXL (Табличный документ 1С:Підприємство)';uk='MXL (Табличний документ 1С:Підприємство)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "PDF" Тогда 
				Возврат НСтр("ru='PDF (Adobe Reader)';uk='PDF (Adobe Reader)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "XLS" Тогда 
				Возврат НСтр("ru='XLS (Microsoft Office Excel)';uk='XLS (Microsoft Office Excel)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыФормШаблоновНефинансовыхПоказателей" Тогда 
			Если ИмяДляПеревода = "ВсеВШапке" Тогда 
				Возврат НСтр("ru='Все в шапке';uk='Все в шапці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПростаяТаблица" Тогда 
				Возврат НСтр("ru='Простая таблица';uk='Проста таблиця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СложнаяТаблица" Тогда 
				Возврат НСтр("ru='Сложная таблица';uk='Складна таблиця'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыХраненияФайлов" Тогда 
			Если ИмяДляПеревода = "ВИнформационнойБазе" Тогда 
				Возврат НСтр("ru='В информационной базе';uk='В інформаційній базі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВТомахНаДиске" Тогда 
				Возврат НСтр("ru='В томах на диске';uk='У томах на диску'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыШаблонов" Тогда 
			Если ИмяДляПеревода = "Табличный" Тогда 
				Возврат НСтр("ru='Табличный';uk='Табличний'" ,КодЯзыка);			
			КонецЕсли;
									
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТочностиУказанияСрокаГодности" Тогда 
			Если ИмяДляПеревода = "СТочностьюДоДней" Тогда 
				Возврат НСтр("ru='до дней';uk='до днів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СТочностьюДоЧасов" Тогда 
				Возврат НСтр("ru='до часов';uk='до годин'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТочностьГрафикаПроизводства" Тогда 
			Если ИмяДляПеревода = "День" Тогда 
				Возврат НСтр("ru='День';uk='День'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Месяц" Тогда 
				Возврат НСтр("ru='Месяц';uk='Місяць'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Неделя" Тогда 
				Возврат НСтр("ru='Неделя';uk='Тиждень'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Час" Тогда 
				Возврат НСтр("ru='Час';uk='Година'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТранспортныеПротоколы" Тогда 
			Если ИмяДляПеревода = "HTTP" Тогда 
				Возврат НСтр("ru='HTTP';uk='HTTP'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "POP3" Тогда 
				Возврат НСтр("ru='POP3';uk='POP3'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "SMTP" Тогда 
				Возврат НСтр("ru='SMTP';uk='SMTP'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УдалитьВидыКалендарей" Тогда 
			Если ИмяДляПеревода = "Произвольный" Тогда 
				Возврат НСтр("ru='Произвольный';uk='Довільний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Пятидневка" Тогда 
				Возврат НСтр("ru='Пятидневка';uk='П'ятиденка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Шестидневка" Тогда 
				Возврат НСтр("ru='Шестидневка';uk='Шестиденка'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УдалитьКонтекстыРаботыСЭД" Тогда 
			Если ИмяДляПеревода = "НаКлиенте" Тогда 
				Возврат НСтр("ru='на клиенте';uk='на клієнті'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НаСервере" Тогда 
				Возврат НСтр("ru='на сервере';uk='на сервері'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УДАЛИТЬСтатусыВнутреннихПотребленийТоваров" Тогда 
			Если ИмяДляПеревода = "КОтгрузке" Тогда 
				Возврат НСтр("ru='К отгрузке';uk='До відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отгружено" Тогда 
				Возврат НСтр("ru='Отгружено';uk='Відвантажено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УдалитьСтатусыВозвратовТоваровПоставщикам" Тогда 
			Если ИмяДляПеревода = "КОтгрузке" Тогда 
				Возврат НСтр("ru='К отгрузке';uk='До відвантаження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отгружено" Тогда 
				Возврат НСтр("ru='Отгружено';uk='Відвантажено'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УдалитьТипыВладельцевЭЦП" Тогда 
			Если ИмяДляПеревода = "ГлавныйБухгалтер" Тогда 
				Возврат НСтр("ru='Главный бухгалтер';uk='Головний бухгалтер'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДругойСотрудник" Тогда 
				Возврат НСтр("ru='Другой сотрудник';uk='Інший співробітник'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Руководитель" Тогда 
				Возврат НСтр("ru='Руководитель';uk='Керівник'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УДАЛИТЬТипыДенежныхСредствКПоступлению" Тогда 
			Если ИмяДляПеревода = "ВыдачаИзКассы" Тогда 
				Возврат НСтр("ru='Выдача из кассы';uk='Видача з каси'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеСДругогоСчета" Тогда 
				Возврат НСтр("ru='Перечисление с другого счета';uk='Перерахування з іншого рахунку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокупкаВалюты" Тогда 
				Возврат НСтр("ru='Покупка валюты';uk='Купівля валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОтБанкаПоЭквайрингу" Тогда 
				Возврат НСтр("ru='Поступление от банка по эквайрингу';uk='Надходження від банку еквайрингу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеПоПлатежномуДокументу" Тогда 
				Возврат НСтр("ru='Поступление по платежному документу';uk='Надходження по платіжному документу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродажаВалюты" Тогда 
				Возврат НСтр("ru='Продажа валюты';uk='Продаж валюти'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УДАЛИТЬТипыДенежныхСредствКСписанию" Тогда 
			Если ИмяДляПеревода = "СнятиеПоЧеку" Тогда 
				Возврат НСтр("ru='Снятие по чеку';uk='Зняття за чеком'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеБанкомПоЭквайрингу" Тогда 
				Возврат НСтр("ru='Списание банком по эквайрингу';uk='Списання банком за еквайрингом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеПоПлатежномуДокументу" Тогда 
				Возврат НСтр("ru='Списание по платежному документу';uk='Списання по платіжному документу'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УдалитьТипыКриптоПровайдеров" Тогда 
			Если ИмяДляПеревода = "CryptoPro" Тогда 
				Возврат НСтр("ru='Crypto pro';uk='Crypto pro'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "VipNet" Тогда 
				Возврат НСтр("ru='Vip net';uk='Vip net'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УдалитьТранспортныеПротоколы" Тогда 
			Если ИмяДляПеревода = "HTTP" Тогда 
				Возврат НСтр("ru='HTTP';uk='HTTP'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "POP3" Тогда 
				Возврат НСтр("ru='POP3';uk='POP3'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "SMTP" Тогда 
				Возврат НСтр("ru='SMTP';uk='SMTP'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УправлениеМаршрутнымиЛистами" Тогда 
			Если ИмяДляПеревода = "МетодикаББВ" Тогда 
				Возврат НСтр("ru='ББВ/УББВ';uk='ББМ/СББМ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПооперационноеПланирование" Тогда 
				Возврат НСтр("ru='Пооперационное планирование (MES)';uk='Поопераційне планування (MES)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РегистрацияОпераций" Тогда 
				Возврат НСтр("ru='Регистрация операций';uk='Реєстрація операцій'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УровниОбслуживания" Тогда 
			Если ИмяДляПеревода = "УровеньОбслуживания50_0" Тогда 
				Возврат НСтр("ru='50.0 % (k = 0.0)';uk='50.0 % (k = 0.0)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания57_9" Тогда 
				Возврат НСтр("ru='57.9 % (k = 0.2)';uk='57.9 % (k = 0.2)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания65_5" Тогда 
				Возврат НСтр("ru='65.5 % (k = 0.4)';uk='65.5 % (k = 0.4)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания72_6" Тогда 
				Возврат НСтр("ru='72.6 % (k = 0.6)';uk='72.6 % (k = 0.6)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания78_8" Тогда 
				Возврат НСтр("ru='78.8 % (k = 0.8)';uk='78.8 % (k = 0.8)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания84_0" Тогда 
				Возврат НСтр("ru='84.0 % (k = 1.0)';uk='84.0 % (k = 1.0)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания88_5" Тогда 
				Возврат НСтр("ru='88.5 % (k = 1.2)';uk='88.5 % (k = 1.2)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания91_9" Тогда 
				Возврат НСтр("ru='91.9 % (k = 1.4)';uk='91.9 % (k = 1.4)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания94_5" Тогда 
				Возврат НСтр("ru='94.5 % (k = 1.6)';uk='94.5 % (k = 1.6)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания96_4" Тогда 
				Возврат НСтр("ru='96.4 % (k = 1.8)';uk='96.4 % (k = 1.8)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания97_7" Тогда 
				Возврат НСтр("ru='97.7 % (k = 2.0)';uk='97.7 % (k = 2.0)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания98_6" Тогда 
				Возврат НСтр("ru='98.6 % (k = 2.2)';uk='98.6 % (k = 2.2)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания99_2" Тогда 
				Возврат НСтр("ru='99.2 % (k = 2.4)';uk='99.2 % (k = 2.4)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания99_5" Тогда 
				Возврат НСтр("ru='99.5 % (k = 2.6)';uk='99.5 % (k = 2.6)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания99_7" Тогда 
				Возврат НСтр("ru='99.7 % (k = 2.8)';uk='99.7 % (k = 2.8)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УровеньОбслуживания99_9" Тогда 
				Возврат НСтр("ru='99.9 % (k = 3.0)';uk='99.9 % (k = 3.0)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УровниПроизводительности" Тогда 
			Если ИмяДляПеревода = "Идеально" Тогда 
				Возврат НСтр("ru='Идеально (apdex = 1)';uk='Ідеально (apdex = 1)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отлично" Тогда 
				Возврат НСтр("ru='Отлично (apdex >= 0.94)';uk='Відмінно (apdex >= 0.94)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Плохо" Тогда 
				Возврат НСтр("ru='Плохо (apdex >= 0.50)';uk='Погано (apdex >= 0.50)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Удовлетворительно" Тогда 
				Возврат НСтр("ru='Удовлетворительно (apdex >= 0.70)';uk='Задовільно (apdex >= 0.70)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Хорошо" Тогда 
				Возврат НСтр("ru='Хорошо (apdex >= 0.85)';uk='Добре (apdex >= 0.85)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УсловияПредоставленияСкидокНаценок" Тогда 
			Если ИмяДляПеревода = "ВнешняяОбработка" Тогда 
				Возврат НСтр("ru='Внешняя обработка';uk='Зовнішня обробка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВхождениеПартнераВСегмент" Тогда 
				Возврат НСтр("ru='Вхождение клиента в сегмент';uk='Входження клієнта до сегменту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаВремяПродажи" Тогда 
				Возврат НСтр("ru='За время продажи';uk='За час продажу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаГрафикОплаты" Тогда 
				Возврат НСтр("ru='За график оплаты';uk='За графік оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаДеньРожденияКлиента" Тогда 
				Возврат НСтр("ru='За день рождения клиента';uk='За день народження клієнта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаНакопленныйОбъемПродаж" Тогда 
				Возврат НСтр("ru='За накопленный объем продаж';uk='За накопичений об'єм продажів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаНаличиеКартыЛояльности" Тогда 
				Возврат НСтр("ru='За наличие карты лояльности';uk='За наявність карти лояльності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаПервуюПродажуПартнеру" Тогда 
				Возврат НСтр("ru='За первую продажу клиенту';uk='За перший продаж клієнту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаПробнуюПродажу" Тогда 
				Возврат НСтр("ru='За пробную продажу';uk='За пробний продаж'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаРазовыйОбъемПродаж" Тогда 
				Возврат НСтр("ru='За разовый объем продаж';uk='За разовий об'єм продажів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаФормуОплаты" Тогда 
				Возврат НСтр("ru='За форму оплаты';uk='За форму оплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КартаЛояльностиНеЗарегистрирована" Тогда 
				Возврат НСтр("ru='Карта лояльности не зарегистрирована';uk='Карта лояльності не зареєстрована'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОграничениеПоГруппеПользователей" Тогда 
				Возврат НСтр("ru='Ограничение по группе пользователей';uk='Обмеження по групі користувачів'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УчетНачисленийВСреднемЗаработкеОбщий" Тогда 
			Если ИмяДляПеревода = "НеВключать" Тогда 
				Возврат НСтр("ru='Не включать';uk='Не включати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбщийЗаработок" Тогда 
				Возврат НСтр("ru='Общий заработок';uk='Загальний заробіток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПремияГодоваяПроцентом" Тогда 
				Возврат НСтр("ru='Годовая премия, полностью учитываемая';uk='Річна премія, повністю обліковується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПремияГодоваяФиксированнойСуммой" Тогда 
				Возврат НСтр("ru='Годовая премия, учитываемая пропорционально';uk='Річна премія, яка обліковується пропорційно'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПремияПроцентом" Тогда 
				Возврат НСтр("ru='Премия, полностью учитываемая';uk='Премія, повністю обліковується'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПремияФиксированнойСуммой" Тогда 
				Возврат НСтр("ru='Премия, учитываемая пропорционально';uk='Премія враховується пропорційно'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.УчетНачисленийВСреднемЗаработкеФСС" Тогда 
			Если ИмяДляПеревода = "Включать" Тогда 
				Возврат НСтр("ru='Включать';uk='Включати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеВключать" Тогда 
				Возврат НСтр("ru='Не включать';uk='Не включати'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ФорматыСканированногоИзображения" Тогда 
			Если ИмяДляПеревода = "BMP" Тогда 
				Возврат НСтр("ru='BMP';uk='BMP'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "GIF" Тогда 
				Возврат НСтр("ru='GIF';uk='GIF'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "JPG" Тогда 
				Возврат НСтр("ru='JPG';uk='JPG'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "PNG" Тогда 
				Возврат НСтр("ru='PNG';uk='PNG'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "TIF" Тогда 
				Возврат НСтр("ru='TIF';uk='TIF'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ФорматыСохраненияОтчетов" Тогда 
			Если ИмяДляПеревода = "ANSITXT" Тогда 
				Возврат НСтр("ru='Текстовый документ ANSI (.txt)';uk='Текстовий документ ANSI (.txt)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "DOCX" Тогда 
				Возврат НСтр("ru='Документ Word 2007 (.docx)';uk='Документ Word 2007 (.docx)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "HTML" Тогда 
				Возврат НСтр("ru='Веб-страница (.html)';uk='Веб-сторінка (.html)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "HTML4" Тогда 
				Возврат НСтр("ru='Веб-страница версии 4 (.html)';uk='Веб-сторінка версії 4 (.html)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "MXL" Тогда 
				Возврат НСтр("ru='Табличный документ (.mxl)';uk='Табличний документ (.mxl)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ODS" Тогда 
				Возврат НСтр("ru='Электронная таблица Open Document (.ods)';uk='Електронна таблиця Open Document (.ods)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "PDF" Тогда 
				Возврат НСтр("ru='Документ Adobe PDF (.pdf)';uk='Документ Adobe PDF (.pdf)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "TXT" Тогда 
				Возврат НСтр("ru='Текстовый документ UTF-8 (.txt)';uk='Текстовий документ UTF-8 (.txt)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "XLS" Тогда 
				Возврат НСтр("ru='Лист Microsoft Excel 97-2003 (.xls)';uk='Лист Microsoft Excel 97-2003 (.xls)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "XLSX" Тогда 
				Возврат НСтр("ru='Лист Microsoft Excel 2007 (.xlsx)';uk='Аркуш Microsoft Excel 2007 (.xlsx)'" ,КодЯзыка);			
			КонецЕсли;
						
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ФорматыФайловОбменаЭД" Тогда 
			Если ИмяДляПеревода = "DOCX" Тогда 
				Возврат НСтр("ru='Документ Word 2007 (*.docx)';uk='Документ Word 2007 (*.docx)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "HTML" Тогда 
				Возврат НСтр("ru='Документ HTML (*.html)';uk='Документ HTML (*.html)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "MXL" Тогда 
				Возврат НСтр("ru='Табличный документ (*.mxl)';uk='Табличний документ (*.mxl)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ODS" Тогда 
				Возврат НСтр("ru='Электронная таблица ODF (*.ods)';uk='Електронна таблиця ODF (*.ods)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "PDF" Тогда 
				Возврат НСтр("ru='Документ PDF (*.pdf)';uk='Документ PDF (*.pdf)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "XLS" Тогда 
				Возврат НСтр("ru='Лист Excel (*.xls)';uk='Лист Excel (*.xls)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "XML" Тогда 
				Возврат НСтр("ru='Документ ХML (*.xml)';uk='Документ ХML (*.xml)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СоставнойФормат" Тогда 
				Возврат НСтр("ru='Составной формат (*.zip)';uk='Складовою формат (*.zip)'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ФорматыХраненияМногостраничныхФайлов" Тогда 
			Если ИмяДляПеревода = "PDF" Тогда 
				Возврат НСтр("ru='PDF';uk='PDF'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "TIF" Тогда 
				Возврат НСтр("ru='TIF';uk='TIF'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ФорматыХраненияОдностраничныхФайлов" Тогда 
			Если ИмяДляПеревода = "BMP" Тогда 
				Возврат НСтр("ru='BMP';uk='BMP'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "GIF" Тогда 
				Возврат НСтр("ru='GIF';uk='GIF'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "JPG" Тогда 
				Возврат НСтр("ru='JPG';uk='JPG'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "PDF" Тогда 
				Возврат НСтр("ru='PDF';uk='PDF'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "PNG" Тогда 
				Возврат НСтр("ru='PNG';uk='PNG'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "TIF" Тогда 
				Возврат НСтр("ru='TIF';uk='TIF'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ФормыОбучения" Тогда 
			Если ИмяДляПеревода = "Вечерняя" Тогда 
				Возврат НСтр("ru='Вечерняя';uk='Вечірня'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Заочная" Тогда 
				Возврат НСтр("ru='Заочная';uk='Заочна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Очная" Тогда 
				Возврат НСтр("ru='Очная';uk='Очна'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр("ru='Прочее';uk='Інше'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Экстернат" Тогда 
				Возврат НСтр("ru='Экстернат';uk='Екстернат'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ФормыОплаты" Тогда 
			Если ИмяДляПеревода = "Безналичная" Тогда 
				Возврат НСтр("ru='Безналичная';uk='Безготівкова'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "БонусныеБаллы" Тогда 
				Возврат НСтр("ru='Бонусные баллы';uk='Бонусні бали'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Взаимозачет" Тогда 
				Возврат НСтр("ru='Взаимозачет';uk='Взаємозалік'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Наличная" Тогда 
				Возврат НСтр("ru='Наличная';uk='Готівкова'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПлатежнаяКарта" Тогда 
				Возврат НСтр("ru='Платежная карта';uk='Платіжна карта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПодарочныйСертификат" Тогда 
				Возврат НСтр("ru='Подарочный сертификат';uk='Подарунковий сертифікат'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ФормыОткрываемыеПриНачалеРаботыСистемы" Тогда 
			Если ИмяДляПеревода = "ПомощникПродаж" Тогда 
				Возврат НСтр("ru='Помощник продаж';uk='Помічник продажів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РабочееМестоМенеджераПоДоставке" Тогда 
				Возврат НСтр("ru='Рабочее место менеджера по доставке';uk='Робоче місце менеджера з доставки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РабочееМестоРаботникаСклада" Тогда 
				Возврат НСтр("ru='Рабочее место работника склада';uk='Робоче місце працівника складу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЧекККМ" Тогда 
				Возврат НСтр("ru='Чек ККМ';uk='Чек ККМ'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ХарактерВыплатыЗарплаты" Тогда 
			Если ИмяДляПеревода = "Аванс" Тогда 
				Возврат НСтр("ru='С авансом';uk='З авансом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Зарплата" Тогда 
				Возврат НСтр("ru='С зарплатой';uk='Із зарплатою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Межрасчет" Тогда 
				Возврат НСтр("ru='В межрасчетный период';uk='В міжрозрахунковий період'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ХарактерДоговораКредитовИДепозитов" Тогда 
			Если ИмяДляПеревода = "Депозит" Тогда 
				Возврат НСтр("ru='Депозит';uk='Депозит'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗаймВыданный" Тогда 
				Возврат НСтр("ru='Займ выданный';uk='Позика видана'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КредитИлиЗайм" Тогда 
				Возврат НСтр("ru='Кредит или займ полученный';uk='Кредит або позика отриманий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ХарактерЗависимостиКоличестваДнейОтпуска" Тогда 
			Если ИмяДляПеревода = "ЗависитОтРабочегоМеста" Тогда 
				Возврат НСтр("ru='Зависит от рабочего места';uk='Залежить від робочого місця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗависитОтСтажа" Тогда 
				Возврат НСтр("ru='Зависит от стажа';uk='Залежить від стажу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеЗависит" Тогда 
				Возврат НСтр("ru='Не зависит';uk='Не залежить'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ХарактерПлановогоНачисления" Тогда 
			Если ИмяДляПеревода = "Индивидуальное" Тогда 
				Возврат НСтр("ru='Индивидуальное';uk='Індивідуальне'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Штатное" Тогда 
				Возврат НСтр("ru='Штатное';uk='Штатний'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ХозяйственныеОперации" Тогда 
			Если ИмяДляПеревода = "АвансовыйОтчет" Тогда 
				Возврат НСтр("ru='Авансовый отчет';uk='Авансовий звіт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АмортизацияВнеоборотныхАктивов" Тогда 
				Возврат НСтр("ru='Амортизация необоротных активов';uk='Амортизація необоротних активів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АннулированиеПодарочныхСертификатов" Тогда 
				Возврат НСтр("ru='Аннулирование подарочных сертификатов';uk='Анулювання подарункових сертифікатів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВзаимозачетДебиторскойЗадолженности" Тогда 
				Возврат НСтр("ru='Взаимозачет дебиторской задолженности';uk='Взаємозалік дебіторської заборгованості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВзаимозачетЗадолженности" Тогда 
				Возврат НСтр("ru='Взаимозачет задолженности';uk='Взаємозалік заборгованості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВзаимозачетКредиторскойЗадолженности" Тогда 
				Возврат НСтр("ru='Взаимозачет кредиторской задолженности';uk='Взаємозалік кредиторської заборгованості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВнесениеДенежныхСредствВКассуККМ" Тогда 
				Возврат НСтр("ru='Внесение ДС в кассу ККМ';uk='Внесення ГК в касу ККМ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВнутреннееПоступлениеДенежныхСредств" Тогда 
				Возврат НСтр("ru='Внутреннее поступление ДС';uk='Внутрішнє надходження ГК'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВнутреннееПоступлениеТоваров" Тогда 
				Возврат НСтр("ru='Внутреннее поступление товаров';uk='Внутрішнє надходження товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВнутреннееПотреблениеТоваров" Тогда 
				Возврат НСтр("ru='Внутреннее потребление товаров';uk='Внутрішнє споживання товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВнутренняяПередачаДенежныхСредств" Тогда 
				Возврат НСтр("ru='Внутренняя передача ДС';uk='Внутрішня передача ГК'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВнутренняяПередачаТоваров" Тогда 
				Возврат НСтр("ru='Внутренняя передача товаров';uk='Внутрішня передача товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратДавальцу" Тогда 
				Возврат НСтр("ru='Возврат давальцу';uk='Повернення давальцю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратДенежныхДокументовПоставщику" Тогда 
				Возврат НСтр("ru='Возврат денежных документов поставщику';uk='Повернення грошових документів постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратДенежныхСредствВДругуюОрганизацию" Тогда 
				Возврат НСтр("ru='Возврат ДС другой организации';uk='Повернення ГК іншої організації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратДенежныхСредствОтДругойОрганизации" Тогда 
				Возврат НСтр("ru='Возврат ДС от другой организации';uk='Повернення ГК від іншої організації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратДенежныхСредствОтПодотчетника" Тогда 
				Возврат НСтр("ru='Возврат ДС от подотчетника';uk='Повернення ГК від підзвітника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратДенежныхСредствОтПоставщика" Тогда 
				Возврат НСтр("ru='Возврат ДС от поставщика';uk='Повернення ГК від постачальника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратДеньВДень" Тогда 
				Возврат НСтр("ru='Возврат день в день';uk='Повернення день у день'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратИзПроизводства" Тогда 
				Возврат НСтр("ru='Возврат из производства';uk='Повернення з виробництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратИзЭксплуатации" Тогда 
				Возврат НСтр("ru='Возврат из эксплуатации';uk='Повернення з експлуатації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратНедопоставленногоТовара" Тогда 
				Возврат НСтр("ru='Возврат недопоставленного товара';uk='Повернення недопоставленого товару'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратНеперечисленнойЗарплатыПоЗарплатномуПроекту" Тогда 
				Возврат НСтр("ru='Возврат по зарплатному проекту';uk='Повернення по зарплатному проекту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратНеперечисленныхДС" Тогда 
				Возврат НСтр("ru='Возврат неперечисленной зарплаты на лицевые счета';uk='Повернення неперерахованої зарплати на особові рахунки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратОплатыКлиенту" Тогда 
				Возврат НСтр("ru='Возврат оплаты клиенту';uk='Повернення оплати клієнту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратОплатыКлиентуНаПлатежнуюКарту" Тогда 
				Возврат НСтр("ru='Возврат оплаты клиенту на платежную карту';uk='Повернення оплати клієнту на платіжну карту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратОплатыНаПлатежнуюКарту" Тогда 
				Возврат НСтр("ru='Возврат оплаты по эквайрингу';uk='Повернення оплати по еквайрингу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратОтКомиссионера" Тогда 
				Возврат НСтр("ru='Возврат от комиссионера';uk='Повернення від комісіонера'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратОтПереработчика" Тогда 
				Возврат НСтр("ru='Возврат от переработчика';uk='Повернення від переробника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратОтРозничногоПокупателя" Тогда 
				Возврат НСтр("ru='Возврат от розничного покупателя';uk='Повернення від роздрібного покупця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратПодарочныхСертификатов" Тогда 
				Возврат НСтр("ru='Возврат подарочных сертификатов';uk='Повернення подарункових сертифікатів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратПоКомиссииМеждуОрганизациями" Тогда 
				Возврат НСтр("ru='Возврат по комиссии между организациями';uk='Повернення по комісії між організаціями'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратТарыОтКлиентаПрошлыхПериодов" Тогда 
				Возврат НСтр("ru='Возврат тары от клиента прошлых периодов';uk='Повернення тари від клієнта минулих періодів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратТоваровКомитенту" Тогда 
				Возврат НСтр("ru='Возврат товаров комитенту';uk='Повернення товарів комітенту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратТоваровМеждуОрганизациями" Тогда 
				Возврат НСтр("ru='Возврат товаров между организациями';uk='Повернення товарів між організаціями'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратТоваровОтКлиента" Тогда 
				Возврат НСтр("ru='Возврат товаров от клиента';uk='Повернення товарів від клієнта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратТоваровОтКлиентаПрошлыхПериодов" Тогда 
				Возврат НСтр("ru='Возврат товаров от клиента прошлых периодов';uk='Повернення товарів від клієнта минулих періодів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратТоваровПоставщику" Тогда 
				Возврат НСтр("ru='Возврат товаров поставщику';uk='Повернення товарів постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВосстановлениеАвансаКлиента" Тогда 
				Возврат НСтр("ru='Восстановление аванса клиента';uk='Відновлення авансу клієнта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВосстановлениеНДС" Тогда 
				Возврат НСтр("ru='Восстановление НДС';uk='Відновлення ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВосстановлениеНДССВыданногоАванса" Тогда 
				Возврат НСтр("ru='Восстановление НДС с выданного аванса';uk='Відновлення ПДВ з виданого авансу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыдачаДенежныхДокументовПодотчетнику" Тогда 
				Возврат НСтр("ru='Выдача денежных документов подотчетному лицу';uk='Видача грошових документів підзвітній особі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыдачаДенежныхСредствВДругуюКассу" Тогда 
				Возврат НСтр("ru='Выдача ДС в другую кассу';uk='Видача ГК в іншу касу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыдачаДенежныхСредствВКассуККМ" Тогда 
				Возврат НСтр("ru='Выдача ДС в кассу ККМ';uk='Видача ГК в касу ККМ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыдачаДенежныхСредствПодотчетнику" Тогда 
				Возврат НСтр("ru='Выдача ДС подотчетнику';uk='Видача ГК підзвітній особі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыдачаЗаймаСотруднику" Тогда 
				Возврат НСтр("ru='Выдача займа сотруднику';uk='Видача позики співробітнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыдачаЗаймов" Тогда 
				Возврат НСтр("ru='Выдача займа контрагенту';uk='Видача позики контрагенту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыемкаДенежныхСредствИзКассыККМ" Тогда 
				Возврат НСтр("ru='Выемка ДС из кассы ККМ';uk='Виймання ГК з каси ККМ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыкупВозвратнойТарыКлиентом" Тогда 
				Возврат НСтр("ru='Выкуп возвратной тары клиентом';uk='Викуп зворотної тари клієнтом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаЗарплаты" Тогда 
				Возврат НСтр("ru='Выплата зарплаты';uk='Виплата зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаЗарплатыНаЛицевыеСчета" Тогда 
				Возврат НСтр("ru='Выплата зарплаты на лицевые счета';uk='Виплата зарплати на особові рахунки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаЗарплатыПоЗарплатномуПроекту" Тогда 
				Возврат НСтр("ru='Выплата зарплаты по зарплатному проекту';uk='Виплата зарплати за зарплатним проектом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаЗарплатыРаботнику" Тогда 
				Возврат НСтр("ru='Выплата зарплаты работнику';uk='Виплата зарплати працівнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаЗарплатыРаздатчиком" Тогда 
				Возврат НСтр("ru='Выплата зарплаты раздатчиком';uk='Виплата зарплати роздавальником'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаЗарплатыЧерезКассу" Тогда 
				Возврат НСтр("ru='Выплата зарплаты через кассу';uk='Виплата зарплати через касу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыпускПродукции" Тогда 
				Возврат НСтр("ru='Выпуск продукции';uk='Випуск продукції'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыпускПродукцииВПодразделение" Тогда 
				Возврат НСтр("ru='Выпуск продукции в подразделение';uk='Випуск продукції в підрозділ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыпускПродукцииНаСклад" Тогда 
				Возврат НСтр("ru='Выпуск продукции на склад';uk='Випуск продукції на склад'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыпускПродукцииФиксированнаяСтоимость" Тогда 
				Возврат НСтр("ru='Выпуск продукции (фикс. стоимость)';uk='Випуск продукції (фікс. вартість)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВычетНДСНалоговымАгентом" Тогда 
				Возврат НСтр("ru='Вычет НДС налоговым агентом';uk='Вирахування ПДВ податковим агентом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВычетНДССВыданногоАванса" Тогда 
				Возврат НСтр("ru='Вычет НДС с выданного аванса';uk='Вирахування ПДВ з виданого авансу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВычетНДССПолученногоАванса" Тогда 
				Возврат НСтр("ru='Вычет НДС с полученного аванса';uk='Вирахування ПДВ з отриманого авансу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДепонированиеЗарплаты" Тогда 
				Возврат НСтр("ru='Депонирование зарплаты';uk='Депонування зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоходыОтПереоценкиТоваров" Тогда 
				Возврат НСтр("ru='Доходы от переоценки товаров';uk='Доходи від переоцінки товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ДоходыПоОтчетуКомиссионераОСписании" Тогда 
				Возврат НСтр("ru='Доходы по отчету комиссионера о списании';uk='Доходи за звітом комісіонера про списання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗавершениеТекущегоРемонта" Тогда 
				Возврат НСтр("ru='Завершение текущего ремонта';uk='Завершення поточного ремонту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗакрытиеМесяца" Тогда 
				Возврат НСтр("ru='Закрытие месяца';uk='Закриття місяця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗакупкаВСтранахЕАЭС" Тогда 
				Возврат НСтр("ru='Ввоз из ЕАЭС';uk='Ввезення з ЄАЕС'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗакупкаПоИмпорту" Тогда 
				Возврат НСтр("ru='Импорт';uk='Імпорт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗакупкаУДругойОрганизации" Тогда 
				Возврат НСтр("ru='Закупка у другой организации';uk='Купівля в іншій організації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗакупкаУПоставщика" Тогда 
				Возврат НСтр("ru='Закупка у поставщика';uk='Купівля у постачальника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗакупкаУПоставщикаРеглУчет" Тогда 
				Возврат НСтр("ru='Закупка по регл. учету';uk='Купівля по регл. обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗакупкаЧерезПодотчетноеЛицо" Тогда 
				Возврат НСтр("ru='Закупка через подотчетное лицо';uk='Купівля через підзвітну особу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗачетАвансаКлиента" Тогда 
				Возврат НСтр("ru='Зачет аванса клиента';uk='Залік авансу клієнта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗачетАвансаПоставщику" Тогда 
				Возврат НСтр("ru='Зачет аванса поставщику';uk='Зарахування авансу постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗачетВознагражденияАвансомКомиссионера" Тогда 
				Возврат НСтр("ru='Зачет вознаграждения в счет аванса комиссионера';uk='Залік винагороди в рахунок авансу комісіонера'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗачетВознагражденияАвансомКомитенту" Тогда 
				Возврат НСтр("ru='Зачет вознаграждения в счет аванса комитенту';uk='Залік винагороди в рахунок авансу комітенту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗачетВознагражденияОплатойКомиссионера" Тогда 
				Возврат НСтр("ru='Зачет вознаграждения оплатой комиссионера';uk='Залік винагороди оплатою комісіонера'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЗачетВознагражденияОплатойКомитенту" Тогда 
				Возврат НСтр("ru='Зачет вознаграждения оплатой комитенту';uk='Залік винагороди оплатою комітенту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИнвентаризацияКомиссионера" Тогда 
				Возврат НСтр("ru='Инвентаризация комиссионера';uk='Інвентаризація комісіонера'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИнкассацияДенежныхСредствВБанк" Тогда 
				Возврат НСтр("ru='Инкассация ДС в банк';uk='Інкасація ГК в банк'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИнкассацияДенежныхСредствИзБанка" Тогда 
				Возврат НСтр("ru='Инкассация ДС из банка';uk='Інкасація ГК з банку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсправлениеОшибок" Тогда 
				Возврат НСтр("ru='Исправление ошибок';uk='Виправлення помилок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИсправлениеПрочегоНачисленияНДС" Тогда 
				Возврат НСтр("ru='Исправление прочего начисления НДС';uk='Виправлення іншого нарахування ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомиссияПоЭквайрингу" Тогда 
				Возврат НСтр("ru='Комиссия по эквайрингу';uk='Комісія по еквайрингу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КонвертацияВалюты" Тогда 
				Возврат НСтр("ru='Конвертация валюты';uk='Конвертація валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаЗадолженности" Тогда 
				Возврат НСтр("ru='Корректировка задолженности';uk='Коригування заборгованості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаНалоговогоНазначенияКапитальныхИнвестиций" Тогда 
				Возврат НСтр("ru='Корректировка налогового назначения капитальных инвестиций';uk='Коригування податкового призначення капітальних інвестицій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаНалоговыхНазначений" Тогда 
				Возврат НСтр("ru='Корректировка налоговых назначений';uk='Коригування податкових призначень'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаОбособленногоУчета" Тогда 
				Возврат НСтр("ru='Корректировка обособленного учета';uk='Коригування відокремленого обліку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаПоСогласованиюСторон" Тогда 
				Возврат НСтр("ru='Корректировка по согласованию сторон';uk='Коригування за погодженням сторін'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаПоступленияСоСписаниемНаРасходы" Тогда 
				Возврат НСтр("ru='Корректировка поступления со списанием на расходы';uk='Коригування надходження зі списанням на витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаПоступленияСОтражениемНаПрочихДоходах" Тогда 
				Возврат НСтр("ru='Корректировка поступления с отражением на прочих доходах';uk='Коригування надходження з відображенням на інші доходи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаРеализацииСоСписаниемНаРасходы" Тогда 
				Возврат НСтр("ru='Корректировка реализации со списанием на расходы';uk='Коригування реалізації зі списанням на витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КорректировкаРеализацииСОтражениемНаПрочихДоходах" Тогда 
				Возврат НСтр("ru='Корректировка реализации с отражением на прочих доходах';uk='Коригування реалізації з відображенням на інші доходи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КурсовыеРазницыДепозитыПрибыль" Тогда 
				Возврат НСтр("ru='Курсовые разницы по депозитам (прибыль)';uk='Курсові різниці за депозитами (прибуток)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КурсовыеРазницыДепозитыУбыток" Тогда 
				Возврат НСтр("ru='Курсовые разницы по депозитам (убыток)';uk='Курсові різниці за депозитами (збиток)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КурсовыеРазницыДСПрибыль" Тогда 
				Возврат НСтр("ru='Курсовые разницы по денежным средствам (прибыль)';uk='Курсові різниці по грошовим коштам (прибуток)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КурсовыеРазницыДСУбыток" Тогда 
				Возврат НСтр("ru='Курсовые разницы по денежным средствам (убыток)';uk='Курсові різниці по грошовим коштам (збиток)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КурсовыеРазницыЗаймыВыданныеПрибыль" Тогда 
				Возврат НСтр("ru='Курсовые разницы по займам выданным (прибыль)';uk='Курсові різниці за виданими позиками (прибуток)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КурсовыеРазницыЗаймыВыданныеУбыток" Тогда 
				Возврат НСтр("ru='Курсовые разницы по займам выданным (убыток)';uk='Курсові різниці за виданими позиками (збиток)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КурсовыеРазницыКлиентыПрибыль" Тогда 
				Возврат НСтр("ru='Курсовые разницы по расчетам с клиентами (прибыль)';uk='Курсові різниці за розрахунками з клієнтами (прибуток)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КурсовыеРазницыКлиентыУбыток" Тогда 
				Возврат НСтр("ru='Курсовые разницы по расчетам с клиентами (убыток)';uk='Курсові різниці за розрахунками з клієнтами (збиток)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КурсовыеРазницыКредитыИЗаймыПрибыль" Тогда 
				Возврат НСтр("ru='Курсовые разницы по кредитам и займам (прибыль)';uk='Курсові різниці за кредитами і позиками (прибуток)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КурсовыеРазницыКредитыИЗаймыУбыток" Тогда 
				Возврат НСтр("ru='Курсовые разницы по кредитам и займам (убыток)';uk='Курсові різниці за кредитами і позиками (збиток)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КурсовыеРазницыПоставщикиПрибыль" Тогда 
				Возврат НСтр("ru='Курсовые разницы по расчетам с поставщиками (прибыль)';uk='Курсові різниці за розрахунками з постачальниками (прибуток)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КурсовыеРазницыПоставщикиУбыток" Тогда 
				Возврат НСтр("ru='Курсовые разницы по расчетам с поставщиками (убыток)';uk='Курсові різниці за розрахунками з постачальниками (збиток)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Модернизация" Тогда 
				Возврат НСтр("ru='Модернизация';uk='Модернізація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалоговыеОбязательстваПоставка" Тогда 
				Возврат НСтр("ru='НО поставка';uk='ПЗ поставка'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалоговыеОбязательстваРозничнаяПродажа" Тогда 
				Возврат НСтр("ru='НО розничная продажа';uk='ПЗ роздрібний продаж'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалоговыеОбязательстваУсловнаяПродажа" Тогда 
				Возврат НСтр("ru='НО условная продажа';uk='ПЗ умовний продаж'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НалоговыйКредитПоставка" Тогда 
				Возврат НСтр("ru='НК поставка';uk='ПК постачання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачислениеЗаработнойПлаты" Тогда 
				Возврат НСтр("ru='Начисление зарплаты';uk='Нарахування зарплати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачислениеИмущественныхНалогов" Тогда 
				Возврат НСтр("ru='Начисление имущественных налогов';uk='Нарахування майнових податків'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачислениеНалогаНаПрибыль" Тогда 
				Возврат НСтр("ru='Начисление налога на прибыль';uk='Нарахування податку на прибуток'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачислениеНДСНалоговымАгентом" Тогда 
				Возврат НСтр("ru='Начисление НДС налоговым агентом';uk='Нарахування ПДВ податковим агентом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачислениеНДСпоОтгрузкеТоваровВПути" Тогда 
				Возврат НСтр("ru='Начисление НДС по отгрузке без перехода права собственности';uk='Нарахування ПДВ за відвантаженням без переходу права власності'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачислениеНДССПолученногоАванса" Тогда 
				Возврат НСтр("ru='Начисление НДС с полученного аванса';uk='Нарахування ПДВ з отриманого авансу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачислениеРезервовПоВознаграждениям" Тогда 
				Возврат НСтр("ru='Начисление резервов по вознаграждениям';uk='Нарахування резервів за винагородами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачислениеРезервовПоСтраховымВзносам" Тогда 
				Возврат НСтр("ru='Начисление резервов по страховым взносам';uk='Нарахування резервів за страховими внесками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачислениеТорговогоСбора" Тогда 
				Возврат НСтр("ru='Начисление торгового сбора';uk='Нарахування торгового збору'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачисленияПоДепозитам" Тогда 
				Возврат НСтр("ru='Начисления по депозитам';uk='Нарахування за депозитами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачисленияПоЗаймамВыданным" Тогда 
				Возврат НСтр("ru='Начисления по займам выданным';uk='Нарахування за позиками виданими'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НачисленияПоКредитам" Тогда 
				Возврат НСтр("ru='Начисления по кредитам';uk='Нарахування за кредитами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОказаниеАгентскихУслуг" Тогда 
				Возврат НСтр("ru='Оказание агентских услуг';uk='Надання агентських послуг'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаДенежныхСредствВДругуюОрганизацию" Тогда 
				Возврат НСтр("ru='Оплата ДС в другую организацию';uk='Оплата ГК в іншу організацію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаЛизингодателю" Тогда 
				Возврат НСтр("ru='Оплата лизингодателю';uk='Оплата лізингодавцю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПоКредитам" Тогда 
				Возврат НСтр("ru='Оплата по кредитам и займам полученным';uk='Оплата за кредитами і позиками отриманими'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПоставщику" Тогда 
				Возврат НСтр("ru='Оплата поставщику';uk='Оплата постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПоставщикуПодотчетнымЛицом" Тогда 
				Возврат НСтр("ru='Оплата поставщику подотчетным лицом';uk='Оплата постачальнику підзвітною особою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОплатаПроцентовПоКредитам" Тогда 
				Возврат НСтр("ru='Оплата процентов по кредитам';uk='Оплата відсотків за кредитами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОприходованиеПоВозврату" Тогда 
				Возврат НСтр("ru='Оприходование по возврату';uk='Оприбуткування за поверненням'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОприходованиеТоваров" Тогда 
				Возврат НСтр("ru='Оприходование товаров';uk='Оприбуткування товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтгрузкаБезПереходаПраваСобственности" Тогда 
				Возврат НСтр("ru='Отгрузка (товары в пути)';uk='Відвантаження (товари у дорозі)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеЗадолженностиПередКомитентом" Тогда 
				Возврат НСтр("ru='Отражение задолженности перед комитентом';uk='Відображення заборгованості перед комітентом'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеЗаработнойПлаты" Тогда 
				Возврат НСтр("ru='Отражение заработной платы';uk='Відображення заробітної плати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеИзлишкаПриИнвентаризацииДенежныхСредств" Тогда 
				Возврат НСтр("ru='Отражение излишка при инвентаризации денежных средств';uk='Відображення надлишку при інвентаризації грошових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеИзлишкаПриИнкассацииДенежныхСредств" Тогда 
				Возврат НСтр("ru='Отражение излишка при инкассации денежных средств';uk='Відображення надлишку при інкасації грошових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеИзлишковНаДоходыПриПоступленииТоваров" Тогда 
				Возврат НСтр("ru='Отражение излишков на доходы при поступлении товаров';uk='Відображення надлишків на доходи при надходженні товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеНалоговВзносовСЗаработнойПлаты" Тогда 
				Возврат НСтр("ru='Отражение налогов взносов с заработной платы';uk='Відображення податків внесків із заробітної плати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеНалоговВзносовСоСдельнойЗаработнойПлаты" Тогда 
				Возврат НСтр("ru='Отражение налогов взносов со сдельной заработной платы';uk='Відображення податків внесків зі відрядної заробітної плати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеНДФЛ" Тогда 
				Возврат НСтр("ru='Отражение НДФЛ';uk='Відображення ПДФО'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеНедостачЗаСчетПоставщикаПриПоступленииТоваров" Тогда 
				Возврат НСтр("ru='Отражение недостач за счет поставщика при поступлении товаров';uk='Відображення нестач за рахунок постачальника при надходженні товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеНедостачЗаСчетСтороннейКомпанииПриПоступленииТоваров" Тогда 
				Возврат НСтр("ru='Отражение недостач за счет сторонней компании при поступлении товаров';uk='Відображення нестач за рахунок сторонньої компанії при надходженні товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеНедостачиПриИнвентаризацииДенежныхСредств" Тогда 
				Возврат НСтр("ru='Отражение недостачи при инвентаризации денежных средств';uk='Відображення нестачі під час інвентаризації грошових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеНедостачиПриИнкассацииДенежныхСредств" Тогда 
				Возврат НСтр("ru='Отражение недостачи при инкассации денежных средств';uk='Відображення нестачі при інкасації грошових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеНедостачНаРасходыПриПоступленииТоваров" Тогда 
				Возврат НСтр("ru='Отражение недостач на расходы при поступлении товаров';uk='Відображення нестач на витрати при надходженні товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеПрочихАктивовПассивов" Тогда 
				Возврат НСтр("ru='Отражение прочих активов/пассивов';uk='Відображення інших активів/пасивів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеРасходовЗаСчетПрочихАктивовПассивов" Тогда 
				Возврат НСтр("ru='Отражение расходов за счет прочих активов/пассивов';uk='Відображення витрат за рахунок інших активів/пасивів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтражениеСдельнойЗаработнойПлаты" Тогда 
				Возврат НСтр("ru='Отражение сдельной заработной платы';uk='Відображення відрядної заробітної плати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчетБанкаПоОперациямЭквайринга" Тогда 
				Возврат НСтр("ru='Отчет банка по операциям эквайринга';uk='Звіт банку за операціями еквайрингу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчетДавальцу" Тогда 
				Возврат НСтр("ru='Отчет давальцу';uk='Звіт давальцю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчетКомиссионера" Тогда 
				Возврат НСтр("ru='Отчет комиссионера';uk='Звіт комісіонера'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчетКомиссионераКомиссия" Тогда 
				Возврат НСтр("ru='Отчет комиссионера (комиссионное вознаграждение)';uk='Звіт комісіонера (комісійна винагорода)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчетКомиссионераОСписании" Тогда 
				Возврат НСтр("ru='Отчет комиссионера о списании';uk='Звіт комісіонера про списання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчетКомитенту" Тогда 
				Возврат НСтр("ru='Отчет комитенту';uk='Звіт комітенту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчетКомитентуОСписании" Тогда 
				Возврат НСтр("ru='Отчет комитенту о списании';uk='Звіт комітенту про списання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчетПоКомиссииМеждуОрганизациями" Тогда 
				Возврат НСтр("ru='Отчет по комиссии между организациями';uk='Звіт з комісії між організаціями'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОтчетПоКомиссииМеждуОрганизациямиОСписании" Тогда 
				Возврат НСтр("ru='Отчет по комиссии между организациями о списании';uk='Звіт з комісії між організаціями про списання'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОформлениеГТДСамостоятельно" Тогда 
				Возврат НСтр("ru='Самостоятельное оформление ГТД';uk='Самостійне оформлення ВМД'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаВПроизводство" Тогда 
				Возврат НСтр("ru='Передача в производство';uk='Передача в виробництво'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаВСоставНМА" Тогда 
				Возврат НСтр("ru='Передача в состав НМА';uk='Передача до складу НМА'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаВСоставОС" Тогда 
				Возврат НСтр("ru='Передача в состав основных средств';uk='Передача до складу основних засобів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаВЭксплуатацию" Тогда 
				Возврат НСтр("ru='Передача в эксплуатацию';uk='Передача в експлуатацію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаДавальцу" Тогда 
				Возврат НСтр("ru='Передача давальцу';uk='Передача давальцю'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаНаКомиссию" Тогда 
				Возврат НСтр("ru='Передача на комиссию';uk='Передача на комісію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаНаКомиссиюВДругуюОрганизацию" Тогда 
				Возврат НСтр("ru='Передача на комиссию в другую организацию';uk='Передача на комісію в іншу організацію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаНаПрочиеЦели" Тогда 
				Возврат НСтр("ru='Передача на прочие цели';uk='Передача на інші цілі'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПередачаПереработчику" Тогда 
				Возврат НСтр("ru='Передача переработчику';uk='Передача переробнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеремещениеДенежныхДокументов" Тогда 
				Возврат НСтр("ru='Перемещение денежных документов';uk='Переміщення грошових документів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеремещениеТоваров" Тогда 
				Возврат НСтр("ru='Перемещение товаров';uk='Переміщення товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереносПретензииНаАвансы" Тогда 
				Возврат НСтр("ru='Перенос претензии на авансы';uk='Перенесення претензії на аванси'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереносПретензииНаРасчеты" Тогда 
				Возврат НСтр("ru='Перенос претензии на расчеты';uk='Перенесення претензії на розрахунки'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереоценкаДенежныхСредств" Тогда 
				Возврат НСтр("ru='Переоценка денежных средств';uk='Переоцінка грошових коштів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереоценкаКредитовИДепозитов" Тогда 
				Возврат НСтр("ru='Переоценка кредитов, депозитов, займов';uk='Переоцінка кредитів, депозитів, позик'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереоценкаРасчетовСКлиентами" Тогда 
				Возврат НСтр("ru='Переоценка расчетов с клиентами';uk='Переоцінка розрахунків з клієнтами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереоценкаРасчетовСПоставщиками" Тогда 
				Возврат НСтр("ru='Переоценка расчетов с поставщиками';uk='Переоцінка розрахунків з постачальниками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПерерасчетПропорциональногоНДС" Тогда 
				Возврат НСтр("ru='Перерасчет пропорционального НДС';uk='Перерахунок пропорційного ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПересортицаТоваров" Тогда 
				Возврат НСтр("ru='Пересортица товаров';uk='Пересортиця товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПересортицаТоваровСПереоценкой" Тогда 
				Возврат НСтр("ru='Пересортица товаров (переоценка)';uk='Пересортиця товарів (переоцінка)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеВБюджет" Тогда 
				Возврат НСтр("ru='Перечисление налога';uk='Перерахування податку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеДенежныхСредствНаДругойСчет" Тогда 
				Возврат НСтр("ru='Перечисление ДС на другой счет';uk='Перерахування ГК на інший рахунок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеНаДепозиты" Тогда 
				Возврат НСтр("ru='Перечисление на депозиты';uk='Перерахування на депозити'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеТаможне" Тогда 
				Возврат НСтр("ru='Таможенный платеж';uk='Митний платіж'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПланированиеПоЗаказуКлиента" Тогда 
				Возврат НСтр("ru='Планирование по заказу клиента';uk='Планування по замовленню клієнта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПланированиеПоЗаказуПоставщику" Тогда 
				Возврат НСтр("ru='Планирование по заказу поставщику';uk='Планування по замовленню постачальнику'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПланированиеПоЗаявке" Тогда 
				Возврат НСтр("ru='Планирование по заявке';uk='Планування за заявкою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПланированиеПоСчету" Тогда 
				Возврат НСтр("ru='Планирование по счету';uk='Планування за рахунком'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПогашениеЗаймаСотрудником" Тогда 
				Возврат НСтр("ru='Погашение займа сотрудником';uk='Погашення позики співробітником'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокупкаВалюты" Тогда 
				Возврат НСтр("ru='Покупка валюты (не используется)';uk='Купівля валюти (не використовується)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПокупкаПолученнойВозвратнойТары" Тогда 
				Возврат НСтр("ru='Покупка полученной возвратной тары';uk='Купівля отриманої зворотної тари'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПорчаТоваров" Тогда 
				Возврат НСтр("ru='Порча товаров';uk='Псування товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПорчаТоваровСПереоценкой" Тогда 
				Возврат НСтр("ru='Порча товаров (переоценка)';uk='Псування товарів (переоцінка)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеДенежныхДокументовОтПодотчетника" Тогда 
				Возврат НСтр("ru='Поступление денежных документов от подотчетного лица';uk='Надходження грошових документів від підзвітної особи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеДенежныхДокументовОтПоставщика" Тогда 
				Возврат НСтр("ru='Поступление денежных документов от поставщика';uk='Надходження грошових документів від постачальника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеДенежныхСредствИзБанка" Тогда 
				Возврат НСтр("ru='Поступление ДС из банка';uk='Надходження ГК з банку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеДенежныхСредствИзДругойКассы" Тогда 
				Возврат НСтр("ru='Поступление ДС из другой кассы';uk='Надходження ГК з іншої каси'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеДенежныхСредствИзДругойОрганизации" Тогда 
				Возврат НСтр("ru='Поступление ДС от другой организации';uk='Надходження ГК від іншої організації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеДенежныхСредствИзКассыККМ" Тогда 
				Возврат НСтр("ru='Поступление ДС из кассы ККМ';uk='Надходження ГК з каси ККМ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет" Тогда 
				Возврат НСтр("ru='Поступление ДС из кассы на текущий счет';uk='Надходження ГК з каси на поточний рахунок'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеДенежныхСредствОтКонвертацииВалюты" Тогда 
				Возврат НСтр("ru='Поступление ДС от конвертации валюты';uk='Надходження ГК від конвертації валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеДенежныхСредствПоДепозитам" Тогда 
				Возврат НСтр("ru='Поступление ДС по депозитам';uk='Надходження ГК за депозитами'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеДенежныхСредствПоЗаймамВыданным" Тогда 
				Возврат НСтр("ru='Поступление ДС по выданным займам';uk='Надходження ГК за виданими позиками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеДенежныхСредствПоКредитам" Тогда 
				Возврат НСтр("ru='Поступление по кредитам и займам полученным';uk='Надходження за кредитами і позиками отриманими'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеДенежныхСредствСДругогоСчета" Тогда 
				Возврат НСтр("ru='Поступление ДС с другого счета';uk='Надходження ГК з іншого рахунку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеЗатрат" Тогда 
				Возврат НСтр("ru='Поступление затрат';uk='Надходження витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеИзПроизводства" Тогда 
				Возврат НСтр("ru='Поступление из производства';uk='Надходження з виробництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеНМА" Тогда 
				Возврат НСтр("ru='Поступление НМА';uk='Надходження НМА'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОбъектовСтроительства" Тогда 
				Возврат НСтр("ru='Поступление объектов строительства';uk='Надходження об'єктів будівництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОплатыОтКлиента" Тогда 
				Возврат НСтр("ru='Поступление оплаты от клиента';uk='Надходження оплати від клієнта'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОплатыОтКлиентаПоПлатежнойКарте" Тогда 
				Возврат НСтр("ru='Поступление оплаты от клиента по платежной карте';uk='Надходження оплати від клієнта платіжною картою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОплатыПоПлатежнойКарте" Тогда 
				Возврат НСтр("ru='Поступление оплаты по эквайрингу';uk='Надходження оплати по еквайрингу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОС" Тогда 
				Возврат НСтр("ru='Поступление основных средств';uk='Надходження основних засобів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОтДавальца" Тогда 
				Возврат НСтр("ru='Поступление от давальца';uk='Надходження від давальца'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОтПереработчика" Тогда 
				Возврат НСтр("ru='Поступление от переработчика';uk='Надходження від переробника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеОтПереработчикаФиксированнаяСтоимость" Тогда 
				Возврат НСтр("ru='Поступление от переработчика фиксированная стоимость';uk='Надходження від переробника фіксована вартість'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеПроцентовПоЗаймамВыданным" Тогда 
				Возврат НСтр("ru='Поступление процентов по займам выданным';uk='Надходження відсотків за виданими позиками'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеПрочихАктивов" Тогда 
				Возврат НСтр("ru='Поступление прочих активов';uk='Надходження інших активів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеПрочихУслуг" Тогда 
				Возврат НСтр("ru='Поступление прочих услуг';uk='Надходження інших послуг'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеУслуг" Тогда 
				Возврат НСтр("ru='Поступление услуг';uk='Надходження послуг'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПоступлениеУслугДляПроизводства" Тогда 
				Возврат НСтр("ru='Поступление услуг для производства';uk='Надходження послуг для виробництва'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредполагаемаяУсловнаяПродажа" Тогда 
				Возврат НСтр("ru='Предполагаемая условная продажа';uk='Передбачуваний умовний продаж'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПредполагаемоеВосстановлениеНДС" Тогда 
				Возврат НСтр("ru='Предполагаемое восстановление НДС';uk='Передбачуване відновлення ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриемНаКомиссию" Тогда 
				Возврат НСтр("ru='Прием на комиссию';uk='Приймання на комісію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПриемНаКомиссиюИмпорт" Тогда 
				Возврат НСтр("ru='Прием на комиссию (импорт)';uk='Приймання на комісію (імпорт)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПродажаВалюты" Тогда 
				Возврат НСтр("ru='Продажа валюты (не используется)';uk='Продаж валюти (не використовується)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизводствоИзДавальческогоСырья" Тогда 
				Возврат НСтр("ru='Производство из давальческого сырья';uk='Виробництво з давальницької сировини'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПроизводствоУПереработчика" Тогда 
				Возврат НСтр("ru='Производство у переработчика';uk='Виробництво у переробника'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочаяВыдачаДенежныхСредств" Тогда 
				Возврат НСтр("ru='Прочий расход ДС';uk='Інша витрата ГК'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочееНачислениеНДС" Тогда 
				Возврат НСтр("ru='Прочее начисление НДС';uk='Інше нарахування ПДВ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочееПоступлениеДенежныхСредств" Тогда 
				Возврат НСтр("ru='Прочее поступление ДС';uk='Інше надходження ГК'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочееПоступлениеТоваров" Тогда 
				Возврат НСтр("ru='Прочее поступление товаров';uk='Інше надходження товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеДоходы" Тогда 
				Возврат НСтр("ru='Прочие доходы';uk='Інші доходи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеДоходыАктивыПассивы" Тогда 
				Возврат НСтр("ru='Прочие доходы за счет прочих активов/пассивов';uk='Інші доходи за рахунок інших активів/пасивів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРасходы" Тогда 
				Возврат НСтр("ru='Прочие расходы';uk='Інші витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРасходыАктивыПассивы" Тогда 
				Возврат НСтр("ru='Прочие расходы за счет прочих активов/пассивов';uk='Інші витрати за рахунок інших активів/пасивів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПрочиеРасходыПодотчетногоЛица" Тогда 
				Возврат НСтр("ru='Прочие расходы подотчетного лица';uk='Інші витрати підзвітної особи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РаспределениеРасходовНаСебестоимость" Тогда 
				Возврат НСтр("ru='Распределение расходов на себестоимость';uk='Розподіл витрат на собівартість'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходыНаТаможенныеСборыШтрафы" Тогда 
				Возврат НСтр("ru='Расходы на таможенные сборы';uk='Витрати на митні збори'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходыОтПереоценкиТоваров" Тогда 
				Возврат НСтр("ru='Расходы от переоценки товаров';uk='Витрати від переоцінки товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РасходыПриКонвертацииВалюты" Тогда 
				Возврат НСтр("ru='Расходы при конвертации валюты';uk='Витрати при конвертації валюти'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияБезПереходаПраваСобственности" Тогда 
				Возврат НСтр("ru='Реализация (товары в пути)';uk='Реалізація (товари у дорозі)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияВРозницу" Тогда 
				Возврат НСтр("ru='Реализация в розницу';uk='Реалізація в роздріб'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияКлиенту" Тогда 
				Возврат НСтр("ru='Реализация';uk='Реалізація'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияКлиентуРеглУчет" Тогда 
				Возврат НСтр("ru='Реализация (только регл. учет)';uk='Реалізація (тільки регл. облік)'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияКомиссионногоТовара" Тогда 
				Возврат НСтр("ru='Реализация комиссионного товара';uk='Реалізація комісійного товару'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияНМА" Тогда 
				Возврат НСтр("ru='Реализация НМА';uk='Реалізація НМА'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияОС" Тогда 
				Возврат НСтр("ru='Реализация основных средств';uk='Реалізація основних засобів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияПереданнойВозвратнойТары" Тогда 
				Возврат НСтр("ru='Реализация переданной возвратной тары';uk='Реалізація переданої зворотної тари'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияПерепоставленногоТовара" Тогда 
				Возврат НСтр("ru='Реализация перепоставленного товара';uk='Реалізація перепоставленого товару'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияПодарочныхСертификатов" Тогда 
				Возврат НСтр("ru='Реализация подарочных сертификатов';uk='Реалізація подарункових сертифікатів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияПрочихАктивов" Тогда 
				Возврат НСтр("ru='Реализация прочих активов';uk='Реалізація інших активів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияПрочихУслуг" Тогда 
				Возврат НСтр("ru='Реализация прочих услуг';uk='Реалізація інших послуг'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "РеализацияТоваровВДругуюОрганизацию" Тогда 
				Возврат НСтр("ru='Реализация товаров в другую организацию';uk='Реалізація товарів в іншу організацію'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ремонт" Тогда 
				Возврат НСтр("ru='Ремонт';uk='Ремонт'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СборкаТоваров" Тогда 
				Возврат НСтр("ru='Сборка товаров';uk='Збирання товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СдачаДенежныхСредствВБанк" Тогда 
				Возврат НСтр("ru='Сдача ДС в банк';uk='Здача коштів в банк'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СнятиеНаличныхДенежныхСредств" Тогда 
				Возврат НСтр("ru='Инкассация ДС из банка в кассу';uk='Інкасація ГК з банку в касу'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеДебиторскойЗадолженности" Тогда 
				Возврат НСтр("ru='Списание дебиторской задолженности';uk='Списання дебіторської заборгованості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеДебиторскойЗадолженностиНаАктивыПассивы" Тогда 
				Возврат НСтр("ru='Списание дебиторской задолженности на активы \ пассивы';uk='Списання дебіторської заборгованості на активи \ пасиви'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеДебиторскойЗадолженностиНаРасходы" Тогда 
				Возврат НСтр("ru='Списание дебиторской задолженности на расходы';uk='Списання дебіторської заборгованості на витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеДенежныхДокументов" Тогда 
				Возврат НСтр("ru='Списание денежных документов';uk='Списання грошових документів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеКредиторскойЗадолженности" Тогда 
				Возврат НСтр("ru='Списание кредиторской задолженности';uk='Списання кредиторської заборгованості'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеКредиторскойЗадолженностиВДоходы" Тогда 
				Возврат НСтр("ru='Списание кредиторской задолженности в доходы';uk='Списання кредиторської заборгованості у доходи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеПрочихРасходов" Тогда 
				Возврат НСтр("ru='Списание прочих расходов';uk='Списання інших витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеТоваров" Тогда 
				Возврат НСтр("ru='Списание товаров';uk='Списання товарів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СписаниеТоваровПоТребованию" Тогда 
				Возврат НСтр("ru='Списание товаров по требованию';uk='Списання товарів за вимогою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СторнированиеПрочихДоходов" Тогда 
				Возврат НСтр("ru='Сторнирование прочих доходов';uk='Сторнування інших доходів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СторнированиеПрочихРасходов" Тогда 
				Возврат НСтр("ru='Сторнирование прочих расходов';uk='Сторнування інших витрат'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СторноПереданнойТары" Тогда 
				Возврат НСтр("ru='Сторно переданной тары';uk='Сторно переданої тари'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СторноПоступления" Тогда 
				Возврат НСтр("ru='Сторно поступления';uk='Сторно надходження'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СторноРеализации" Тогда 
				Возврат НСтр("ru='Сторно реализации';uk='Сторно реалізації'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СторноСписанияНаРасходы" Тогда 
				Возврат НСтр("ru='Сторно списания на расходы';uk='Сторно списання на витрати'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УдержаниеИзЗарплатыСотрудника" Тогда 
				Возврат НСтр("ru='Удержание из зарплаты сотрудника';uk='Утримання із зарплати працівника'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ХозяйственныеОперацииРеглУчет" Тогда 
			Если ИмяДляПеревода = "ПеремещениеНМА" Тогда 
				Возврат НСтр("ru='Перемещение НМА';uk='Переміщення НМА'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеремещениеОС" Тогда 
				Возврат НСтр("ru='Перемещение ОС';uk='Переміщення ОЗ'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеремещениеОСвПодразделениеВыделенноеНаБаланс" Тогда 
				Возврат НСтр("ru='Перемещение ОС в подразделение выделенное на отдельный баланс';uk='Переміщення ОЗ в підрозділ виділений на окремий баланс'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЦветаЗаметок" Тогда 
			Если ИмяДляПеревода = "Голубой" Тогда 
				Возврат НСтр("ru='Голубой';uk='Блакитний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Желтый" Тогда 
				Возврат НСтр("ru='Желтый';uk='Жовтий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Зеленый" Тогда 
				Возврат НСтр("ru='Зеленый';uk='Зелений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Красный" Тогда 
				Возврат НСтр("ru='Красный';uk='Червоний'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Оранжевый" Тогда 
				Возврат НСтр("ru='Оранжевый';uk='Жовтогарячий'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Синий" Тогда 
				Возврат НСтр("ru='Синий';uk='Синій'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Фиолетовый" Тогда 
				Возврат НСтр("ru='Фиолетовый';uk='Фіолетовий'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЦветностиИзображения" Тогда 
			Если ИмяДляПеревода = "ГрадацииСерого" Тогда 
				Возврат НСтр("ru='Градации серого';uk='Градації сірого'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Монохромное" Тогда 
				Возврат НСтр("ru='Монохромное';uk='Монохромне'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Цветное" Тогда 
				Возврат НСтр("ru='Цветное';uk='Кольорове'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЦелиОбращенияВТехподдержку" Тогда 
			Если ИмяДляПеревода = "ВопросОРаботеСПрограммой" Тогда 
				Возврат НСтр("ru='Вопрос о работе с программой';uk='Питання про роботу з програмою'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ОбращениеПоИнымПричинам" Тогда 
				Возврат НСтр("ru='Обращение по иным причинам';uk='Звернення з інших причин'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПожеланиеОПовышенииУдобстваРаботы" Тогда 
				Возврат НСтр("ru='Пожелание о повышении удобства работы';uk='Побажання про підвищення зручності роботи'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПожеланиеПоРазвитиюПрограммы" Тогда 
				Возврат НСтр("ru='Пожелание по развитию программы';uk='Побажання щодо розвитку програми'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СообщениеОбОшибке" Тогда 
				Возврат НСтр("ru='Сообщение об ошибке';uk='Повідомлення про помилку'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СообщениеОПроблемахСБыстродействием" Тогда 
				Возврат НСтр("ru='Сообщение о проблемах с быстродействием';uk='Повідомлення про проблеми з швидкодією'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЧастотаПланированияРемонтов" Тогда 
			Если ИмяДляПеревода = "Ежедневно" Тогда 
				Возврат НСтр("ru='Ежедневно';uk='Щодня'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ежемесячно" Тогда 
				Возврат НСтр("ru='Ежемесячно';uk='Щомісяця'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Еженедельно" Тогда 
				Возврат НСтр("ru='Еженедельно';uk='Щотижня'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЭтапыИзмененияАссортимента" Тогда 
			Если ИмяДляПеревода = "ВводВАссортимент" Тогда 
				Возврат НСтр("ru='Ввод в ассортимент';uk='Введення в асортимент'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВводВАссортиментСОтсрочкойНачалаПродаж" Тогда 
				Возврат НСтр("ru='Ввод в ассортимент с отсрочкой начала продаж';uk='Введення в асортимент з відстрочкою початку продажів'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыводИзАссортимента" Тогда 
				Возврат НСтр("ru='Вывод из ассортимента';uk='Виведення з асортименту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ИзменениеСостоянияАссортимента" Тогда 
				Возврат НСтр("ru='Изменение состояния ассортимента';uk='Зміна стану асортименту'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПереносВАрхивОтзыв" Тогда 
				Возврат НСтр("ru='Перенос в архив / отзыв';uk='Перенесення в архів / відкликання'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЭтапыПроверкиДокументаВРеглУчете" Тогда 
			Если ИмяДляПеревода = "КПовторнойПроверке" Тогда 
				Возврат НСтр("ru='На повторной проверке';uk='На повторній перевірці'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеПроверен" Тогда 
				Возврат НСтр("ru='Не проверен';uk='Не перевірений'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Проверен" Тогда 
				Возврат НСтр("ru='Проверен';uk='Перевірений'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЮридическоеФизическоеЛицо" Тогда 
			Если ИмяДляПеревода = "ФизическоеЛицо" Тогда 
				Возврат НСтр("ru='Физическое лицо';uk='Фізична особа'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЮридическоеЛицо" Тогда 
				Возврат НСтр("ru='Юридическое лицо';uk='Юридична особа'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ЮрФизЛицо" Тогда 
			Если ИмяДляПеревода = "ИндивидуальныйПредприниматель" Тогда 
				Возврат НСтр("ru='Физ. лицо - предприниматель';uk='Фіз. особа - підприємець'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ФизЛицо" Тогда 
				Возврат НСтр("ru='Физическое лицо';uk='Фізична особа'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЮрЛицо" Тогда 
				Возврат НСтр("ru='Юридическое лицо';uk='Юридична особа'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ЮрЛицоНеРезидент" Тогда 
				Возврат НСтр("ru='Юр. лицо, за пределами Украины';uk='Юр. особа, за межами України'" ,КодЯзыка);			
			КонецЕсли;
			
		КонецЕсли;	

КонецФункции // ОбработатьПереводы()

// Проверяет, соответствует ли язык платформы языку интерфейса пользователя 
Процедура ПроверитьСоответствиеЯзыкаПлатформыИПользователя() Экспорт
	
	
	ЯзыкПлатформы  = ТекущийЯзыкСистемы();
	ЯзыкИнтерфейса = ЛокализацияПовтИсп.КодЯзыкаИнтерфейса();
	Если Лев(ЯзыкПлатформы, 2) <> Лев(ЯзыкИнтерфейса, 2) Тогда
		
		ТекстСообщения = НСтр("ru='Язык интерфейса платформы (""%1"") не совпадает с языком интерфейса пользователя (""%2"")!
|Для корректной работы рекомендуется устанавливать одинаковые языки!
|Запустить платформу с необходимым языком интерфейса можно при помощи параметра запуска ""/L uk"" (или ""/L ru"").';uk='Мова інтерфейсу платформи (""%1"") не співпадає з мовою інтерфейсу користувача (""%2"")!
|Для коректної роботи рекомендується встановлювати однакові мови!
|Запустити платформу з необхідною мовою інтерфейсу можна за допомогою параметру запуску ""/L uk"" (або ""/L ru"").'");

		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ЯзыкПлатформы, ЯзыкИнтерфейса);

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьСоответствиеЯзыкаПлатформыИПользователя

// Возвращает представление вида метаданных на указанном языке
// 
// Параметры:
//  СтрокаВидМетаданных    – Строка - вид метаданных на языке редактирования конфигурации ("Справочник", "Документ" и т.д.)
//  КодЯзыка               – Строка – код языка
//
// Возвращаемое значение:
//  Строка   – представление вида метаданных 
//
Функция ПолучитьЛокализованноеПредставлениеВидаМетаданных(СтрокаВидМетаданных) Экспорт	
	
	Если СтрокаВидМетаданных = "Справочник" Тогда
		Возврат НСтр("ru='Справочник';uk='Довідник';");
	ИначеЕсли СтрокаВидМетаданных = "Документ" Тогда	
		Возврат НСтр("ru='Документ';uk='Документ';");
	ИначеЕсли СтрокаВидМетаданных = "Перечисление" Тогда	
		Возврат НСтр("ru='Перечисление';uk='Перерахування';");
	ИначеЕсли СтрокаВидМетаданных = "РегистрНакопления" Тогда	
		Возврат НСтр("ru='Регистр накопления';uk='Регістр накопичення'");
	ИначеЕсли СтрокаВидМетаданных = "РегистрСведений" Тогда	
		Возврат НСтр("ru='Регистр сведений';uk='Регістр відомостей'");
	ИначеЕсли СтрокаВидМетаданных = "РегистрБухгалтерии" Тогда	
		Возврат НСтр("ru='Регистр бухгалтерии';uk='Регістр бухгалтерії'");
	ИначеЕсли СтрокаВидМетаданных = "РегистрРасчета" Тогда	
		Возврат НСтр("ru='Регистр расчета';uk='Регістр розрахунку'");
 	КонецЕсли; 
	
КонецФункции // ПолучитьЛокализованноеПредставлениеВидаМетаданных()

Функция ПолучитьЛокализованноеСодержаниеПроводки(СодержаниеПроводки, КодЯзыка) Экспорт	
	Если КодЯзыка = "ru" Тогда
		Возврат СодержаниеПроводки;
	КонецЕсли;
    Если СодержаниеПроводки = " Внутренняя передача ДС(поступление)" Тогда
        Возврат НСтр("ru=' Внутренняя передача ДС(поступление)';uk=' Внутрішня передача ГК(надходження)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Акциз" Тогда
        Возврат НСтр("ru='Акциз';uk='Акциз'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Взаимозачет задолженности" Тогда
        Возврат НСтр("ru='Взаимозачет задолженности';uk='Взаємозалік заборгованості'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Взаиморасчеты по комиссионному товару" Тогда
        Возврат НСтр("ru='Взаиморасчеты по комиссионному товару';uk='Взаєморозрахунки за комісійного товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Внутренняя передача ДС" Тогда
        Возврат НСтр("ru='Внутренняя передача ДС';uk='Внутрішня передача ГК'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Военный сбор" Тогда
        Возврат НСтр("ru='Военный сбор';uk='Військовий збір'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат аванса в другую организацию" Тогда
        Возврат НСтр("ru='Возврат аванса в другую организацию';uk='Повернення авансу в іншу організацію'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат аванса другой организации" Тогда
        Возврат НСтр("ru='Возврат аванса другой организации';uk='Повернення авансу іншої організації'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат аванса клиенту" Тогда
        Возврат НСтр("ru='Возврат аванса клиенту';uk='Повернення авансу клієнту'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат аванса от другой организации" Тогда
        Возврат НСтр("ru='Возврат аванса от другой организации';uk='Повернення авансу від іншої організації'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат аванса от поставщика" Тогда
        Возврат НСтр("ru='Возврат аванса от поставщика';uk='Повернення авансу від постачальника'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат аванса розничному клиенту (наличные)" Тогда
        Возврат НСтр("ru='Возврат аванса розничному клиенту (наличные)';uk='Повернення авансу роздрібному клієнту (готівкові)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат аванса розничному клиенту (эквайринг)" Тогда
        Возврат НСтр("ru='Возврат аванса розничному клиенту (эквайринг)';uk='Повернення авансу роздрібному клієнту (еквайринг)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат ДД поставщику" Тогда
        Возврат НСтр("ru='Возврат ДД поставщику';uk='Повернення ГД постачальнику'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат ДД поставщику (доходы на разницу стоимости)" Тогда
        Возврат НСтр("ru='Возврат ДД поставщику (доходы на разницу стоимости)';uk='Повернення ГД постачальнику (доходи на різницю вартості)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат ДД поставщику (расходы на разницу стоимости)" Тогда
        Возврат НСтр("ru='Возврат ДД поставщику (расходы на разницу стоимости)';uk='Повернення ГД постачальнику (витрати на різницю вартості)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат долга в другую организацию" Тогда
        Возврат НСтр("ru='Возврат долга в другую организацию';uk='Повернення боргу в іншу організацію'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат залога за тару" Тогда
        Возврат НСтр("ru='Возврат залога за тару';uk='Повернення застави за тару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат излишне выплаченных суммы вследствие счетных ошибок" Тогда
        Возврат НСтр("ru='Возврат излишне выплаченных суммы вследствие счетных ошибок';uk='Повернення зайво виплачених суми внаслідок лічильних помилок'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат клиенту аванса" Тогда
        Возврат НСтр("ru='Возврат клиенту аванса';uk='Повернення клієнту авансу'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат клиенту залога за тару" Тогда
        Возврат НСтр("ru='Возврат клиенту залога за тару';uk='Повернення клієнту застави за тару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат клиенту оплаты" Тогда
        Возврат НСтр("ru='Возврат клиенту оплаты';uk='Повернення клієнту оплати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат комиссионного товара " Тогда
        Возврат НСтр("ru='Возврат комиссионного товара ';uk='Повернення комісійного товару '",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат комиссионного товара" Тогда
        Возврат НСтр("ru='Возврат комиссионного товара';uk='Повернення комісійного товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат комиссионных товаров от комиссионера (сторно)" Тогда
        Возврат НСтр("ru='Возврат комиссионных товаров от комиссионера (сторно)';uk='Повернення комісійних товарів від комісіонера (сторно)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат кредита, займа" Тогда
        Возврат НСтр("ru='Возврат кредита, займа';uk='Повернення кредиту, позики'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат материалов давальца" Тогда
        Возврат НСтр("ru='Возврат материалов давальца';uk='Повернення матеріалів давальца'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат материалов переданных в производство" Тогда
        Возврат НСтр("ru='Возврат материалов переданных в производство';uk='Повернення матеріалів переданих у виробництво'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат многооборотной тары" Тогда
        Возврат НСтр("ru='Возврат многооборотной тары';uk='Повернення багатооборотної тари'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат оплаты в другую организацию" Тогда
        Возврат НСтр("ru='Возврат оплаты в другую организацию';uk='Повернення оплати в іншу організацію'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат оплаты клиенту" Тогда
        Возврат НСтр("ru='Возврат оплаты клиенту';uk='Повернення оплати клієнту'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат оплаты от другой организации" Тогда
        Возврат НСтр("ru='Возврат оплаты от другой организации';uk='Повернення оплати від іншої організації'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат оплаты от поставщика" Тогда
        Возврат НСтр("ru='Возврат оплаты от поставщика';uk='Повернення оплати від постачальника'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат от подотчетника" Тогда
        Возврат НСтр("ru='Возврат от подотчетника';uk='Повернення від підзвітника'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат переданного комиссионного товара" Тогда
        Возврат НСтр("ru='Возврат переданного комиссионного товара';uk='Повернення переданого комісійного товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат переданного товара" Тогда
        Возврат НСтр("ru='Возврат переданного товара';uk='Повернення переданого товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат предоставленного займа" Тогда
        Возврат НСтр("ru='Возврат предоставленного займа';uk='Повернення наданої позики'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат продукции давальца" Тогда
        Возврат НСтр("ru='Возврат продукции давальца';uk='Повернення продукції давальца'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат продукции давальца из производства" Тогда
        Возврат НСтр("ru='Возврат продукции давальца из производства';uk='Повернення продукції давальца з виробництва'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат с депозитного счета" Тогда
        Возврат НСтр("ru='Возврат с депозитного счета';uk='Повернення з депозитного рахунку'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат себестоимости" Тогда
        Возврат НСтр("ru='Возврат себестоимости';uk='Повернення собівартості'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат собственных товаров от комиссионера" Тогда
        Возврат НСтр("ru='Возврат собственных товаров от комиссионера';uk='Повернення власних товарів від комісіонера'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат товаров давальца из производства" Тогда
        Возврат НСтр("ru='Возврат товаров давальца из производства';uk='Повернення товарів давальца з виробництва'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат товаров на склад из производства" Тогда
        Возврат НСтр("ru='Возврат товаров на склад из производства';uk='Повернення товарів на склад з виробництва'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Возврат товаров от комиссионера" Тогда
        Возврат НСтр("ru='Возврат товаров от комиссионера';uk='Повернення товарів від комісіонера'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Восстановление авансов клиентов" Тогда
        Возврат НСтр("ru='Восстановление авансов клиентов';uk='Відновлення авансів клієнтів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выдача в кассу ККМ" Тогда
        Возврат НСтр("ru='Выдача в кассу ККМ';uk='Видача в касу ККМ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выдача ДС в другую кассу" Тогда
        Возврат НСтр("ru='Выдача ДС в другую кассу';uk='Видача ГК в іншу касу'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выдача ДС подотчетнику" Тогда
        Возврат НСтр("ru='Выдача ДС подотчетнику';uk='Видача ГК підзвітній особі'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выдача займа сотруднику" Тогда
        Возврат НСтр("ru='Выдача займа сотруднику';uk='Видача позики співробітнику'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выдача подотчетнику" Тогда
        Возврат НСтр("ru='Выдача подотчетнику';uk='Видача підзвітній особі'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выдача подотчетному лицу" Тогда
        Возврат НСтр("ru='Выдача подотчетному лицу';uk='Видача підзвітній особі'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выплата зарплаты на лицевые счета" Тогда
        Возврат НСтр("ru='Выплата зарплаты на лицевые счета';uk='Виплата зарплати на особові рахунки'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выплата зарплаты по ведомостям" Тогда
        Возврат НСтр("ru='Выплата зарплаты по ведомостям';uk='Виплата зарплати за відомостями'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выплата зарплаты по зарплатному проекту" Тогда
        Возврат НСтр("ru='Выплата зарплаты по зарплатному проекту';uk='Виплата зарплати за зарплатним проектом'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выплата зарплаты работнику" Тогда
        Возврат НСтр("ru='Выплата зарплаты работнику';uk='Виплата зарплати працівнику'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выполнение работ" Тогда
        Возврат НСтр("ru='Выполнение работ';uk='Виконання робіт'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выпуск продукции" Тогда
        Возврат НСтр("ru='Выпуск продукции';uk='Випуск продукції'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выпуск продукции давальца" Тогда
        Возврат НСтр("ru='Выпуск продукции давальца';uk='Випуск продукції давальца'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выпуск работ" Тогда
        Возврат НСтр("ru='Выпуск работ';uk='Випуск робіт'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выпуск собственной продукции" Тогда
        Возврат НСтр("ru='Выпуск собственной продукции';uk='Випуск власної продукції'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выпуск собственной продукции в подразделение" Тогда
        Возврат НСтр("ru='Выпуск собственной продукции в подразделение';uk='Випуск власної продукції в підрозділ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выручка от продаж собственного товара" Тогда
        Возврат НСтр("ru='Выручка от продаж собственного товара';uk='Виторг від продажу власного товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выручка от реализации комиссионного товара" Тогда
        Возврат НСтр("ru='Выручка от реализации комиссионного товара';uk='Виторг від реалізації комісійного товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выручка от реализации работ и услуг" Тогда
        Возврат НСтр("ru='Выручка от реализации работ и услуг';uk='Виторг від реалізації робіт і послуг'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выручка от реализации собственного товара" Тогда
        Возврат НСтр("ru='Выручка от реализации собственного товара';uk='Виторг від реалізації власного товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Выручка от реализации услуг" Тогда
        Возврат НСтр("ru='Выручка от реализации услуг';uk='Виторг від реалізації послуг'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Вычет из доходов от продаж в рознице (возврат)" Тогда
        Возврат НСтр("ru='Вычет из доходов от продаж в рознице (возврат)';uk='Відрахування з доходів від продажів у роздробі (повернення)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Вычет из доходов от реализации комиссионного товара в рознице (возврат)" Тогда
        Возврат НСтр("ru='Вычет из доходов от реализации комиссионного товара в рознице (возврат)';uk='Відрахування з доходів від реалізації комісійного товару в роздробі (повернення)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Вычеты из доходов при возврате товара " Тогда
        Возврат НСтр("ru='Вычеты из доходов при возврате товара ';uk='Вирахування з доходів при поверненні товару '",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Вычеты из доходов при возврате товара" Тогда
        Возврат НСтр("ru='Вычеты из доходов при возврате товара';uk='Вирахування з доходів при поверненні товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Депонирование заработной платы" Тогда
        Возврат НСтр("ru='Депонирование заработной платы';uk='Депонування заробітної плати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Дооценка накопленной амортизации" Тогда
        Возврат НСтр("ru='Дооценка накопленной амортизации';uk='Дооцінка накопиченої амортизації'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Задолженность давальца за услуги" Тогда
        Возврат НСтр("ru='Задолженность давальца за услуги';uk='Заборгованість давальца за послуги'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Задолженность перед комитентом" Тогда
        Возврат НСтр("ru='Задолженность перед комитентом';uk='Заборгованість перед комітентом'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Задолженность покупателя" Тогда
        Возврат НСтр("ru='Задолженность покупателя';uk='Заборгованість покупця'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Затраты на комиссионное вознаграждение" Тогда
        Возврат НСтр("ru='Затраты на комиссионное вознаграждение';uk='Витрати на комісійну винагороду'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Зачет вознаграждения авансом (от комиссионера-покупателя)" Тогда
        Возврат НСтр("ru='Зачет вознаграждения авансом (от комиссионера-покупателя)';uk='Залік винагороди авансом (від комісіонера-покупця)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Зачет вознаграждения оплатой долга (от комиссионера-покупателя)" Тогда
        Возврат НСтр("ru='Зачет вознаграждения оплатой долга (от комиссионера-покупателя)';uk='Залік винагороди оплатою боргу (від комісіонера-покупця)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Излишек при инкасации ДС" Тогда
        Возврат НСтр("ru='Излишек при инкасации ДС';uk='Надлишок при інкасації грошових коштів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Излишки при инвентаризации ДС" Тогда
        Возврат НСтр("ru='Излишки при инвентаризации ДС';uk='Надлишки при інвентаризації грошових коштів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Инкассация" Тогда
        Возврат НСтр("ru='Инкассация';uk='Інкасація'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Инкассация из банка" Тогда
        Возврат НСтр("ru='Инкассация из банка';uk='Інкасація з банку'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Капитализация процентов по депозитам" Тогда
        Возврат НСтр("ru='Капитализация процентов по депозитам';uk='Капіталізація відсотків по депозитам'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Комиссионное вознаграждение" Тогда
        Возврат НСтр("ru='Комиссионное вознаграждение';uk='Комісійна винагорода'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Комиссия за услуги эквайринга" Тогда
        Возврат НСтр("ru='Комиссия за услуги эквайринга';uk='Комісія за послуги еквайрінгу'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Комиссия по кредитам полученным" Тогда
        Возврат НСтр("ru='Комиссия по кредитам полученным';uk='Комісія за кредитами отриманими'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Конвертация валюты" Тогда
        Возврат НСтр("ru='Конвертация валюты';uk='Конвертація валюти'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Корректировка налогового назначения ОС" Тогда
        Возврат НСтр("ru='Корректировка налогового назначения ОС';uk='Коригування податкового призначення ОЗ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Корректировка направления деятельности" Тогда
        Возврат НСтр("ru='Корректировка направления деятельности';uk='Коригування напряму діяльності'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Накопленная амортизация НМА" Тогда
        Возврат НСтр("ru='Накопленная амортизация НМА';uk='Накопичена амортизація НМА'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Накопленная амортизация ОС" Тогда
        Возврат НСтр("ru='Накопленная амортизация ОС';uk='Накопичена амортизація ОЗ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Налоговый кредит по операциям не обл. НДС" Тогда
        Возврат НСтр("ru='Налоговый кредит по операциям не обл. НДС';uk='Податковий кредит за операціями не опод. ПДВ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Начисление амортизации" Тогда
        Возврат НСтр("ru='Начисление амортизации';uk='Нарахування амортизації'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Начисление военного сбора с дивидендов физическим лицам" Тогда
        Возврат НСтр("ru='Начисление военного сбора с дивидендов физическим лицам';uk='Нарахування військового збору з дивідендів фізичним особам'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Начисление дивидендов физическим лицам" Тогда
        Возврат НСтр("ru='Начисление дивидендов физическим лицам';uk='Нарахування дивідендів фізичним особам'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Начисление дивидендов юридическим лицам" Тогда
        Возврат НСтр("ru='Начисление дивидендов юридическим лицам';uk='Нарахування дивідендів юридичним особам'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Начисление заработной платы на пассивы" Тогда
        Возврат НСтр("ru='Начисление заработной платы на пассивы';uk='Нарахування заробітної плати на пасиви'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Начисление заработной платы на прочие активы" Тогда
        Возврат НСтр("ru='Начисление заработной платы на прочие активы';uk='Нарахування заробітної плати на інші активи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Начисление заработной платы на расходы" Тогда
        Возврат НСтр("ru='Начисление заработной платы на расходы';uk='Нарахування заробітної плати на витрати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Начисление НДФЛ с дивидендов физическим лицам" Тогда
        Возврат НСтр("ru='Начисление НДФЛ с дивидендов физическим лицам';uk='Нарахування ПДФО з дивідендів фізичним особам'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Начисление процентов и комиссии по займам выданным" Тогда
        Возврат НСтр("ru='Начисление процентов и комиссии по займам выданным';uk='Нарахування відсотків та комісії за позиками виданими'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Начисление процентов по депозитам" Тогда
        Возврат НСтр("ru='Начисление процентов по депозитам';uk='Нарахування відсотків за депозитами'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Начисление процентов по кредитам полученным" Тогда
        Возврат НСтр("ru='Начисление процентов по кредитам полученным';uk='Нарахування відсотків за кредитами отриманими'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Начисленные проценты по займам" Тогда
        Возврат НСтр("ru='Начисленные проценты по займам';uk='Нараховані відсотки за позиками'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС комиссионное вознаграждение" Тогда
        Возврат НСтр("ru='НДС комиссионное вознаграждение';uk='ПДВ комісійна винагорода'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС на комиссионное вознаграждение" Тогда
        Возврат НСтр("ru='НДС на комиссионное вознаграждение';uk='ПДВ на комісійну винагороду'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС по комиссионному вознаграждению" Тогда
        Возврат НСтр("ru='НДС по комиссионному вознаграждению';uk='ПДВ по комісійній винагороді'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС при приобретении" Тогда
        Возврат НСтр("ru='НДС при приобретении';uk='ПДВ при придбанні'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС с комиссионного вознаграждения" Тогда
        Возврат НСтр("ru='НДС с комиссионного вознаграждения';uk='ПДВ з комісійної винагороди'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: изменение балансовой стоимости в связи с перерасчетом пропорц. НДС" Тогда
        Возврат НСтр("ru='НДС: изменение балансовой стоимости в связи с перерасчетом пропорц. НДС';uk='ПДВ: зміна балансової вартості у зв''язку з перерахунком пропорц. ПДВ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: изменение накопленной амортизации в связи с перерасчетом пропорц. НДС" Тогда
        Возврат НСтр("ru='НДС: изменение накопленной амортизации в связи с перерасчетом пропорц. НДС';uk='ПДВ: зміна накопиченої амортизації у зв''язку з перерахунком пропорц. ПДВ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: корректировка налогового кредита по пропорц. НДС" Тогда
        Возврат НСтр("ru='НДС: корректировка налогового кредита по пропорц. НДС';uk='ПДВ: коригування податкового кредиту за пропорц. ПДВ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: корректировка пропорц. НДС по предоплатам за товары/услуги" Тогда
        Возврат НСтр("ru='НДС: корректировка пропорц. НДС по предоплатам за товары/услуги';uk='ПДВ: коригування пропорц. ПДВ за передоплатою за товари/послуги'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: корректировка пропорц. НДС по списанным необоротным активам" Тогда
        Возврат НСтр("ru='НДС: корректировка пропорц. НДС по списанным необоротным активам';uk='ПДВ: коригування пропорц. ПДВ по списаних необоротних активах'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: корректировка пропорц. НДС по товарам/услугам и ОС" Тогда
        Возврат НСтр("ru='НДС: корректировка пропорц. НДС по товарам/услугам и ОС';uk='ПДВ: коригування пропорц. ПДВ за товарами/послугами та ОЗ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: на расходы" Тогда
        Возврат НСтр("ru='НДС: на расходы';uk='ПДВ: на витрати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: на себестоимость запасов" Тогда
        Возврат НСтр("ru='НДС: на себестоимость запасов';uk='ПДВ: на собівартість запасів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговые обязательства неподтвержденные" Тогда
        Возврат НСтр("ru='НДС: налоговые обязательства неподтвержденные';uk='ПДВ: податкові зобов''язання непідтверджені'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговые обязательства: затраты" Тогда
        Возврат НСтр("ru='НДС: налоговые обязательства: затраты';uk='ПДВ: податкові зобов''язання: витрати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговые обязательства: корректировка (Приложение 2)" Тогда
        Возврат НСтр("ru='НДС: налоговые обязательства: корректировка (Приложение 2)';uk='ПДВ: податкові зобов''язання: коригування (Додаток 2)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговые обязательства: корректировка (Приложение 2) доходы" Тогда
        Возврат НСтр("ru='НДС: налоговые обязательства: корректировка (Приложение 2) доходы';uk='ПДВ: податкові зобов''язання: коригування (Додаток 2) доходи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговые обязательства: корректировка по цене продажи" Тогда
        Возврат НСтр("ru='НДС: налоговые обязательства: корректировка по цене продажи';uk='ПДВ: податкові зобов''язання: коригування за ціною продажу'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговые обязательства: налоговая накладная" Тогда
        Возврат НСтр("ru='НДС: налоговые обязательства: налоговая накладная';uk='ПДВ: податкові зобов''язання: податкова накладна'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговые обязательства: отгрузка" Тогда
        Возврат НСтр("ru='НДС: налоговые обязательства: отгрузка';uk='ПДВ: податкові зобов''язання: відвантаження'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговые обязательства: продажа ниже ОЦ" Тогда
        Возврат НСтр("ru='НДС: налоговые обязательства: продажа ниже ОЦ';uk='ПДВ: податкові зобов''язання: продаж нижче ЗЦ'",КодЯзыка);
	 ИначеЕсли СодержаниеПроводки = "НДС: налоговые обязательства: продажа ниже ОЦ корректировка (Приложение 2)" Тогда
        Возврат НСтр("ru='НДС: налоговые обязательства: продажа ниже ОЦ корректировка (Приложение 2)';uk='ПДВ: податкові зобов''язання: продаж нижче ЗЦ коригування (Додаток 2)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговые обязательства: сторно" Тогда
        Возврат НСтр("ru='НДС: налоговые обязательства: сторно';uk='ПДВ: податкові зобов''язання: сторно'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговые обязательства: условная продажа" Тогда
        Возврат НСтр("ru='НДС: налоговые обязательства: условная продажа';uk='ПДВ: податкові зобов''язання: умовний продаж'",КодЯзыка);
	ИначеЕсли СодержаниеПроводки = "НДС: налоговые обязательства: условная продажа корректировка (Приложение 2)" Тогда
        Возврат НСтр("ru='НДС: налоговые обязательства: условная продажа корректировка (Приложение 2)';uk='ПДВ: податкові зобов''язання: умовний продаж коригування (Додаток 2)'",КодЯзыка);
	ИначеЕсли СодержаниеПроводки = "НДС: налоговые обязательства: доходы корректировка (Приложение 2)" Тогда
        Возврат НСтр("ru='НДС: налоговые обязательства: доходы корректировка (Приложение 2)';uk='ПДВ: податкові зобов''язання: доходи коригування (Додаток 2)'",КодЯзыка);	
    ИначеЕсли СодержаниеПроводки = "НДС: налоговый кредит" Тогда
        Возврат НСтр("ru='НДС: налоговый кредит';uk='ПДВ: податковий кредит'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговый кредит не подтвержденный" Тогда
        Возврат НСтр("ru='НДС: налоговый кредит не подтвержденный';uk='ПДВ: податковий кредит, не підтверджений'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговый кредит неподтвержденный: сторно" Тогда
        Возврат НСтр("ru='НДС: налоговый кредит неподтвержденный: сторно';uk='ПДВ: податковий кредит непідтверджений: сторно'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговый кредит: исправление ошибки" Тогда
        Возврат НСтр("ru='НДС: налоговый кредит: исправление ошибки';uk='ПДВ: податковий кредит: виправлення помилки'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговый кредит: корректировка по цене продажи" Тогда
        Возврат НСтр("ru='НДС: налоговый кредит: корректировка по цене продажи';uk='ПДВ: податковий кредит: коригування за ціною продажу'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговый кредит: отгрузка" Тогда
        Возврат НСтр("ru='НДС: налоговый кредит: отгрузка';uk='ПДВ: податковий кредит: відвантаження'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговый кредит: поступление" Тогда
        Возврат НСтр("ru='НДС: налоговый кредит: поступление';uk='ПДВ: податковий кредит: надходження'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: налоговый кредит: поступление (сторно)" Тогда
        Возврат НСтр("ru='НДС: налоговый кредит: поступление (сторно)';uk='ПДВ: податковий кредит: надходження (сторно)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: обязательства неподтвержденные, работы и услуги" Тогда
        Возврат НСтр("ru='НДС: обязательства неподтвержденные, работы и услуги';uk='ПДВ: зобов''язання непідтверджені, роботи і послуги'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: обязательства неподтвержденные, товары" Тогда
        Возврат НСтр("ru='НДС: обязательства неподтвержденные, товары';uk='ПДВ: зобов''язання непідтверджені, товари'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: обязательства неподтвержденные, товары (возврат)" Тогда
        Возврат НСтр("ru='НДС: обязательства неподтвержденные, товары (возврат)';uk='ПДВ: зобов''язання непідтверджені, товари (повернення)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: обязательства неподтвержденные, товары (сторно)" Тогда
        Возврат НСтр("ru='НДС: обязательства неподтвержденные, товары (сторно)';uk='ПДВ: зобов''язання непідтверджені, товари (сторно)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: обязательства неподтвержденные, услуги" Тогда
        Возврат НСтр("ru='НДС: обязательства неподтвержденные, услуги';uk='ПДВ: зобов''язання непідтверджені, послуги'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: обязательства, товары" Тогда
        Возврат НСтр("ru='НДС: обязательства, товары';uk='ПДВ: зобов''язання, товари'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДС: обязательства, товары (сторно)" Тогда
        Возврат НСтр("ru='НДС: обязательства, товары (сторно)';uk='ПДВ: зобов''язання, товари (сторно)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "НДФЛ" Тогда
        Возврат НСтр("ru='НДФЛ';uk='ПДФО'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Недостача при инвентаризации ДС" Тогда
        Возврат НСтр("ru='Недостача при инвентаризации ДС';uk='Нестача при інвентаризації ГК'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Недостачи при инкассации ДС" Тогда
        Возврат НСтр("ru='Недостачи при инкассации ДС';uk='Нестачі при інкасації ГК'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Оплата аванса в другую организацию" Тогда
        Возврат НСтр("ru='Оплата аванса в другую организацию';uk='Оплата авансу в іншу організацію'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Оплата аванса другой организации" Тогда
        Возврат НСтр("ru='Оплата аванса другой организации';uk='Оплата авансу іншій організації'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Оплата аванса поставщикам через подотчетное лицо" Тогда
        Возврат НСтр("ru='Оплата аванса поставщикам через подотчетное лицо';uk='Оплата авансу постачальникам через підзвітну особу'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Оплата аванса поставщику" Тогда
        Возврат НСтр("ru='Оплата аванса поставщику';uk='Оплата авансу постачальнику'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Оплата долга другой организации" Тогда
        Возврат НСтр("ru='Оплата долга другой организации';uk='Оплата боргу іншої організації'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Оплата долга поставщику" Тогда
        Возврат НСтр("ru='Оплата долга поставщику';uk='Оплата боргу постачальнику'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Оплата комиссии по кредиту, займу" Тогда
        Возврат НСтр("ru='Оплата комиссии по кредиту, займу';uk='Оплата комісії за кредитом, позикою'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Оплата платежной картой" Тогда
        Возврат НСтр("ru='Оплата платежной картой';uk='Оплата платіжною картою'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Оплата подарочным сертификатом" Тогда
        Возврат НСтр("ru='Оплата подарочным сертификатом';uk='Оплата подарунковим сертифікатом'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Оплата поставщикам через подотчетное лицо" Тогда
        Возврат НСтр("ru='Оплата поставщикам через подотчетное лицо';uk='Оплата постачальникам через підзвітну особу'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Оплата процентов по кредиту, займу" Тогда
        Возврат НСтр("ru='Оплата процентов по кредиту, займу';uk='Оплата відсотків за кредитом, позикою'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Оприходование товаров" Тогда
        Возврат НСтр("ru='Оприходование товаров';uk='Оприбуткування товарів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Оприходование товаров по себестоимости" Тогда
        Возврат НСтр("ru='Оприходование товаров по себестоимости';uk='Оприбуткування товарів за собівартістю'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Оприходование товаров по указанной стоимости" Тогда
        Возврат НСтр("ru='Оприходование товаров по указанной стоимости';uk='Оприбуткування товарів за вказаною вартістю'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки авансов от розничного клиента" Тогда
        Возврат НСтр("ru='Остатки авансов от розничного клиента';uk='Залишки авансів від роздрібного клієнта'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки авансов поставщикам" Тогда
        Возврат НСтр("ru='Остатки авансов поставщикам';uk='Залишки авансів постачальникам'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки авансов, полученных от других организаций" Тогда
        Возврат НСтр("ru='Остатки авансов, полученных от других организаций';uk='Залишки авансів, отриманих від інших організацій'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки авансов, полученных от клиентов" Тогда
        Возврат НСтр("ru='Остатки авансов, полученных от клиентов';uk='Залишки авансів, отриманих від клієнтів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки безналичных денежных средств" Тогда
        Возврат НСтр("ru='Остатки безналичных денежных средств';uk='Залишки безготівкових коштів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки выплат по кредитам и займам" Тогда
        Возврат НСтр("ru='Остатки выплат по кредитам и займам';uk='Залишки виплат за кредитами і позиками'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки выплаченной комиссии по кредитам" Тогда
        Возврат НСтр("ru='Остатки выплаченной комиссии по кредитам';uk='Залишки виплаченої комісії за кредитами'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки выплаченных процентов по кредитам" Тогда
        Возврат НСтр("ru='Остатки выплаченных процентов по кредитам';uk='Залишки виплачених відсотків за кредитами'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки задолженности клиентов" Тогда
        Возврат НСтр("ru='Остатки задолженности клиентов';uk='Залишки заборгованості клієнтів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки задолженности клиентов по таре" Тогда
        Возврат НСтр("ru='Остатки задолженности клиентов по таре';uk='Залишки заборгованості клієнтів по тарі'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки задолженности перед поставщиками" Тогда
        Возврат НСтр("ru='Остатки задолженности перед поставщиками';uk='Залишки заборгованості перед постачальниками'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки задолженности по реализациям другим организациям" Тогда
        Возврат НСтр("ru='Остатки задолженности по реализациям другим организациям';uk='Залишки заборгованості за реалізаціями іншим організаціям'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки наличных денежных средств" Тогда
        Возврат НСтр("ru='Остатки наличных денежных средств';uk='Залишки готівки'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки наличных денежных средств в кассах ККМ" Тогда
        Возврат НСтр("ru='Остатки наличных денежных средств в кассах ККМ';uk='Залишки готівкових грошових коштів в касах ККМ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки начисленной комиссии по кредитам" Тогда
        Возврат НСтр("ru='Остатки начисленной комиссии по кредитам';uk='Залишки нарахованої комісії за кредитами'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки начисленных процентов по кредитам" Тогда
        Возврат НСтр("ru='Остатки начисленных процентов по кредитам';uk='Залишки нарахованих відсотків за кредитами'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки обственных товаров" Тогда
        Возврат НСтр("ru='Остатки обственных товаров';uk='Залишки власних товарів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки по депозитам" Тогда
        Возврат НСтр("ru='Остатки по депозитам';uk='Залишки за депозитами'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки по займам выданным" Тогда
        Возврат НСтр("ru='Остатки по займам выданным';uk='Залишки за позиками виданими'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки по кредитам и займам" Тогда
        Возврат НСтр("ru='Остатки по кредитам и займам';uk='Залишки за кредитами і позиками'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки полученных денег по депозитам" Тогда
        Возврат НСтр("ru='Остатки полученных денег по депозитам';uk='Залишки отриманих грошей за депозитами'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки полученных денег по займам выданным" Тогда
        Возврат НСтр("ru='Остатки полученных денег по займам выданным';uk='Залишки отриманих грошей за позиками виданими'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки полученных процентов по займам выданным" Тогда
        Возврат НСтр("ru='Остатки полученных процентов по займам выданным';uk='Залишки отриманих відсотків за позиками виданими'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки процентов по займам выданным" Тогда
        Возврат НСтр("ru='Остатки процентов по займам выданным';uk='Залишки відсотків за позиками виданими'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки прочих активов" Тогда
        Возврат НСтр("ru='Остатки прочих активов';uk='Залишки інших активів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки прочих расходов " Тогда
        Возврат НСтр("ru='Остатки прочих расходов ';uk='Залишки інших витрат '",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки расчетов по эквайрингу" Тогда
        Возврат НСтр("ru='Остатки расчетов по эквайрингу';uk='Залишки розрахунків по еквайрингу'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки счета учета НМА" Тогда
        Возврат НСтр("ru='Остатки счета учета НМА';uk='Залишки рахунку обліку НМА'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки счета учета ОС" Тогда
        Возврат НСтр("ru='Остатки счета учета ОС';uk='Залишки рахунку обліку ОЗ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки ТМЦ в эксплуатации" Тогда
        Возврат НСтр("ru='Остатки ТМЦ в эксплуатации';uk='Залишки ТМЦ в експлуатації'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки товаров, переданных в производство" Тогда
        Возврат НСтр("ru='Остатки товаров, переданных в производство';uk='Залишки товарів, переданих у виробництво'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки товаров, переданных на комиссию" Тогда
        Возврат НСтр("ru='Остатки товаров, переданных на комиссию';uk='Залишки товарів, переданих на комісію'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки товаров, переданных переработчику" Тогда
        Возврат НСтр("ru='Остатки товаров, переданных переработчику';uk='Залишки товарів, переданих переробнику'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Остатки товаров, принятых на комиссию" Тогда
        Возврат НСтр("ru='Остатки товаров, принятых на комиссию';uk='Залишки товарів, прийнятих на комісію'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отклонение в стоимости возвратной тары в доходы" Тогда
        Возврат НСтр("ru='Отклонение в стоимости возвратной тары в доходы';uk='Відхилення у вартості зворотної тари в доходи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отклонение в стоимости возвратной тары на расходы" Тогда
        Возврат НСтр("ru='Отклонение в стоимости возвратной тары на расходы';uk='Відхилення у вартості зворотної тари на витрати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отклонение в стоимости возвращаемой тары в доходы" Тогда
        Возврат НСтр("ru='Отклонение в стоимости возвращаемой тары в доходы';uk='Відхилення у вартості тари, яка підлягає поверненню, в доходи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отклонение в стоимости возвращамой тары на расходы" Тогда
        Возврат НСтр("ru='Отклонение в стоимости возвращамой тары на расходы';uk='Відхилення у вартості тари, яка підлягає поверненню, на витрати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отклонение в стоимости возвращенных товаров (доходы)" Тогда
        Возврат НСтр("ru='Отклонение в стоимости возвращенных товаров (доходы)';uk='Відхилення у вартості повернутих товарів (доходи)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отклонение в стоимости возвращенных товаров (расходы)" Тогда
        Возврат НСтр("ru='Отклонение в стоимости возвращенных товаров (расходы)';uk='Відхилення у вартості повернутих товарів (витрати)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отклонение в стоимости возвращенных товаров в доходы" Тогда
        Возврат НСтр("ru='Отклонение в стоимости возвращенных товаров в доходы';uk='Відхилення у вартості повернутих товарів в доходи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отклонение в стоимости возвращенных товаров на расходы" Тогда
        Возврат НСтр("ru='Отклонение в стоимости возвращенных товаров на расходы';uk='Відхилення у вартості повернутих товарів на витрати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отклонение в стоимости собственных товаров" Тогда
        Возврат НСтр("ru='Отклонение в стоимости собственных товаров';uk='Відхилення у вартості власних товарів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отклонение в стоимости собственных товаров в доходы" Тогда
        Возврат НСтр("ru='Отклонение в стоимости собственных товаров в доходы';uk='Відхилення у вартості власних товарів в доходи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отклонение в стоимости собственных товаров на расходы" Тогда
        Возврат НСтр("ru='Отклонение в стоимости собственных товаров на расходы';uk='Відхилення у вартості власних товарів на витрати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отклонение в стоимости товаров" Тогда
        Возврат НСтр("ru='Отклонение в стоимости товаров';uk='Відхилення у вартості товарів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отпуск за счет обязательств" Тогда
        Возврат НСтр("ru='Отпуск за счет обязательств';uk='Відпустка за рахунок зобов''язань'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отражение взаиморасчетов по комиссионному товару" Тогда
        Возврат НСтр("ru='Отражение взаиморасчетов по комиссионному товару';uk='Відображення взаєморозрахунків по комісійному товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отражение задолженности покупателя" Тогда
        Возврат НСтр("ru='Отражение задолженности покупателя';uk='Відображення заборгованості покупця'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отражение расходов по комиссионному товару" Тогда
        Возврат НСтр("ru='Отражение расходов по комиссионному товару';uk='Відображення витрат по комісійному товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Отрицательная разница (расходы) от покупки иностранной валюты" Тогда
        Возврат НСтр("ru='Отрицательная разница (расходы) от покупки иностранной валюты';uk='Від''ємна різниця (витрати) від купівлі іноземної валюти'",КодЯзыка);
	ИначеЕсли СодержаниеПроводки = "Оценка стоимости ОС при условной продаже" Тогда
        Возврат НСтр("ru='Оценка стоимости ОС при условной продаже';uk='Оцінка вартості ОЗ при умовному продажу'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перевод на депозитный счет" Тогда
        Возврат НСтр("ru='Перевод на депозитный счет';uk='Переведення на депозитний рахунок'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Передача в переработку" Тогда
        Возврат НСтр("ru='Передача в переработку';uk='Передача в переробку'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Передача возвратной тары" Тогда
        Возврат НСтр("ru='Передача возвратной тары';uk='Передача звротної тари'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Передача на комиссию" Тогда
        Возврат НСтр("ru='Передача на комиссию';uk='Передача на комісію'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Передача на субкомиссию" Тогда
        Возврат НСтр("ru='Передача на субкомиссию';uk='Передача на субкомісію'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Передача продукции давальца в производство" Тогда
        Возврат НСтр("ru='Передача продукции давальца в производство';uk='Передача продукції давальця у виробництво'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Передача ТМЦ в эксплуатацию" Тогда
        Возврат НСтр("ru='Передача ТМЦ в эксплуатацию';uk='Передача ТМЦ в експлуатацію'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Передача товаров давальца в производство" Тогда
        Возврат НСтр("ru='Передача товаров давальца в производство';uk='Передача товарів давальця у виробництво'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Передача товаров давальца в производство (сторно)" Тогда
        Возврат НСтр("ru='Передача товаров давальца в производство (сторно)';uk='Передача товарів давальця у виробництво (сторно)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Передача товаров на комиссию" Тогда
        Возврат НСтр("ru='Передача товаров на комиссию';uk='Передача товарів на комісію'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перемещение амортизации НМА" Тогда
        Возврат НСтр("ru='Перемещение амортизации НМА';uk='Переміщення амортизації НМА'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перемещение амортизации ОС" Тогда
        Возврат НСтр("ru='Перемещение амортизации ОС';uk='Переміщення амортизації ОЗ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перемещение комиссионных товаров" Тогда
        Возврат НСтр("ru='Перемещение комиссионных товаров';uk='Переміщення комісійних товарів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перемещение материалов в производстве" Тогда
        Возврат НСтр("ru='Перемещение материалов в производстве';uk='Переміщення матеріалів у виробництві'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перемещение НМА" Тогда
        Возврат НСтр("ru='Перемещение НМА';uk='Переміщення НМА'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перемещение ОС" Тогда
        Возврат НСтр("ru='Перемещение ОС';uk='Переміщення ОЗ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перемещение продукции давальца" Тогда
        Возврат НСтр("ru='Перемещение продукции давальца';uk='Переміщення продукції давальця'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перемещение собственных товаров" Тогда
        Возврат НСтр("ru='Перемещение собственных товаров';uk='Переміщення власних товарів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перемещение ТМЦ в эксплуатации" Тогда
        Возврат НСтр("ru='Перемещение ТМЦ в эксплуатации';uk='Переміщення ТМЦ в експлуатації'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перенос начисленной амортизации НМА" Тогда
        Возврат НСтр("ru='Перенос начисленной амортизации НМА';uk='Перенесення нарахованої амортизації НМА'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перенос оплаты на аванс" Тогда
        Возврат НСтр("ru='Перенос оплаты на аванс';uk='Перенесення оплати на аванс'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Переоценка НМА" Тогда
        Возврат НСтр("ru='Переоценка НМА';uk='Переоцінка НМА'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Переоценка ОС" Тогда
        Возврат НСтр("ru='Переоценка ОС';uk='Переоцінка ОЗ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перечисление выданного займа" Тогда
        Возврат НСтр("ru='Перечисление выданного займа';uk='Перерахування виданої позики'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перечисление ДС на другой счет" Тогда
        Возврат НСтр("ru='Перечисление ДС на другой счет';uk='Перерахування ГК на інший рахунок'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Перечисление налогов" Тогда
        Возврат НСтр("ru='Перечисление налогов';uk='Перерахування податків'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Погашение процентов по займу сотруднику" Тогда
        Возврат НСтр("ru='Погашение процентов по займу сотруднику';uk='Погашення відсотків за позикою співробітнику'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Погашение стоимости" Тогда
        Возврат НСтр("ru='Погашение стоимости';uk='Погашення вартості'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Погрешность расчета себестоимости (НЗП)" Тогда
        Возврат НСтр("ru='Погрешность расчета себестоимости (НЗП)';uk='Похибка розрахунку собівартості (НЗВ)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Погрешность расчета себестоимости (переработка)" Тогда
        Возврат НСтр("ru='Погрешность расчета себестоимости (переработка)';uk='Похибка розрахунку собівартості (переробка)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Погрешность расчета себестоимости (товары)" Тогда
        Возврат НСтр("ru='Погрешность расчета себестоимости (товары)';uk='Похибка розрахунку собівартості (товари)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Положительная разница (доходы) от покупки иностранной валюты" Тогда
        Возврат НСтр("ru='Положительная разница (доходы) от покупки иностранной валюты';uk='Позитивна різниця (доходи) від купівлі іноземної валюти'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Получение оплаты от клиента" Тогда
        Возврат НСтр("ru='Получение оплаты от клиента';uk='Отримання оплати від клієнта'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Получение услуг на прочие активы" Тогда
        Возврат НСтр("ru='Получение услуг на прочие активы';uk='Отримання послуг на інші активи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление аванса от другой организации" Тогда
        Возврат НСтр("ru='Поступление аванса от другой организации';uk='Надходження авансу від іншої організації'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление аванса от клиента" Тогда
        Возврат НСтр("ru='Поступление аванса от клиента';uk='Надходження авансу від клієнта'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление аванса от розничного клиента (наличные)" Тогда
        Возврат НСтр("ru='Поступление аванса от розничного клиента (наличные)';uk='Надходження авансу від роздрібного клієнта (готівка)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление аванса от розничного клиента (эквайринг)" Тогда
        Возврат НСтр("ru='Поступление аванса от розничного клиента (эквайринг)';uk='Надходження авансу від роздрібного клієнта (еквайринг)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление возвратной тары" Тогда
        Возврат НСтр("ru='Поступление возвратной тары';uk='Надходження зворотної тари'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление ДС из другой кассы" Тогда
        Возврат НСтр("ru='Поступление ДС из другой кассы';uk='Надходження ГК з іншої каси'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление ДС с другого счета" Тогда
        Возврат НСтр("ru='Поступление ДС с другого счета';uk='Надходження ГК з іншого рахунку'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление залога за переданную тару" Тогда
        Возврат НСтр("ru='Поступление залога за переданную тару';uk='Надходження застави за передану тару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление из банка" Тогда
        Возврат НСтр("ru='Поступление из банка';uk='Надходження з банку'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление из кассы ККМ" Тогда
        Возврат НСтр("ru='Поступление из кассы ККМ';uk='Надходження з каси ККМ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление материалов от давальца" Тогда
        Возврат НСтр("ru='Поступление материалов от давальца';uk='Надходження матеріалів від давальця'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление на комиссию" Тогда
        Возврат НСтр("ru='Поступление на комиссию';uk='Надходження на комісію'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление на прочие активы" Тогда
        Возврат НСтр("ru='Поступление на прочие активы';uk='Надходження на інші активи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление начисленных процентов и комиссии по предоставленному займу" Тогда
        Возврат НСтр("ru='Поступление начисленных процентов и комиссии по предоставленному займу';uk='Надходження нарахованих відсотків і комісії по наданій позиці'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление начисленных процентов по депозиту" Тогда
        Возврат НСтр("ru='Поступление начисленных процентов по депозиту';uk='Надходження нарахованих відсотків за депозитом'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление оплаты в кассу" Тогда
        Возврат НСтр("ru='Поступление оплаты в кассу';uk='Надходження оплати в касу'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление оплаты от другой организации" Тогда
        Возврат НСтр("ru='Поступление оплаты от другой организации';uk='Надходження оплати від іншої організації'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление оплаты от клиента" Тогда
        Возврат НСтр("ru='Поступление оплаты от клиента';uk='Надходження оплати від клієнта'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление оплаты по эквайрингу" Тогда
        Возврат НСтр("ru='Поступление оплаты по эквайрингу';uk='Надходження оплати по еквайрингу'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление от подотчетного лица" Тогда
        Возврат НСтр("ru='Поступление от подотчетного лица';uk='Надходження від підзвітної особи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление от поставщика" Тогда
        Возврат НСтр("ru='Поступление от поставщика';uk='Надходження від постачальника'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление по кредитам и займам" Тогда
        Возврат НСтр("ru='Поступление по кредитам и займам';uk='Надходження за кредитами і позиками'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление расходов" Тогда
        Возврат НСтр("ru='Поступление расходов';uk='Надходження витрат'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление товаров" Тогда
        Возврат НСтр("ru='Поступление товаров';uk='Надходження товарів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление товаров на склад" Тогда
        Возврат НСтр("ru='Поступление товаров на склад';uk='Надходження товарів на склад'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Поступление услуг" Тогда
        Возврат НСтр("ru='Поступление услуг';uk='Надходження послуг'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прием товаров на комиссию" Тогда
        Возврат НСтр("ru='Прием товаров на комиссию';uk='Прийом товарів на комісію'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Принятие к учету НМА" Тогда
        Возврат НСтр("ru='Принятие к учету НМА';uk='Прийняття до обліку НМА'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Принятие к учету ОС" Тогда
        Возврат НСтр("ru='Принятие к учету ОС';uk='Прийняття до обліку ОЗ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Продажа комиссионного товара" Тогда
        Возврат НСтр("ru='Продажа комиссионного товара';uk='Продаж комісійного товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Продажа комиссионного товара (сторно)" Тогда
        Возврат НСтр("ru='Продажа комиссионного товара (сторно)';uk='Продаж комісійного товару (сторно)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочее cписание" Тогда
        Возврат НСтр("ru='Прочее cписание';uk='Інше списання'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочее поступление" Тогда
        Возврат НСтр("ru='Прочее поступление';uk='Інше надходження'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочее поступление товаров" Тогда
        Возврат НСтр("ru='Прочее поступление товаров';uk='Інше надходження товарів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочее списание" Тогда
        Возврат НСтр("ru='Прочее списание';uk='Інше списання'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы" Тогда
        Возврат НСтр("ru='Прочие доходы';uk='Інші доходи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы (сторно)" Тогда
        Возврат НСтр("ru='Прочие доходы (сторно)';uk='Інші доходи (сторно)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы от переоценки авансов выданных" Тогда
        Возврат НСтр("ru='Прочие доходы от переоценки авансов выданных';uk='Інші доходи від переоцінки авансів виданих'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы от переоценки авансов полученных" Тогда
        Возврат НСтр("ru='Прочие доходы от переоценки авансов полученных';uk='Інші доходи від переоцінки авансів отриманих'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы от переоценки безналичных ДС" Тогда
        Возврат НСтр("ru='Прочие доходы от переоценки безналичных ДС';uk='Інші доходи від переоцінки безготівкових ГК'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы от переоценки денежных документов" Тогда
        Возврат НСтр("ru='Прочие доходы от переоценки денежных документов';uk='Інші доходи від переоцінки грошових документів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы от переоценки ДС в пути" Тогда
        Возврат НСтр("ru='Прочие доходы от переоценки ДС в пути';uk='Інші доходи від переоцінки ГК в дорозі'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы от переоценки ДС у подотчетников" Тогда
        Возврат НСтр("ru='Прочие доходы от переоценки ДС у подотчетников';uk='Інші доходи від переоцінки ГК у підзвітників'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы от переоценки займов выданных" Тогда
        Возврат НСтр("ru='Прочие доходы от переоценки займов выданных';uk='Інші доходи від переоцінки позик виданих'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы от переоценки комиссии по кредитам, займам полученным" Тогда
        Возврат НСтр("ru='Прочие доходы от переоценки комиссии по кредитам, займам полученным';uk='Інші доходи від переоцінки комісії за кредитами, позиками отриманими'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы от переоценки кредитов, займов полученных" Тогда
        Возврат НСтр("ru='Прочие доходы от переоценки кредитов, займов полученных';uk='Інші доходи від переоцінки кредитів, позик отриманих'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы от переоценки наличных ДС" Тогда
        Возврат НСтр("ru='Прочие доходы от переоценки наличных ДС';uk='Інші доходи від переоцінки готівкових ГК'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы от переоценки процентов по займам выданным" Тогда
        Возврат НСтр("ru='Прочие доходы от переоценки процентов по займам выданным';uk='Інші доходи від переоцінки відсотків за виданими позиками'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы от переоценки процентов по кредитам, займам полученным" Тогда
        Возврат НСтр("ru='Прочие доходы от переоценки процентов по кредитам, займам полученным';uk='Інші доходи від переоцінки відсотків за кредитами, отриманими позиками'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы от переоценки расчетов с клиентами" Тогда
        Возврат НСтр("ru='Прочие доходы от переоценки расчетов с клиентами';uk='Інші доходи від переоцінки розрахунків з клієнтами'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие доходы от переоценки расчетов с поставщиками" Тогда
        Возврат НСтр("ru='Прочие доходы от переоценки расчетов с поставщиками';uk='Інші доходи від переоцінки розрахунків з постачальниками'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие поступления ДС" Тогда
        Возврат НСтр("ru='Прочие поступления ДС';uk='Інші надходження ГК'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы" Тогда
        Возврат НСтр("ru='Прочие расходы';uk='Інші витрати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы (сторно)" Тогда
        Возврат НСтр("ru='Прочие расходы (сторно)';uk='Інші витрати (сторно)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы от переоценки авансов выданных" Тогда
        Возврат НСтр("ru='Прочие расходы от переоценки авансов выданных';uk='Інші витрати від переоцінки авансів виданих'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы от переоценки авансов полученных" Тогда
        Возврат НСтр("ru='Прочие расходы от переоценки авансов полученных';uk='Інші витрати від переоцінки авансів отриманих'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы от переоценки безналичных ДС" Тогда
        Возврат НСтр("ru='Прочие расходы от переоценки безналичных ДС';uk='Інші витрати від переоцінки безготівкових ГК'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы от переоценки денежных документов" Тогда
        Возврат НСтр("ru='Прочие расходы от переоценки денежных документов';uk='Інші витрати від переоцінки грошових документів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы от переоценки ДС в пути" Тогда
        Возврат НСтр("ru='Прочие расходы от переоценки ДС в пути';uk='Інші витрати від переоцінки ГК в дорозі'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы от переоценки ДС у подотчетников" Тогда
        Возврат НСтр("ru='Прочие расходы от переоценки ДС у подотчетников';uk='Інші витрати від переоцінки ГК у подотчетников'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы от переоценки займов выданных" Тогда
        Возврат НСтр("ru='Прочие расходы от переоценки займов выданных';uk='Інші витрати від переоцінки позик виданих'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы от переоценки комиссии по кредитам, займам полученным" Тогда
        Возврат НСтр("ru='Прочие расходы от переоценки комиссии по кредитам, займам полученным';uk='Інші витрати від переоцінки комісії за кредитами, позиками отриманими'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы от переоценки кредитов, займов полученных" Тогда
        Возврат НСтр("ru='Прочие расходы от переоценки кредитов, займов полученных';uk='Інші витрати від переоцінки кредитів, позик отриманих'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы от переоценки наличных ДС" Тогда
        Возврат НСтр("ru='Прочие расходы от переоценки наличных ДС';uk='Інші витрати від переоцінки готівкових ГК'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы от переоценки процентов по займам выданным" Тогда
        Возврат НСтр("ru='Прочие расходы от переоценки процентов по займам выданным';uk='Інші витрати від переоцінки відсотків за позиками виданими'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы от переоценки процентов по кредитам, займам полученным" Тогда
        Возврат НСтр("ru='Прочие расходы от переоценки процентов по кредитам, займам полученным';uk='Інші витрати від переоцінки відсотків за кредитами, позиками отриманими'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы от переоценки расчетов с клиентами" Тогда
        Возврат НСтр("ru='Прочие расходы от переоценки расчетов с клиентами';uk='Інші витрати від переоцінки розрахунків з клієнтами'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочие расходы от переоценки расчетов с поставщиками" Тогда
        Возврат НСтр("ru='Прочие расходы от переоценки расчетов с поставщиками';uk='Інші витрати від переоцінки розрахунків з постачальниками'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Прочих расходы (сторно)" Тогда
        Возврат НСтр("ru='Прочих расходы (сторно)';uk='Інші витрати (сторно)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Распределение расходов" Тогда
        Возврат НСтр("ru='Распределение расходов';uk='Розподіл витрат'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Распределение РБП на прочие активы" Тогда
        Возврат НСтр("ru='Распределение РБП на прочие активы';uk='Розподіл витрат майбутніх періодів на інші активи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Распределение РБП на расходы" Тогда
        Возврат НСтр("ru='Распределение РБП на расходы';uk='Розподіл витрат майбутніх періодів на витрати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Расчеты по комиссионному товару" Тогда
        Возврат НСтр("ru='Расчеты по комиссионному товару';uk='Розрахунки по комісійному товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Ремонт ОС" Тогда
        Возврат НСтр("ru='Ремонт ОС';uk='Ремонт ОЗ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Сдача в банк" Тогда
        Возврат НСтр("ru='Сдача в банк';uk='Здача в банк'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Себестоимость возвращаемой тары" Тогда
        Возврат НСтр("ru='Себестоимость возвращаемой тары';uk='Собівартість тари що повертається'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Себестоимость возвращенного товара другого качества" Тогда
        Возврат НСтр("ru='Себестоимость возвращенного товара другого качества';uk='Собівартість поверненого товару іншої якості'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Себестоимость реализованного товара" Тогда
        Возврат НСтр("ru='Себестоимость реализованного товара';uk='Собівартість реалізованого товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Себестоимость реализованного товара (сторно)" Тогда
        Возврат НСтр("ru='Себестоимость реализованного товара (сторно)';uk='Собівартість реалізованого товару (сторно)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Себестоимость реализованного товара прошлых месяцев (сторно)" Тогда
        Возврат НСтр("ru='Себестоимость реализованного товара прошлых месяцев (сторно)';uk='Собівартість реалізованого товару минулих місяців (сторно)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Себестоимость реализованных работ" Тогда
        Возврат НСтр("ru='Себестоимость реализованных работ';uk='Собівартість реалізованих робіт'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Снятие наличных ДС" Тогда
        Возврат НСтр("ru='Снятие наличных ДС';uk='Зняття готівки '",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание аванса от розничного клиента" Тогда
        Возврат НСтр("ru='Списание аванса от розничного клиента';uk='Списання авансу від роздрібного клієнта'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание ДД на прочие активы" Тогда
        Возврат НСтр("ru='Списание ДД на прочие активы';uk='Списання ГД на інші активи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание ДД на прочие активы и пассивы" Тогда
        Возврат НСтр("ru='Списание ДД на прочие активы и пассивы';uk='Списання ГД на інші активи та пасиви'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание ДД на расходы" Тогда
        Возврат НСтр("ru='Списание ДД на расходы';uk='Списання ГД на витрати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание дополнительного капитала" Тогда
        Возврат НСтр("ru='Списание дополнительного капитала';uk='Списання додаткового капіталу'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание задолженности перед покупателем в доходы" Тогда
        Возврат НСтр("ru='Списание задолженности перед покупателем в доходы';uk='Списання заборгованості перед покупцем у доходи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание задолженности перед поставщиком в доходы" Тогда
        Возврат НСтр("ru='Списание задолженности перед поставщиком в доходы';uk='Списання заборгованості перед постачальником у доходи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание задолженности покупателя" Тогда
        Возврат НСтр("ru='Списание задолженности покупателя';uk='Списання заборгованості покупця'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание задолженности покупателя на активы\пассивы" Тогда
        Возврат НСтр("ru='Списание задолженности покупателя на активы\пассивы';uk='Списання заборгованості покупця на активи\пасиви'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание задолженности покупателя на прочие активы" Тогда
        Возврат НСтр("ru='Списание задолженности покупателя на прочие активы';uk='Списання заборгованості покупця на інші активи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание задолженности поставщика на активы\пассивы" Тогда
        Возврат НСтр("ru='Списание задолженности поставщика на активы\пассивы';uk='Списання заборгованості постачальника на активи\пасиви'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание задолженности поставщика на прочие активы" Тогда
        Возврат НСтр("ru='Списание задолженности поставщика на прочие активы';uk='Списання заборгованості постачальника на інші активи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание задолженности поставщика на расходы" Тогда
        Возврат НСтр("ru='Списание задолженности поставщика на расходы';uk='Списання заборгованості на витрати постачальника'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание комиссионного (давальческого) товара" Тогда
        Возврат НСтр("ru='Списание комиссионного (давальческого) товара';uk='Списання комісійного (давальницького) товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание комиссионного товара" Тогда
        Возврат НСтр("ru='Списание комиссионного товара';uk='Списання комісійного товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание комиссионных товаров" Тогда
        Возврат НСтр("ru='Списание комиссионных товаров';uk='Списання комісійних товарів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание комиссионных товаров (cторно)" Тогда
        Возврат НСтр("ru='Списание комиссионных товаров (cторно)';uk='Списання комісійних товарів (сторно)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание материалов в производство" Тогда
        Возврат НСтр("ru='Списание материалов в производство';uk='Списання матеріалів у виробництво'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание материалов давальца" Тогда
        Возврат НСтр("ru='Списание материалов давальца';uk='Списання матеріалів давальця'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание на прочие активы" Тогда
        Возврат НСтр("ru='Списание на прочие активы';uk='Списання на інші активи'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание на прочие активы (cторно)" Тогда
        Возврат НСтр("ru='Списание на прочие активы (cторно)';uk='Списання на інші активи (сторно)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание на расходы собственных товаров" Тогда
        Возврат НСтр("ru='Списание на расходы собственных товаров';uk='Списання на витрати власних товарів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание на расходы товаров" Тогда
        Возврат НСтр("ru='Списание на расходы товаров';uk='Списання на витрати товарів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание на расходы товаров (cторно)" Тогда
        Возврат НСтр("ru='Списание на расходы товаров (cторно)';uk='Списання на витрати товарів (сторно)'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание на расходы товаров из незавершенного производства" Тогда
        Возврат НСтр("ru='Списание на расходы товаров из незавершенного производства';uk='Списання на витрати товарів з незавершеного виробництва'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание начисленной амортизации НМА" Тогда
        Возврат НСтр("ru='Списание начисленной амортизации НМА';uk='Списання нарахованої амортизації НМА'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание начисленной амортизации ОС" Тогда
        Возврат НСтр("ru='Списание начисленной амортизации ОС';uk='Списання нарахованої амортизації ОЗ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание остаточной стоимости НМА" Тогда
        Возврат НСтр("ru='Списание остаточной стоимости НМА';uk='Списання залишкової вартості НМА'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание остаточной стоимости НМА на расходы" Тогда
        Возврат НСтр("ru='Списание остаточной стоимости НМА на расходы';uk='Списання залишкової вартості НМА на витрати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание остаточной стоимости ОС" Тогда
        Возврат НСтр("ru='Списание остаточной стоимости ОС';uk='Списання залишкової вартості ОЗ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание остаточной стоимости ОС " Тогда
        Возврат НСтр("ru='Списание остаточной стоимости ОС ';uk='Списання залишкової вартості ОЗ '",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание остаточной стоимости ОС на расходы" Тогда
        Возврат НСтр("ru='Списание остаточной стоимости ОС на расходы';uk='Списання залишкової вартості ОЗ на витрати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание остаточной стоимости ОС при передаче" Тогда
        Возврат НСтр("ru='Списание остаточной стоимости ОС при передаче';uk='Списання залишкової вартості ОЗ при передачі'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание продукции давальца" Тогда
        Возврат НСтр("ru='Списание продукции давальца';uk='Списання продукції давальця'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание прочих расходов" Тогда
        Возврат НСтр("ru='Списание прочих расходов';uk='Списання інших витрат'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание себестоимости товара" Тогда
        Возврат НСтр("ru='Списание себестоимости товара';uk='Списання собівартості товару'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание ТМЦ из эксплуатации" Тогда
        Возврат НСтр("ru='Списание ТМЦ из эксплуатации';uk='Списання ТМЦ з експлуатації'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Списание товаров на расходы " Тогда
        Возврат НСтр("ru='Списание товаров на расходы ';uk='Списання товарів на витрати'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Сторно комиссионных товаров" Тогда
        Возврат НСтр("ru='Сторно комиссионных товаров';uk='Сторно комісійних товарів'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Сторно поступления материалов от давальца" Тогда
        Возврат НСтр("ru='Сторно поступления материалов от давальца';uk='Сторно надходження матеріалів від давальця'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Таможенная пошлина" Тогда
        Возврат НСтр("ru='Таможенная пошлина';uk='Мито'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Таможенный сбор" Тогда
        Возврат НСтр("ru='Таможенный сбор';uk='Митний збір'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Увеличение стоимости ОС" Тогда
        Возврат НСтр("ru='Увеличение стоимости ОС';uk='Збільшення вартості ОЗ'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Удержание вознаграждения авансом поставщику" Тогда
        Возврат НСтр("ru='Удержание вознаграждения авансом поставщику';uk='Утримання винагороди авансом постачальнику'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "УменьшениеДопКапитала" Тогда
        Возврат НСтр("ru='УменьшениеДопКапитала';uk='УменьшениеДопКапитала'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Условная продажа" Тогда
        Возврат НСтр("ru='Условная продажа';uk='Умовний продаж'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Условная Продажа" Тогда
        Возврат НСтр("ru='Условная Продажа';uk='Умовний Продаж'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Уценка накопленной амортизации" Тогда
        Возврат НСтр("ru='Уценка накопленной амортизации';uk='Уцінка накопиченої амортизації'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Частичная ликвидация накопленной амортизации" Тогда
        Возврат НСтр("ru='Частичная ликвидация накопленной амортизации';uk='Часткова ліквідація накопиченої амортизації'",КодЯзыка);
    ИначеЕсли СодержаниеПроводки = "Частичная ликвидация стоимости" Тогда
        Возврат НСтр("ru='Частичная ликвидация стоимости';uk='Часткова ліквідація вартості'",КодЯзыка);
	КонецЕсли;
	
КонецФункции // ПолучитьЛокализованноеСодержаниеПроводки()
