#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Если ПравоДоступа("Просмотр", Метаданные.Обработки.СправочноеРазмещениеНоменклатуры) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "ВводНаОснованииУТКлиент.ОпределитьСправочноеРазмещениеПоЯчейкам";
		КомандаСоздатьНаОсновании.Идентификатор = "ОпределитьСправочноеРазмещениеПоЯчейкам";
		КомандаСоздатьНаОсновании.Представление = НСтр("ru='Размещение номенклатуры по ячейкам (справочно)';uk='Розміщення номенклатури по комірках (довідково)'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьАдресноеХранениеСправочно";
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли