////////////////////////////////////////////////////////////////////////////////
// Подсистема "Присоединенные файлы".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет переопределить справочники хранения файлов по типам владельцев.
// 
// Параметры:
//  ТипВладелецФайла  - Тип - тип ссылки объекта, к которому добавляется файл.
//
//  ИменаСправочников - Соответствие - содержит в ключах имена справочников.
//                      При вызове содержит стандартное имя одного справочника,
//                      помеченного, как основной (если существует).
//                      Основной справочник используется для интерактивного
//                      взаимодействия с пользователем. Чтобы указать основной
//                      справочник, нужно установить Истина в значение соответствия.
//                      Если установить Истина более одного раза, тогда будет ошибка.
//
Процедура ПриОпределенииСправочниковХраненияФайлов(ТипВладелецФайла, ИменаСправочников) Экспорт
	
	Если Метаданные.ОпределяемыеТипы.ВладелецПрисоединенныхФайлов.Тип.СодержитТип(ТипВладелецФайла) Тогда
		ЕстьОсновнойСправочник = Ложь;
		МассивКлючейКУдалению = Новый Массив;
		Для Каждого КлючИЗначение Из ИменаСправочников Цикл
			Если Метаданные.Справочники.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
				МассивКлючейКУдалению.Добавить(КлючИЗначение.Ключ);
			Иначе
				ЕстьОсновнойСправочник = (НЕ ЕстьОсновнойСправочник И КлючИЗначение.Значение = Истина);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Ключ Из МассивКлючейКУдалению Цикл
			ИменаСправочников.Удалить(Ключ);
		КонецЦикла;
		//++ НЕ ГИСМ
		ИменаСправочников.Вставить("ЭДПрисоединенныеФайлы", НЕ ЕстьОсновнойСправочник);
	Иначе
		ИменаСправочников.Вставить("ЭДПрисоединенныеФайлы");
		//-- НЕ ГИСМ
	КонецЕсли;
	
	
КонецПроцедуры

// Формирует массив метаданных, которые не должны выводиться в настройках очистки файлов.
//
// Параметры:
//   МассивИсключений   - Массив - метаданные, которые не должны выводиться в настройках очистки файлов.
//
Процедура ПриОпределенииОбъектовИсключенияОчисткиФайлов(МассивИсключений) Экспорт
	
КонецПроцедуры

// Формирует массив метаданных, которые не должны выводиться в настройках синхронизации файлов.
//
// Параметры:
//   МассивИсключений   -Массив - метаданные, которые не должны выводиться в настройках синхронизации файлов.
//
Процедура ПриОпределенииОбъектовИсключенияСинхронизацииФайлов(МассивИсключений) Экспорт
	
	МассивИсключений.Добавить(Метаданные.Справочники.ЭДПрисоединенныеФайлы);
	
КонецПроцедуры

// Устарела.Следует использовать ПриОпределенииОбъектовИсключенияОчисткиФайлов.
//
Функция ОбъектыИсключенияПриОчисткеФайлов() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Метаданные.Справочники.ЭДПрисоединенныеФайлы);
	Возврат Массив;
	
КонецФункции

#КонецОбласти

