////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы
Процедура ОбновитьПредопределенныеСтатьи() Экспорт
	
	Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.ЗаполнитьОбъект("РегистрСведений", "НаборыСтатейНалоговыхДеклараций");	
		
КонецПроцедуры

Процедура ОбновитьПредопределенныеСтатьиСПредварительнойОчисткой() Экспорт
	
	Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.ЗаполнитьОбъект("РегистрСведений", "НаборыСтатейНалоговыхДеклараций", Истина);
		
КонецПроцедуры
