
///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПолучитьСписокСтатейПоНаборуСтатей(НаборСтатейНалоговыхДеклараций, ВключаяРодителей = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НаборыСтатейНалоговыхДеклараций.Статья КАК Статья
	|ИЗ
	|	РегистрСведений.НаборыСтатейНалоговыхДеклараций КАК НаборыСтатейНалоговыхДеклараций
	|ГДЕ
	|	НаборыСтатейНалоговыхДеклараций.Набор = &Набор";
	
	Если ВключаяРодителей Тогда
		Запрос.Текст = Запрос.Текст + "
		|ИТОГИ ПО
		|	Статья ИЕРАРХИЯ";		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Набор", НаборСтатейНалоговыхДеклараций);
	
	СписокСтатейСРодителями = Новый СписокЗначений;
	СписокСтатейСРодителями.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Статья"));
	
	Возврат СписокСтатейСРодителями;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ВидНалоговойДекларации = Неопределено;
	Если Параметры.Свойство("ВидНалоговойДекларации", ВидНалоговойДекларации) Тогда
		Параметры.Отбор.Вставить("ВидНалоговойДекларации", ВидНалоговойДекларации);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы
Процедура ОбновитьПредопределенныеСтатьи() Экспорт
	
	Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.ЗаполнитьОбъект("Справочник", "СтатьиНалоговыхДеклараций");
	
КонецПроцедуры
