
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоПредопределенныйУзелПланаОбмена(Объект.Ссылка) Тогда
		Элементы.НастройкаФильтровРегистрации.Видимость = Ложь;
		Элементы.НастройкаСоответствий.Видимость = Ложь;
		Элементы.СтраницыФормы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	УстановитьВидимостьНаСервере();
КонецПроцедуры

#КонецОбласти

// Возвращает признак предопределенного узла этой информационной базы по переданному значению ссылки
//
// Параметры:
//  УзелПланаОбмена - ПланОбменаСсылка - любой узел плана обмена
// 
// Возвращаемое значение:
//  Булево - признак предопределенного узла этой информационной базы
//
Функция ЭтоПредопределенныйУзелПланаОбмена(УзелПланаОбмена) 
	
	Если Не ЗначениеЗаполнено(УзелПланаОбмена) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОбменДаннымиПовтИсп.ПолучитьЭтотУзелПланаОбменаПоСсылке(УзелПланаОбмена) = УзелПланаОбмена;
	
КонецФункции

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьОтборПриИзменении(Элемент)
	УстановитьВидимостьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

&НаСервере
Процедура УстановитьВидимостьНаСервере()
			
	Элементы.Кассы.Видимость 		= Объект.ИспользоватьОтборПоКассам;
	Элементы.ВидыЦен.Видимость		= Объект.ИспользоватьОтборПоВидамЦен;
	Элементы.Организации.Видимость	= Объект.ИспользоватьОтборПоОрганизациям;
	Элементы.Соглашение.Видимость 	= ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
