
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтрокиСодержатНеТолькоОтгрузку = Параметры.ВыделенныеСтрокиСодержатНеТолькоОтгрузку;
	
	Если ВыделенныеСтрокиСодержатНеТолькоОтгрузку Тогда
		ТекстПояснения = НСтр("ru='У выделенных в списке документов будет установлен статус ""Реализовано"".';uk='У виділених у списку документів буде встановлено статус ""Реалізовано"".'");	
	Иначе		
		ТекстПояснения = НСтр("ru='У выделенных в списке документов реализации будут установлены статус ""Реализовано""';uk='У виділених у списку документів реалізації будуть встановлені статуси ""Реалізовано""'");
	КонецЕсли;
		
	Элементы.ДекорацияПояснение.Заголовок = ТекстПояснения;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСтатус(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Закрыть(Новый Структура());
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();

КонецПроцедуры

#КонецОбласти
