
Функция Connect(DeviceID)
	
	Настройки = МенеджерОборудованияСервисы.Соединиться(DeviceID);
	Возврат Настройки;
	
КонецФункции

Функция GetSettings(DeviceID)
	
	Настройки = МенеджерОборудованияСервисы.ПолучитьНастройки(DeviceID);
	Возврат Настройки;
	
КонецФункции

Функция GetPriceList(DeviceID)
	
	ПрайсЛист = МенеджерОборудованияСервисы.ПолучитьПрайсЛист(DeviceID);
	Возврат ПрайсЛист;
	
КонецФункции

Функция GetDocTypes()
	Ответ = МенеджерОборудованияСервисы.ПолучитьТипыДокументов();
	Возврат Ответ;
КонецФункции

Функция PostDocs(DeviceID, DocType, Document)
	
	Ответ = МенеджерОборудованияСервисы.ЗагрузитьДокумент(DeviceID, DocType, Document);
	Возврат Ответ;
	
КонецФункции

