&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ИзменениеДатыУчетнойПолитики(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДатаИзмененияУчетнойПолитикиПриИзменении(Элемент)
	ИзменениеДатыУчетнойПолитики(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДатыУчетнойПолитики(ИзменениеПериода)
	
	СтруктураСтроки = Новый Структура("УчетнаяПолитика, Период, ДатаИзмененияУчетнойПолитики");
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, Запись);
	ИзменениеДатыУчетнойПолитикиНаСервере(СтруктураСтроки, ИзменениеПериода);
	ЗаполнитьЗначенияСвойств(Запись, СтруктураСтроки);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменениеДатыУчетнойПолитикиНаСервере(СтруктураСтроки, ИзменениеПериода)
	УчетнаяПолитикаПереопределяемый.ПреобразоватьЗаписьУчетнойПолитикиПередЗаписью(СтруктураСтроки, ИзменениеПериода);
КонецПроцедуры
