#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

Процедура КорректироватьДвиженияРегистраДанныеДляОбновления(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.ЛимитыРасходаДенежныхСредств";

	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛимитыРасходаДенежныхСредств.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ЛимитыРасходаДенежныхСредств КАК ЛимитыРасходаДенежныхСредств
	|ГДЕ
	|	ЛимитыРасходаДенежныхСредств.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|	И ТИПЗНАЧЕНИЯ(ЛимитыРасходаДенежныхСредств.Регистратор) В (
	|		ТИП(Документ.ЗаявкаНаРасходованиеДенежныхСредств),
	|		ТИП(Документ.СписаниеБезналичныхДенежныхСредств)
	|	)
	|
	|");
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
КонецПроцедуры

// Обработчик обновления BAS УТ 3.2.2
// Обновляет движения по регистру ЛимитыРасходаДенежныхСредств
Процедура КорректироватьДвиженияРегистра(Параметры) Экспорт
	
	Регистраторы = Новый Массив;
	Регистраторы.Добавить("Документ.ЗаявкаНаРасходованиеДенежныхСредств");
	Регистраторы.Добавить("Документ.СписаниеБезналичныхДенежныхСредств");
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(
        Регистраторы,
		"РегистрНакопления.ЛимитыРасходаДенежныхСредств",
		Параметры.Очередь
    );
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
