#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЕстьПриемка(СкладскиеОперации) Экспорт
	
	Возврат СкладыКлиентСервер.ЕстьПриемка(СкладскиеОперации);
	
КонецФункции

Функция СкладскиеОперацииПриемки() Экспорт
	
	Возврат СкладыКлиентСервер.СкладскиеОперацииПриемки();
	
КонецФункции

Функция ЕстьОтгрузка(СкладскиеОперации) Экспорт
	
	Возврат СкладыКлиентСервер.ЕстьОтгрузка(СкладскиеОперации);
	
КонецФункции

Функция СкладскиеОперацииОтгрузки() Экспорт
	
	Возврат СкладыКлиентСервер.СкладскиеОперацииОтгрузки();

КонецФункции

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МассивИсключаемыхЗначений = Новый Массив;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство") Тогда
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ПриемкаПродукцииИзПроизводства"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ВыпускПродукцииВПодразделение"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ОтгрузкаПоПеремещениюВПроизводстве"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ОтражениеВыходныхИзделийВМаршрутныхЛистах"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ПриемкаПоПеремещениюВПроизводстве"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.РасходМатериаловПриВыполненииМаршрутныхЛистов"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ПередачаВПроизводствоОтгрузка"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ПередачаВПроизводствоПриемка"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ВозвратИзПроизводстваНаСклад"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ПриемкаПродукцииИзПроизводства"));
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСборкуРазборку") Тогда
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ОтгрузкаКомплектовДляРазборки"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ОтгрузкаКомплектующихДляСборки"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ПриемкаСобранныхКомплектов"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ПриемкаКомплектующихПослеРазборки"));
	КонецЕсли;	
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьАдресноеХранение") Тогда
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ОтборИзЯчеек"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.РазмещениеВЯчейки"));
	КонецЕсли;	
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСкладскиеПомещения") Тогда
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ПеремещениеМеждуПомещениями"));
	КонецЕсли;	
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПеремещениеТоваров") Тогда
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ОтгрузкаПоПеремещению"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ПриемкаПоПеремещению"));
	КонецЕсли;	
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРозничныеПродажи") Тогда
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ОтгрузкаВРозницу"));
	КонецЕсли;	
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПрочееОприходованиеТоваров") Тогда
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ПриемкаПоПрочемуОприходованию"));
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВнутреннееПотребление") Тогда
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ОтгрузкаНаВнутренниеНужды"));
	КонецЕсли;
		
	ОбщегоНазначенияУТВызовСервера.ПолучитьСписокВыбораПеречисления(
		"СкладскиеОперации",
		ДанныеВыбора,
		Параметры,
		МассивИсключаемыхЗначений);
	
КонецПроцедуры

#КонецОбласти


