
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	НаРасходыБудущихПериодов = (Параметры.ВариантРаспределенияРасходов = Перечисления.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов);

	РазрешитьРедактированиеВариантРаспределенияРасходов = Истина;
	Если НаРасходыБудущихПериодов И Параметры.ЗаполненаСтатьяРасходовСписания Тогда
		РазрешитьРедактированиеАналитикаРасходов = Ложь;
		Элементы.РазрешитьРедактированиеАналитикаРасходов.Доступность = Ложь;
		Элементы.ОписаниеАналитикаРасходов.Заголовок = 
			НСтр("ru='Используется аналитика расходов, указанная в выбранной статье списания расходов';uk='Використовується аналітика витрат, зазначена у вибраній статті списання витрат'");
	Иначе
		РазрешитьРедактированиеАналитикаРасходов = Истина;
	КонецЕсли;
	РазрешитьРедактированиеВариантРаздельногоУчетаНДС = Истина;
	
	Элементы.ОписаниеСтатьяСписанияРасходов.Видимость = НаРасходыБудущихПериодов;
	Элементы.РазрешитьРедактированиеСтатьиРасходов.Видимость = НаРасходыБудущихПериодов;
	
	РазрешитьРедактированиеНастроекРегламентированногоУчета = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)

	Результат = Новый Массив;
	Если РазрешитьРедактированиеВариантРаспределенияРасходов Тогда
		Результат.Добавить("ВариантРаспределенияРасходов");
	КонецЕсли;
	Если РазрешитьРедактированиеСтатьиРасходов Тогда
		Результат.Добавить("СтатьяРасходов");
	КонецЕсли;
	Если РазрешитьРедактированиеАналитикаРасходов Тогда
		Результат.Добавить("ТипЗначенияНаНаправленияДеятельности");
		Результат.Добавить("ТипЗначенияНаСебестоимостьТоваров");
		Результат.Добавить("ТипЗначенияНаРасходыБудущихПериодов");
		Результат.Добавить("ТипЗначенияНаПроизводственныеЗатраты");
		Результат.Добавить("ТипЗначенияНеРаспределять");
		Результат.Добавить("ВидЦенности");
		Результат.Добавить("РасходыНаРемонтОС");
		Результат.Добавить("СчетУчета8Класс");
		Результат.Добавить("СебестоимостьРеализации");		
	КонецЕсли;
	Если РазрешитьРедактированиеНастроекРегламентированногоУчета Тогда
		Результат.Добавить("СчетУчета");
		Результат.Добавить("ВидАктива");
	КонецЕсли;
	Закрыть(Результат);

КонецПроцедуры

#КонецОбласти
