
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры.Объект, ИзменяемыеРеквизиты());
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Результат = Новый Структура(ИзменяемыеРеквизиты());
		ЗаполнитьЗначенияСвойств(Результат, Объект);
		Закрыть(Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИзменяемыеРеквизиты()
	
	Возврат "ОтображатьНеутвержденные, ОтображениеСумм,
			|ЗаказыПокупателей, ЗаказыПоставщикам, ВозвратыТоваровОтКлиента, ВозвратыТоваровПоставщику,
			|ВедомостиНаВыплатуЗарплаты, СчетаНаОплатуПокупателям, ПоступленияПоФинансовойДеятельности,
			|РасходыПоФинансовойДеятельности, ПоступленияПоЭквайрингу,
			|ОтражатьОтрицательныеСуммы";
	
КонецФункции

#КонецОбласти

