#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

#Область ПрограммныйИнтерфейс

// Функция определяет группу аналитического учета по умолчанию.
//
// Возвращает группу аналитического учета, если найден один элемент справочника.
// Возвращает ПустуюСсылку в противном случае
//
// Возвращаемое значение:
//	СправочникСсылка.ГруппыАналитическогоУчетаНоменклатуры
//
Функция ПолучитьГруппуАналитическогоУчетаПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ДанныеСправочника.Ссылка КАК ГруппаАналитическогоУчета
	|ИЗ
	|	Справочник.ГруппыАналитическогоУчетаНоменклатуры КАК ДанныеСправочника
	|ГДЕ
	|	НЕ ДанныеСправочника.ПометкаУдаления
	|	И Не ДанныеСправочника.ЭтоГруппа
	|");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 
	   И Выборка.Следующий()
	Тогда
		ГруппаАналитическогоУчета = Выборка.ГруппаАналитическогоУчета;
	Иначе
		ГруппаАналитическогоУчета = Справочники.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	Возврат ГруппаАналитическогоУчета;
КонецФункции

#КонецОбласти

#КонецЕсли
