////////////////////////////////////////////////////////////////////////////////
// Подсистема "Версионирование объектов".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается для получения версионируемых табличных документов во время записи версии объекта.
// 
// Параметры:
//  Ссылка - Ссылка на версионируемый объект конфигурации.
//  ТабличныеДокументы - Структура - содержит данные:
//   * Ключ     - Строка    - Имя табличного документа;
//   * Значение - Структура - содержит поля:
//                 * Наименование - Строка - Наименование табличного документа;
//                 * Данные       - ТабличныйДокумент - версионируемый табличный документ.
//
// Возвращаемое значение:
//
Процедура ПриПолученииТабличныхДокументовОбъекта(Ссылка, ТабличныеДокументы) Экспорт
	
	
КонецПроцедуры

// Вызывается после разбора прочитанной из регистра версии объекта,
//  может использоваться для дополнительной обработки результата разбора версии.
// 
// Параметры:
//  Ссылка    - Ссылка на версионируемый объект конфигурации.
//  Результат - Структура - Результат разбора версии подсистемой версионирования.
//
Процедура ПослеРазбораВерсииОбъекта(Ссылка, Результат) Экспорт
	
	
КонецПроцедуры

// Вызывается после определения реквизитов объекта из формы 
// РегистрСведений.ВерсииОбъектов.ВыборРеквизитовОбъекта.
// 
// Параметры:
//  Ссылка    - Ссылка на версионируемый объект конфигурации.
//  ДеревоРеквизитов - ДанныеФормыДерево - Дерево реквизитов объектов.
//
Процедура ПриВыбореРеквизитовОбъекта(Ссылка, ДеревоРеквизитов) Экспорт
	
	
КонецПроцедуры

// Вызывается при получении представления реквизита объекта.
// 
// Параметры:
//  Ссылка    - Ссылка на версионируемый объект конфигурации.
//  ИмяРеквизита - Строка - ИмяРеквизита как задано в конфигураторе.
//  НаименованиеРеквизита - Строка - выходной параметр, можно переопределить полученный синоним.
//  Видимость - Булево - выводить реквизит в отчетах по версиям.
//
Процедура ПриОпределенииНаименованияРеквизитаОбъекта(Ссылка, ИмяРеквизита, НаименованиеРеквизита, Видимость) Экспорт
	
	
КонецПроцедуры

// Дополняет объект реквизитами, хранящимися отдельно от объекта, либо в служебной части самого объекта,
// не предназначенной для вывода в отчетах.
Процедура ПриПодготовкеДанныхОбъекта(Объект, ДополнительныеРеквизиты) Экспорт 
	
КонецПроцедуры

// Восстанавливает значения реквизитов объекта, хранящихся отдельно от объекта.
Процедура ПриВосстановленииВерсииОбъекта(Объект, ДополнительныеРеквизиты) Экспорт
	
КонецПроцедуры

#КонецОбласти