
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Ключ", ПолучитьОрганизациюПоУмолчанию());
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОрганизациюПоУмолчанию()
	
	Возврат ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию();
	
КонецФункции

