
#Область ПрограммныйИнтерфейс

// Обработчик события "ОбработкаПолученияДанныхВыбора" модуля менеджера перечисления СтавкиНДС
//
// Параметры:
//  Источник - ОбъектМенеджер
//  ДанныеВыбора - СписокЗначений
//  Параметры - Структура
//  СтандартнаяОбработка - Булево
//
Процедура СтавкиНДСОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивИсключаемыхЗначений = Новый Массив;
	
	Если Не Константы.ИспользоватьПродажиНаЭкспорт.Получить() Тогда
		МассивИсключаемыхЗначений.Добавить(Перечисления.СтавкиНДС.НДС0);
	КонецЕсли;
	
	Если МассивИсключаемыхЗначений.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОбщегоНазначенияУТВызовСервера.ПолучитьСписокВыбораПеречисления(
			"СтавкиНДС",
			ДанныеВыбора,
			Параметры,
			МассивИсключаемыхЗначений);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработатьЖурналУчетаСчетовФактурПоКомиссионнымСчетамФактурам

#КонецОбласти

#Область ОбработатьНДСЗаписиКнигиПродажПоКомиссионнымСчетамФактурам

#КонецОбласти

#Область ОбработатьНДСЗаписиКнигиПокупокПоКомиссионнымСчетамФактурам

#КонецОбласти



#КонецОбласти
